/* Generated by gloam. DO NOT EDIT. */

#ifndef GLOAM_GL_H
#define GLOAM_GL_H

#ifdef __clang__
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#endif
#ifdef __gl_h_
  #error OpenGL (gl.h) header already included (API: gl), remove previous include!
#endif
#define __gl_h_ 1
#ifdef __glext_h_
  #error OpenGL (glext.h) header already included (API: gl), remove previous include!
#endif
#define __glext_h_ 1
#ifdef __gl2_h_
  #error OpenGL ES 2 (gl2.h) header already included (API: gles2), remove previous include!
#endif
#define __gl2_h_ 1
#ifdef __gles2_gl2_h_
  #error OpenGL ES 2 header already included (API: gles2), remove previous include!
#endif
#define __gles2_gl2_h_ 1
#ifdef __gl3_h_
  #error OpenGL ES 3 (gl3.h) header already included (API: gles2), remove previous include!
#endif
#define __gl3_h_ 1
#ifdef __gles2_gl3_h_
  #error OpenGL ES 3 header already included (API: gles2), remove previous include!
#endif
#define __gles2_gl3_h_ 1
#ifdef __clang__
#pragma clang diagnostic pop
#endif

#include <stddef.h>
#include <stdint.h>

#include "KHR/khrplatform.h"

#ifdef __cplusplus
extern "C" {
#endif

/* Calling convention */
#ifndef APIENTRY
#  if defined(_WIN32)
#    define APIENTRY __stdcall
#  else
#    define APIENTRY
#  endif
#endif
#ifndef APIENTRYP
#  define APIENTRYP APIENTRY *
#endif
#ifndef GLAPI
#  define GLAPI extern
#endif

/* Calling convention for GL callback function pointers (e.g. debug callbacks,

typedef void (APIENTRYP PFNGLTEXSTORAGEMEMFLAGS3DANGLEPROC)(GLenum target, GLsizei levels, GLenum internalFormat, GLsizei width, GLsizei height, GLsizei depth, GLuint memory, GLuint64 offset, GLbitfield createFlags, GLbitfield usageFlags, const void * imageCreateInfoPNext);
typedef void (APIENTRYP PFNGLTEXSTORAGEMEMFLAGS3DMULTISAMPLEANGLEPROC)(GLenum target, GLsizei samples, GLenum internalFormat, GLsizei width, GLsizei height, GLsizei depth, GLboolean fixedSampleLocations, GLuint memory, GLuint64 offset, GLbitfield createFlags, GLbitfield usageFlags, const void * imageCreateInfoPNext);
typedef void (APIENTRYP PFNGLIMPORTMEMORYZIRCONHANDLEANGLEPROC)(GLuint memory, GLuint64 size, GLenum handleType, GLuint handle);
typedef void (APIENTRYP PFNGLIMPORTSEMAPHOREZIRCONHANDLEANGLEPROC)(GLuint semaphore, GLenum handleType, GLuint handle);
typedef void (APIENTRYP PFNGLFRAMEBUFFERMEMORYLESSPIXELLOCALSTORAGEANGLEPROC)(GLint plane, GLenum internalformat, GLbitfield usage);
typedef void (APIENTRYP PFNGLFRAMEBUFFERTEXTUREPIXELLOCALSTORAGEANGLEPROC)(GLint plane, GLuint backingtexture, GLint level, GLint layer, GLbitfield usage);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEFVANGLEPROC)(GLint plane, const GLfloat * value);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEIVANGLEPROC)(GLint plane, const GLint * value);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEUIVANGLEPROC)(GLint plane, const GLuint * value);
typedef void (APIENTRYP PFNGLBEGINPIXELLOCALSTORAGEANGLEPROC)(GLsizei n, const GLenum * loadops);
typedef void (APIENTRYP PFNGLENDPIXELLOCALSTORAGEANGLEPROC)(GLsizei n, const GLenum * storeops);
typedef void (APIENTRYP PFNGLENDPIXELLOCALSTORAGEIMPLICITANGLEPROC)(void);
typedef void (APIENTRYP PFNGLPIXELLOCALSTORAGEBARRIERANGLEPROC)(void);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALSTORAGEINTERRUPTANGLEPROC)(void);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALSTORAGERESTOREANGLEPROC)(void);
typedef void (APIENTRYP PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVANGLEPROC)(GLint plane, GLenum pname, GLfloat * params);
typedef void (APIENTRYP PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVANGLEPROC)(GLint plane, GLenum pname, GLint * params);
typedef void (APIENTRYP PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERUIVANGLEPROC)(GLint plane, GLenum pname, GLuint * params);
typedef void (APIENTRYP PFNGLLOGICOPANGLEPROC)(GLenum opcode);
typedef void (APIENTRYP PFNGLBLOBCACHECALLBACKSANGLEPROC)(GLSETBLOBPROCANGLE set, GLGETBLOBPROCANGLE get, const void * userParam);
typedef void (APIENTRYP PFNGLGETPOINTERVANGLEPROC)(GLenum pname, void ** params);



/* ---- Context struct ------------------------------------------------------
   Three anonymous unions give both indexed (array) and named (struct member)
   access to the same memory, at zero runtime cost.

   featArray / extArray: unsigned char flags, one per feature / extension.
   pfnArray: function pointer slots, one per command.

   Anonymous structs inside the unions are a C11 / GCC extension; they are
   universally supported on our target compilers. */
typedef struct GloamGLContext {
    union {
        unsigned char featArray[23];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        /*    1 */ unsigned char VERSION_1_1;
        /*    2 */ unsigned char VERSION_1_2;
        /*    3 */ unsigned char VERSION_1_3;
        /*    4 */ unsigned char VERSION_1_4;
        /*    5 */ unsigned char VERSION_1_5;
        /*    6 */ unsigned char VERSION_2_0;
        /*    7 */ unsigned char VERSION_2_1;
        /*    8 */ unsigned char VERSION_3_0;
        /*    9 */ unsigned char VERSION_3_1;
        /*   10 */ unsigned char VERSION_3_2;
        /*   11 */ unsigned char VERSION_3_3;
        /*   12 */ unsigned char VERSION_4_0;
        /*   13 */ unsigned char VERSION_4_1;
        /*   14 */ unsigned char VERSION_4_2;
        /*   15 */ unsigned char VERSION_4_3;
        /*   16 */ unsigned char VERSION_4_4;
        /*   17 */ unsigned char VERSION_4_5;
        /*   18 */ unsigned char VERSION_4_6;
        /*   19 */ unsigned char ES_VERSION_2_0;
        /*   20 */ unsigned char ES_VERSION_3_0;
        /*   21 */ unsigned char ES_VERSION_3_1;
        /*   22 */ unsigned char ES_VERSION_3_2;
        };
    };

    union {
        unsigned char extArray[969];
        struct {
        /*    0 */ unsigned char _3DFX_multisample;
        /*    1 */ unsigned char _3DFX_tbuffer;
        /*    2 */ unsigned char _3DFX_texture_compression_FXT1;
        /*    3 */ unsigned char AMD_blend_minmax_factor;
        /*    4 */ unsigned char AMD_compressed_3DC_texture;
        /*    5 */ unsigned char AMD_compressed_ATC_texture;
        /*    6 */ unsigned char AMD_conservative_depth;
        /*    7 */ unsigned char AMD_debug_output;
        /*    8 */ unsigned char AMD_depth_clamp_separate;
        /*    9 */ unsigned char AMD_draw_buffers_blend;
        /*   10 */ unsigned char AMD_framebuffer_multisample_advanced;
        /*   11 */ unsigned char AMD_framebuffer_sample_positions;
        /*   12 */ unsigned char AMD_gcn_shader;
        /*   13 */ unsigned char AMD_gpu_shader_half_float;
        /*   14 */ unsigned char AMD_gpu_shader_int16;
        /*   15 */ unsigned char AMD_gpu_shader_int64;
        /*   16 */ unsigned char AMD_interleaved_elements;
        /*   17 */ unsigned char AMD_multi_draw_indirect;
        /*   18 */ unsigned char AMD_name_gen_delete;
        /*   19 */ unsigned char AMD_occlusion_query_event;
        /*   20 */ unsigned char AMD_performance_monitor;
        /*   21 */ unsigned char AMD_pinned_memory;
        /*   22 */ unsigned char AMD_program_binary_Z400;
        /*   23 */ unsigned char AMD_query_buffer_object;
        /*   24 */ unsigned char AMD_sample_positions;
        /*   25 */ unsigned char AMD_seamless_cubemap_per_texture;
        /*   26 */ unsigned char AMD_shader_atomic_counter_ops;
        /*   27 */ unsigned char AMD_shader_ballot;
        /*   28 */ unsigned char AMD_shader_explicit_vertex_parameter;
        /*   29 */ unsigned char AMD_shader_fragment_mask;
        /*   30 */ unsigned char AMD_shader_gpu_shader_half_float_fetch;
        /*   31 */ unsigned char AMD_shader_image_load_store_lod;
        /*   32 */ unsigned char AMD_shader_stencil_export;
        /*   33 */ unsigned char AMD_shader_trinary_minmax;
        /*   34 */ unsigned char AMD_sparse_texture;
        /*   35 */ unsigned char AMD_stencil_operation_extended;
        /*   36 */ unsigned char AMD_texture_gather_bias_lod;
        /*   37 */ unsigned char AMD_texture_texture4;
        /*   38 */ unsigned char AMD_transform_feedback3_lines_triangles;
        /*   39 */ unsigned char AMD_transform_feedback4;
        /*   40 */ unsigned char AMD_vertex_shader_layer;
        /*   41 */ unsigned char AMD_vertex_shader_tessellator;
        /*   42 */ unsigned char AMD_vertex_shader_viewport_index;
        /*   43 */ unsigned char ANDROID_extension_pack_es31a;
        /*   44 */ unsigned char ANGLE_base_vertex_base_instance;
        /*   45 */ unsigned char ANGLE_blob_cache;
        /*   46 */ unsigned char ANGLE_client_arrays;
        /*   47 */ unsigned char ANGLE_clip_cull_distance;
        /*   48 */ unsigned char ANGLE_copy_texture_3d;
        /*   49 */ unsigned char ANGLE_depth_texture;
        /*   50 */ unsigned char ANGLE_framebuffer_blit;
        /*   51 */ unsigned char ANGLE_framebuffer_multisample;
        /*   52 */ unsigned char ANGLE_get_image;
        /*   53 */ unsigned char ANGLE_get_serialized_context_string;
        /*   54 */ unsigned char ANGLE_get_tex_level_parameter;
        /*   55 */ unsigned char ANGLE_instanced_arrays;
        /*   56 */ unsigned char ANGLE_logic_op;
        /*   57 */ unsigned char ANGLE_lossy_etc_decode;
        /*   58 */ unsigned char ANGLE_memory_object_flags;
        /*   59 */ unsigned char ANGLE_memory_object_fuchsia;
        /*   60 */ unsigned char ANGLE_memory_size;
        /*   61 */ unsigned char ANGLE_multi_draw;
        /*   62 */ unsigned char ANGLE_pack_reverse_row_order;
        /*   63 */ unsigned char ANGLE_polygon_mode;
        /*   64 */ unsigned char ANGLE_program_binary;
        /*   65 */ unsigned char ANGLE_program_binary_readiness_query;
        /*   66 */ unsigned char ANGLE_program_cache_control;
        /*   67 */ unsigned char ANGLE_provoking_vertex;
        /*   68 */ unsigned char ANGLE_renderability_validation;
        /*   69 */ unsigned char ANGLE_request_extension;
        /*   70 */ unsigned char ANGLE_rgbx_internal_format;
        /*   71 */ unsigned char ANGLE_robust_client_memory;
        /*   72 */ unsigned char ANGLE_robust_fragment_shader_output;
        /*   73 */ unsigned char ANGLE_robust_resource_initialization;
        /*   74 */ unsigned char ANGLE_semaphore_fuchsia;
        /*   75 */ unsigned char ANGLE_shader_binary;
        /*   76 */ unsigned char ANGLE_shader_pixel_local_storage;
        /*   77 */ unsigned char ANGLE_stencil_texturing;
        /*   78 */ unsigned char ANGLE_texture_compression_dxt1;
        /*   79 */ unsigned char ANGLE_texture_compression_dxt3;
        /*   80 */ unsigned char ANGLE_texture_compression_dxt5;
        /*   81 */ unsigned char ANGLE_texture_external_update;
        /*   82 */ unsigned char ANGLE_texture_multisample;
        /*   83 */ unsigned char ANGLE_texture_usage;
        /*   84 */ unsigned char ANGLE_translated_shader_source;
        /*   85 */ unsigned char ANGLE_vulkan_image;
        /*   86 */ unsigned char ANGLE_yuv_internal_format;
        /*   87 */ unsigned char APPLE_aux_depth_stencil;
        /*   88 */ unsigned char APPLE_client_storage;
        /*   89 */ unsigned char APPLE_clip_distance;
        /*   90 */ unsigned char APPLE_color_buffer_packed_float;
        /*   91 */ unsigned char APPLE_copy_texture_levels;
        /*   92 */ unsigned char APPLE_element_array;
        /*   93 */ unsigned char APPLE_fence;
        /*   94 */ unsigned char APPLE_float_pixels;
        /*   95 */ unsigned char APPLE_flush_buffer_range;
        /*   96 */ unsigned char APPLE_framebuffer_multisample;
        /*   97 */ unsigned char APPLE_object_purgeable;
        /*   98 */ unsigned char APPLE_rgb_422;
        /*   99 */ unsigned char APPLE_row_bytes;
        /*  100 */ unsigned char APPLE_specular_vector;
        /*  101 */ unsigned char APPLE_sync;
        /*  102 */ unsigned char APPLE_texture_format_BGRA8888;
        /*  103 */ unsigned char APPLE_texture_max_level;
        /*  104 */ unsigned char APPLE_texture_packed_float;
        /*  105 */ unsigned char APPLE_texture_range;
        /*  106 */ unsigned char APPLE_transform_hint;
        /*  107 */ unsigned char APPLE_vertex_array_object;
        /*  108 */ unsigned char APPLE_vertex_array_range;
        /*  109 */ unsigned char APPLE_vertex_program_evaluators;
        /*  110 */ unsigned char APPLE_ycbcr_422;
        /*  111 */ unsigned char ARB_ES2_compatibility;
        /*  112 */ unsigned char ARB_ES3_1_compatibility;
        /*  113 */ unsigned char ARB_ES3_2_compatibility;
        /*  114 */ unsigned char ARB_ES3_compatibility;
        /*  115 */ unsigned char ARB_arrays_of_arrays;
        /*  116 */ unsigned char ARB_base_instance;
        /*  117 */ unsigned char ARB_bindless_texture;
        /*  118 */ unsigned char ARB_blend_func_extended;
        /*  119 */ unsigned char ARB_buffer_storage;
        /*  120 */ unsigned char ARB_cl_event;
        /*  121 */ unsigned char ARB_clear_buffer_object;
        /*  122 */ unsigned char ARB_clear_texture;
        /*  123 */ unsigned char ARB_clip_control;
        /*  124 */ unsigned char ARB_color_buffer_float;
        /*  125 */ unsigned char ARB_compatibility;
        /*  126 */ unsigned char ARB_compressed_texture_pixel_storage;
        /*  127 */ unsigned char ARB_compute_shader;
        /*  128 */ unsigned char ARB_compute_variable_group_size;
        /*  129 */ unsigned char ARB_conditional_render_inverted;
        /*  130 */ unsigned char ARB_conservative_depth;
        /*  131 */ unsigned char ARB_copy_buffer;
        /*  132 */ unsigned char ARB_copy_image;
        /*  133 */ unsigned char ARB_cull_distance;
        /*  134 */ unsigned char ARB_debug_output;
        /*  135 */ unsigned char ARB_depth_buffer_float;
        /*  136 */ unsigned char ARB_depth_clamp;
        /*  137 */ unsigned char ARB_depth_texture;
        /*  138 */ unsigned char ARB_derivative_control;
        /*  139 */ unsigned char ARB_direct_state_access;
        /*  140 */ unsigned char ARB_draw_buffers;
        /*  141 */ unsigned char ARB_draw_buffers_blend;
        /*  142 */ unsigned char ARB_draw_elements_base_vertex;
        /*  143 */ unsigned char ARB_draw_indirect;
        /*  144 */ unsigned char ARB_draw_instanced;
        /*  145 */ unsigned char ARB_enhanced_layouts;
        /*  146 */ unsigned char ARB_explicit_attrib_location;
        /*  147 */ unsigned char ARB_explicit_uniform_location;
        /*  148 */ unsigned char ARB_fragment_coord_conventions;
        /*  149 */ unsigned char ARB_fragment_layer_viewport;
        /*  150 */ unsigned char ARB_fragment_program;
        /*  151 */ unsigned char ARB_fragment_program_shadow;
        /*  152 */ unsigned char ARB_fragment_shader;
        /*  153 */ unsigned char ARB_fragment_shader_interlock;
        /*  154 */ unsigned char ARB_framebuffer_no_attachments;
        /*  155 */ unsigned char ARB_framebuffer_object;
        /*  156 */ unsigned char ARB_framebuffer_sRGB;
        /*  157 */ unsigned char ARB_geometry_shader4;
        /*  158 */ unsigned char ARB_get_program_binary;
        /*  159 */ unsigned char ARB_get_texture_sub_image;
        /*  160 */ unsigned char ARB_gl_spirv;
        /*  161 */ unsigned char ARB_gpu_shader5;
        /*  162 */ unsigned char ARB_gpu_shader_fp64;
        /*  163 */ unsigned char ARB_gpu_shader_int64;
        /*  164 */ unsigned char ARB_half_float_pixel;
        /*  165 */ unsigned char ARB_half_float_vertex;
        /*  166 */ unsigned char ARB_imaging;
        /*  167 */ unsigned char ARB_indirect_parameters;
        /*  168 */ unsigned char ARB_instanced_arrays;
        /*  169 */ unsigned char ARB_internalformat_query;
        /*  170 */ unsigned char ARB_internalformat_query2;
        /*  171 */ unsigned char ARB_invalidate_subdata;
        /*  172 */ unsigned char ARB_map_buffer_alignment;
        /*  173 */ unsigned char ARB_map_buffer_range;
        /*  174 */ unsigned char ARB_matrix_palette;
        /*  175 */ unsigned char ARB_multi_bind;
        /*  176 */ unsigned char ARB_multi_draw_indirect;
        /*  177 */ unsigned char ARB_multisample;
        /*  178 */ unsigned char ARB_multitexture;
        /*  179 */ unsigned char ARB_occlusion_query;
        /*  180 */ unsigned char ARB_occlusion_query2;
        /*  181 */ unsigned char ARB_parallel_shader_compile;
        /*  182 */ unsigned char ARB_pipeline_statistics_query;
        /*  183 */ unsigned char ARB_pixel_buffer_object;
        /*  184 */ unsigned char ARB_point_parameters;
        /*  185 */ unsigned char ARB_point_sprite;
        /*  186 */ unsigned char ARB_polygon_offset_clamp;
        /*  187 */ unsigned char ARB_post_depth_coverage;
        /*  188 */ unsigned char ARB_program_interface_query;
        /*  189 */ unsigned char ARB_provoking_vertex;
        /*  190 */ unsigned char ARB_query_buffer_object;
        /*  191 */ unsigned char ARB_robust_buffer_access_behavior;
        /*  192 */ unsigned char ARB_robustness;
        /*  193 */ unsigned char ARB_robustness_isolation;
        /*  194 */ unsigned char ARB_sample_locations;
        /*  195 */ unsigned char ARB_sample_shading;
        /*  196 */ unsigned char ARB_sampler_objects;
        /*  197 */ unsigned char ARB_seamless_cube_map;
        /*  198 */ unsigned char ARB_seamless_cubemap_per_texture;
        /*  199 */ unsigned char ARB_separate_shader_objects;
        /*  200 */ unsigned char ARB_shader_atomic_counter_ops;
        /*  201 */ unsigned char ARB_shader_atomic_counters;
        /*  202 */ unsigned char ARB_shader_ballot;
        /*  203 */ unsigned char ARB_shader_bit_encoding;
        /*  204 */ unsigned char ARB_shader_clock;
        /*  205 */ unsigned char ARB_shader_draw_parameters;
        /*  206 */ unsigned char ARB_shader_group_vote;
        /*  207 */ unsigned char ARB_shader_image_load_store;
        /*  208 */ unsigned char ARB_shader_image_size;
        /*  209 */ unsigned char ARB_shader_objects;
        /*  210 */ unsigned char ARB_shader_precision;
        /*  211 */ unsigned char ARB_shader_stencil_export;
        /*  212 */ unsigned char ARB_shader_storage_buffer_object;
        /*  213 */ unsigned char ARB_shader_subroutine;
        /*  214 */ unsigned char ARB_shader_texture_image_samples;
        /*  215 */ unsigned char ARB_shader_texture_lod;
        /*  216 */ unsigned char ARB_shader_viewport_layer_array;
        /*  217 */ unsigned char ARB_shading_language_100;
        /*  218 */ unsigned char ARB_shading_language_420pack;
        /*  219 */ unsigned char ARB_shading_language_include;
        /*  220 */ unsigned char ARB_shading_language_packing;
        /*  221 */ unsigned char ARB_shadow;
        /*  222 */ unsigned char ARB_shadow_ambient;
        /*  223 */ unsigned char ARB_sparse_buffer;
        /*  224 */ unsigned char ARB_sparse_texture;
        /*  225 */ unsigned char ARB_sparse_texture2;
        /*  226 */ unsigned char ARB_sparse_texture_clamp;
        /*  227 */ unsigned char ARB_spirv_extensions;
        /*  228 */ unsigned char ARB_stencil_texturing;
        /*  229 */ unsigned char ARB_sync;
        /*  230 */ unsigned char ARB_tessellation_shader;
        /*  231 */ unsigned char ARB_texture_barrier;
        /*  232 */ unsigned char ARB_texture_border_clamp;
        /*  233 */ unsigned char ARB_texture_buffer_object;
        /*  234 */ unsigned char ARB_texture_buffer_object_rgb32;
        /*  235 */ unsigned char ARB_texture_buffer_range;
        /*  236 */ unsigned char ARB_texture_compression;
        /*  237 */ unsigned char ARB_texture_compression_bptc;
        /*  238 */ unsigned char ARB_texture_compression_rgtc;
        /*  239 */ unsigned char ARB_texture_cube_map;
        /*  240 */ unsigned char ARB_texture_cube_map_array;
        /*  241 */ unsigned char ARB_texture_env_add;
        /*  242 */ unsigned char ARB_texture_env_combine;
        /*  243 */ unsigned char ARB_texture_env_crossbar;
        /*  244 */ unsigned char ARB_texture_env_dot3;
        /*  245 */ unsigned char ARB_texture_filter_anisotropic;
        /*  246 */ unsigned char ARB_texture_filter_minmax;
        /*  247 */ unsigned char ARB_texture_float;
        /*  248 */ unsigned char ARB_texture_gather;
        /*  249 */ unsigned char ARB_texture_mirror_clamp_to_edge;
        /*  250 */ unsigned char ARB_texture_mirrored_repeat;
        /*  251 */ unsigned char ARB_texture_multisample;
        /*  252 */ unsigned char ARB_texture_non_power_of_two;
        /*  253 */ unsigned char ARB_texture_query_levels;
        /*  254 */ unsigned char ARB_texture_query_lod;
        /*  255 */ unsigned char ARB_texture_rectangle;
        /*  256 */ unsigned char ARB_texture_rg;
        /*  257 */ unsigned char ARB_texture_rgb10_a2ui;
        /*  258 */ unsigned char ARB_texture_stencil8;
        /*  259 */ unsigned char ARB_texture_storage;
        /*  260 */ unsigned char ARB_texture_storage_multisample;
        /*  261 */ unsigned char ARB_texture_swizzle;
        /*  262 */ unsigned char ARB_texture_view;
        /*  263 */ unsigned char ARB_timer_query;
        /*  264 */ unsigned char ARB_transform_feedback2;
        /*  265 */ unsigned char ARB_transform_feedback3;
        /*  266 */ unsigned char ARB_transform_feedback_instanced;
        /*  267 */ unsigned char ARB_transform_feedback_overflow_query;
        /*  268 */ unsigned char ARB_transpose_matrix;
        /*  269 */ unsigned char ARB_uniform_buffer_object;
        /*  270 */ unsigned char ARB_vertex_array_bgra;
        /*  271 */ unsigned char ARB_vertex_array_object;
        /*  272 */ unsigned char ARB_vertex_attrib_64bit;
        /*  273 */ unsigned char ARB_vertex_attrib_binding;
        /*  274 */ unsigned char ARB_vertex_blend;
        /*  275 */ unsigned char ARB_vertex_buffer_object;
        /*  276 */ unsigned char ARB_vertex_program;
        /*  277 */ unsigned char ARB_vertex_shader;
        /*  278 */ unsigned char ARB_vertex_type_10f_11f_11f_rev;
        /*  279 */ unsigned char ARB_vertex_type_2_10_10_10_rev;
        /*  280 */ unsigned char ARB_viewport_array;
        /*  281 */ unsigned char ARB_window_pos;
        /*  282 */ unsigned char ARM_cooperative_matrix_layouts;
        /*  283 */ unsigned char ARM_mali_program_binary;
        /*  284 */ unsigned char ARM_mali_shader_binary;
        /*  285 */ unsigned char ARM_rgba8;
        /*  286 */ unsigned char ARM_shader_core_builtins;
        /*  287 */ unsigned char ARM_shader_core_properties;
        /*  288 */ unsigned char ARM_shader_framebuffer_fetch;
        /*  289 */ unsigned char ARM_shader_framebuffer_fetch_depth_stencil;
        /*  290 */ unsigned char ARM_texture_unnormalized_coordinates;
        /*  291 */ unsigned char ATI_draw_buffers;
        /*  292 */ unsigned char ATI_element_array;
        /*  293 */ unsigned char ATI_envmap_bumpmap;
        /*  294 */ unsigned char ATI_fragment_shader;
        /*  295 */ unsigned char ATI_map_object_buffer;
        /*  296 */ unsigned char ATI_meminfo;
        /*  297 */ unsigned char ATI_pixel_format_float;
        /*  298 */ unsigned char ATI_pn_triangles;
        /*  299 */ unsigned char ATI_separate_stencil;
        /*  300 */ unsigned char ATI_text_fragment_shader;
        /*  301 */ unsigned char ATI_texture_env_combine3;
        /*  302 */ unsigned char ATI_texture_float;
        /*  303 */ unsigned char ATI_texture_mirror_once;
        /*  304 */ unsigned char ATI_vertex_array_object;
        /*  305 */ unsigned char ATI_vertex_attrib_array_object;
        /*  306 */ unsigned char ATI_vertex_streams;
        /*  307 */ unsigned char CHROMIUM_bind_uniform_location;
        /*  308 */ unsigned char CHROMIUM_copy_compressed_texture;
        /*  309 */ unsigned char CHROMIUM_copy_texture;
        /*  310 */ unsigned char CHROMIUM_framebuffer_mixed_samples;
        /*  311 */ unsigned char CHROMIUM_lose_context;
        /*  312 */ unsigned char DMP_program_binary;
        /*  313 */ unsigned char DMP_shader_binary;
        /*  314 */ unsigned char EXT_422_pixels;
        /*  315 */ unsigned char EXT_EGL_image_array;
        /*  316 */ unsigned char EXT_EGL_image_storage;
        /*  317 */ unsigned char EXT_EGL_image_storage_compression;
        /*  318 */ unsigned char EXT_EGL_sync;
        /*  319 */ unsigned char EXT_YUV_target;
        /*  320 */ unsigned char EXT_abgr;
        /*  321 */ unsigned char EXT_base_instance;
        /*  322 */ unsigned char EXT_bfloat16;
        /*  323 */ unsigned char EXT_bgra;
        /*  324 */ unsigned char EXT_bindable_uniform;
        /*  325 */ unsigned char EXT_blend_color;
        /*  326 */ unsigned char EXT_blend_equation_separate;
        /*  327 */ unsigned char EXT_blend_func_extended;
        /*  328 */ unsigned char EXT_blend_func_separate;
        /*  329 */ unsigned char EXT_blend_logic_op;
        /*  330 */ unsigned char EXT_blend_minmax;
        /*  331 */ unsigned char EXT_blend_subtract;
        /*  332 */ unsigned char EXT_buffer_reference;
        /*  333 */ unsigned char EXT_buffer_reference2;
        /*  334 */ unsigned char EXT_buffer_reference_uvec2;
        /*  335 */ unsigned char EXT_buffer_storage;
        /*  336 */ unsigned char EXT_clear_texture;
        /*  337 */ unsigned char EXT_clip_control;
        /*  338 */ unsigned char EXT_clip_cull_distance;
        /*  339 */ unsigned char EXT_clip_volume_hint;
        /*  340 */ unsigned char EXT_cmyka;
        /*  341 */ unsigned char EXT_color_buffer_float;
        /*  342 */ unsigned char EXT_color_buffer_half_float;
        /*  343 */ unsigned char EXT_color_subtable;
        /*  344 */ unsigned char EXT_compiled_vertex_array;
        /*  345 */ unsigned char EXT_conservative_depth;
        /*  346 */ unsigned char EXT_control_flow_attributes;
        /*  347 */ unsigned char EXT_control_flow_attributes2;
        /*  348 */ unsigned char EXT_convolution;
        /*  349 */ unsigned char EXT_coordinate_frame;
        /*  350 */ unsigned char EXT_copy_image;
        /*  351 */ unsigned char EXT_copy_texture;
        /*  352 */ unsigned char EXT_cull_vertex;
        /*  353 */ unsigned char EXT_debug_label;
        /*  354 */ unsigned char EXT_debug_marker;
        /*  355 */ unsigned char EXT_debug_printf;
        /*  356 */ unsigned char EXT_demote_to_helper_invocation;
        /*  357 */ unsigned char EXT_depth_bounds_test;
        /*  358 */ unsigned char EXT_depth_clamp;
        /*  359 */ unsigned char EXT_device_group;
        /*  360 */ unsigned char EXT_direct_state_access;
        /*  361 */ unsigned char EXT_discard_framebuffer;
        /*  362 */ unsigned char EXT_disjoint_timer_query;
        /*  363 */ unsigned char EXT_draw_buffers;
        /*  364 */ unsigned char EXT_draw_buffers2;
        /*  365 */ unsigned char EXT_draw_buffers_indexed;
        /*  366 */ unsigned char EXT_draw_elements_base_vertex;
        /*  367 */ unsigned char EXT_draw_instanced;
        /*  368 */ unsigned char EXT_draw_range_elements;
        /*  369 */ unsigned char EXT_draw_transform_feedback;
        /*  370 */ unsigned char EXT_expect_assume;
        /*  371 */ unsigned char EXT_external_buffer;
        /*  372 */ unsigned char EXT_float8_e5m2_e4m3;
        /*  373 */ unsigned char EXT_float_blend;
        /*  374 */ unsigned char EXT_fog_coord;
        /*  375 */ unsigned char EXT_fragment_invocation_density;
        /*  376 */ unsigned char EXT_fragment_shader_barycentric;
        /*  377 */ unsigned char EXT_fragment_shading_rate;
        /*  378 */ unsigned char EXT_framebuffer_blit;
        /*  379 */ unsigned char EXT_framebuffer_blit_layers;
        /*  380 */ unsigned char EXT_framebuffer_multisample;
        /*  381 */ unsigned char EXT_framebuffer_multisample_blit_scaled;
        /*  382 */ unsigned char EXT_framebuffer_object;
        /*  383 */ unsigned char EXT_framebuffer_sRGB;
        /*  384 */ unsigned char EXT_geometry_point_size;
        /*  385 */ unsigned char EXT_geometry_shader;
        /*  386 */ unsigned char EXT_geometry_shader4;
        /*  387 */ unsigned char EXT_gpu_program_parameters;
        /*  388 */ unsigned char EXT_gpu_shader4;
        /*  389 */ unsigned char EXT_gpu_shader5;
        /*  390 */ unsigned char EXT_histogram;
        /*  391 */ unsigned char EXT_index_array_formats;
        /*  392 */ unsigned char EXT_index_func;
        /*  393 */ unsigned char EXT_index_material;
        /*  394 */ unsigned char EXT_index_texture;
        /*  395 */ unsigned char EXT_instanced_arrays;
        /*  396 */ unsigned char EXT_integer_dot_product;
        /*  397 */ unsigned char EXT_light_texture;
        /*  398 */ unsigned char EXT_map_buffer_range;
        /*  399 */ unsigned char EXT_maximal_reconvergence;
        /*  400 */ unsigned char EXT_memory_object;
        /*  401 */ unsigned char EXT_memory_object_fd;
        /*  402 */ unsigned char EXT_memory_object_win32;
        /*  403 */ unsigned char EXT_mesh_shader;
        /*  404 */ unsigned char EXT_misc_attribute;
        /*  405 */ unsigned char EXT_multi_draw_arrays;
        /*  406 */ unsigned char EXT_multi_draw_indirect;
        /*  407 */ unsigned char EXT_multisample;
        /*  408 */ unsigned char EXT_multisampled_compatibility;
        /*  409 */ unsigned char EXT_multisampled_render_to_texture;
        /*  410 */ unsigned char EXT_multisampled_render_to_texture2;
        /*  411 */ unsigned char EXT_multiview_draw_buffers;
        /*  412 */ unsigned char EXT_multiview_tessellation_geometry_shader;
        /*  413 */ unsigned char EXT_multiview_texture_multisample;
        /*  414 */ unsigned char EXT_multiview_timer_query;
        /*  415 */ unsigned char EXT_nontemporal_keyword;
        /*  416 */ unsigned char EXT_nonuniform_qualifier;
        /*  417 */ unsigned char EXT_null_initializer;
        /*  418 */ unsigned char EXT_occlusion_query_boolean;
        /*  419 */ unsigned char EXT_opacity_micromap;
        /*  420 */ unsigned char EXT_packed_depth_stencil;
        /*  421 */ unsigned char EXT_packed_float;
        /*  422 */ unsigned char EXT_packed_pixels;
        /*  423 */ unsigned char EXT_paletted_texture;
        /*  424 */ unsigned char EXT_pixel_buffer_object;
        /*  425 */ unsigned char EXT_pixel_transform;
        /*  426 */ unsigned char EXT_pixel_transform_color_table;
        /*  427 */ unsigned char EXT_point_parameters;
        /*  428 */ unsigned char EXT_polygon_offset;
        /*  429 */ unsigned char EXT_polygon_offset_clamp;
        /*  430 */ unsigned char EXT_post_depth_coverage;
        /*  431 */ unsigned char EXT_primitive_bounding_box;
        /*  432 */ unsigned char EXT_protected_textures;
        /*  433 */ unsigned char EXT_provoking_vertex;
        /*  434 */ unsigned char EXT_pvrtc_sRGB;
        /*  435 */ unsigned char EXT_raster_multisample;
        /*  436 */ unsigned char EXT_ray_cull_mask;
        /*  437 */ unsigned char EXT_ray_flags_primitive_culling;
        /*  438 */ unsigned char EXT_ray_query;
        /*  439 */ unsigned char EXT_ray_tracing;
        /*  440 */ unsigned char EXT_ray_tracing_position_fetch;
        /*  441 */ unsigned char EXT_read_format_bgra;
        /*  442 */ unsigned char EXT_render_snorm;
        /*  443 */ unsigned char EXT_rescale_normal;
        /*  444 */ unsigned char EXT_robustness;
        /*  445 */ unsigned char EXT_sRGB;
        /*  446 */ unsigned char EXT_sRGB_write_control;
        /*  447 */ unsigned char EXT_samplerless_texture_functions;
        /*  448 */ unsigned char EXT_scalar_block_layout;
        /*  449 */ unsigned char EXT_secondary_color;
        /*  450 */ unsigned char EXT_semaphore;
        /*  451 */ unsigned char EXT_semaphore_fd;
        /*  452 */ unsigned char EXT_semaphore_win32;
        /*  453 */ unsigned char EXT_separate_depth_stencil;
        /*  454 */ unsigned char EXT_separate_shader_objects;
        /*  455 */ unsigned char EXT_separate_specular_color;
        /*  456 */ unsigned char EXT_shader_16bit_storage;
        /*  457 */ unsigned char EXT_shader_8bit_storage;
        /*  458 */ unsigned char EXT_shader_atomic_float;
        /*  459 */ unsigned char EXT_shader_atomic_float2;
        /*  460 */ unsigned char EXT_shader_atomic_int64;
        /*  461 */ unsigned char EXT_shader_explicit_arithmetic_types;
        /*  462 */ unsigned char EXT_shader_explicit_arithmetic_types_float16;
        /*  463 */ unsigned char EXT_shader_explicit_arithmetic_types_float32;
        /*  464 */ unsigned char EXT_shader_explicit_arithmetic_types_float64;
        /*  465 */ unsigned char EXT_shader_explicit_arithmetic_types_int16;
        /*  466 */ unsigned char EXT_shader_explicit_arithmetic_types_int32;
        /*  467 */ unsigned char EXT_shader_explicit_arithmetic_types_int64;
        /*  468 */ unsigned char EXT_shader_explicit_arithmetic_types_int8;
        /*  469 */ unsigned char EXT_shader_framebuffer_fetch;
        /*  470 */ unsigned char EXT_shader_framebuffer_fetch_non_coherent;
        /*  471 */ unsigned char EXT_shader_group_vote;
        /*  472 */ unsigned char EXT_shader_image_int64;
        /*  473 */ unsigned char EXT_shader_image_load_formatted;
        /*  474 */ unsigned char EXT_shader_image_load_store;
        /*  475 */ unsigned char EXT_shader_implicit_conversions;
        /*  476 */ unsigned char EXT_shader_integer_mix;
        /*  477 */ unsigned char EXT_shader_io_blocks;
        /*  478 */ unsigned char EXT_shader_non_constant_global_initializers;
        /*  479 */ unsigned char EXT_shader_pixel_local_storage;
        /*  480 */ unsigned char EXT_shader_pixel_local_storage2;
        /*  481 */ unsigned char EXT_shader_quad_control;
        /*  482 */ unsigned char EXT_shader_realtime_clock;
        /*  483 */ unsigned char EXT_shader_samples_identical;
        /*  484 */ unsigned char EXT_shader_subgroup_extended_types;
        /*  485 */ unsigned char EXT_shader_subgroup_extended_types_float16;
        /*  486 */ unsigned char EXT_shader_subgroup_extended_types_int16;
        /*  487 */ unsigned char EXT_shader_subgroup_extended_types_int64;
        /*  488 */ unsigned char EXT_shader_subgroup_extended_types_int8;
        /*  489 */ unsigned char EXT_shader_texture_lod;
        /*  490 */ unsigned char EXT_shader_texture_samples;
        /*  491 */ unsigned char EXT_shader_tile_image;
        /*  492 */ unsigned char EXT_shadow_funcs;
        /*  493 */ unsigned char EXT_shadow_samplers;
        /*  494 */ unsigned char EXT_shared_memory_block;
        /*  495 */ unsigned char EXT_shared_texture_palette;
        /*  496 */ unsigned char EXT_sparse_texture;
        /*  497 */ unsigned char EXT_sparse_texture2;
        /*  498 */ unsigned char EXT_spec_constant_composites;
        /*  499 */ unsigned char EXT_spirv_intrinsics;
        /*  500 */ unsigned char EXT_stencil_clear_tag;
        /*  501 */ unsigned char EXT_stencil_two_side;
        /*  502 */ unsigned char EXT_stencil_wrap;
        /*  503 */ unsigned char EXT_subgroup_uniform_control_flow;
        /*  504 */ unsigned char EXT_subgroupuniform_qualifier;
        /*  505 */ unsigned char EXT_subtexture;
        /*  506 */ unsigned char EXT_terminate_invocation;
        /*  507 */ unsigned char EXT_tessellation_point_size;
        /*  508 */ unsigned char EXT_tessellation_shader;
        /*  509 */ unsigned char EXT_texture;
        /*  510 */ unsigned char EXT_texture3D;
        /*  511 */ unsigned char EXT_texture_array;
        /*  512 */ unsigned char EXT_texture_border_clamp;
        /*  513 */ unsigned char EXT_texture_buffer;
        /*  514 */ unsigned char EXT_texture_buffer_object;
        /*  515 */ unsigned char EXT_texture_compression_astc_decode_mode;
        /*  516 */ unsigned char EXT_texture_compression_bptc;
        /*  517 */ unsigned char EXT_texture_compression_dxt1;
        /*  518 */ unsigned char EXT_texture_compression_latc;
        /*  519 */ unsigned char EXT_texture_compression_rgtc;
        /*  520 */ unsigned char EXT_texture_compression_s3tc;
        /*  521 */ unsigned char EXT_texture_compression_s3tc_srgb;
        /*  522 */ unsigned char EXT_texture_cube_map;
        /*  523 */ unsigned char EXT_texture_cube_map_array;
        /*  524 */ unsigned char EXT_texture_env_add;
        /*  525 */ unsigned char EXT_texture_env_combine;
        /*  526 */ unsigned char EXT_texture_env_dot3;
        /*  527 */ unsigned char EXT_texture_filter_anisotropic;
        /*  528 */ unsigned char EXT_texture_filter_minmax;
        /*  529 */ unsigned char EXT_texture_format_BGRA8888;
        /*  530 */ unsigned char EXT_texture_format_sRGB_override;
        /*  531 */ unsigned char EXT_texture_integer;
        /*  532 */ unsigned char EXT_texture_lod_bias;
        /*  533 */ unsigned char EXT_texture_mirror_clamp;
        /*  534 */ unsigned char EXT_texture_mirror_clamp_to_edge;
        /*  535 */ unsigned char EXT_texture_norm16;
        /*  536 */ unsigned char EXT_texture_object;
        /*  537 */ unsigned char EXT_texture_offset_non_const;
        /*  538 */ unsigned char EXT_texture_perturb_normal;
        /*  539 */ unsigned char EXT_texture_query_lod;
        /*  540 */ unsigned char EXT_texture_rg;
        /*  541 */ unsigned char EXT_texture_sRGB;
        /*  542 */ unsigned char EXT_texture_sRGB_R8;
        /*  543 */ unsigned char EXT_texture_sRGB_RG8;
        /*  544 */ unsigned char EXT_texture_sRGB_decode;
        /*  545 */ unsigned char EXT_texture_shadow_lod;
        /*  546 */ unsigned char EXT_texture_shared_exponent;
        /*  547 */ unsigned char EXT_texture_snorm;
        /*  548 */ unsigned char EXT_texture_storage;
        /*  549 */ unsigned char EXT_texture_storage_compression;
        /*  550 */ unsigned char EXT_texture_swizzle;
        /*  551 */ unsigned char EXT_texture_type_2_10_10_10_REV;
        /*  552 */ unsigned char EXT_texture_view;
        /*  553 */ unsigned char EXT_timer_query;
        /*  554 */ unsigned char EXT_transform_feedback;
        /*  555 */ unsigned char EXT_unpack_subimage;
        /*  556 */ unsigned char EXT_vertex_array;
        /*  557 */ unsigned char EXT_vertex_array_bgra;
        /*  558 */ unsigned char EXT_vertex_attrib_64bit;
        /*  559 */ unsigned char EXT_vertex_shader;
        /*  560 */ unsigned char EXT_vertex_weighting;
        /*  561 */ unsigned char EXT_vulkan_glsl_relaxed;
        /*  562 */ unsigned char EXT_win32_keyed_mutex;
        /*  563 */ unsigned char EXT_window_rectangles;
        /*  564 */ unsigned char EXT_x11_sync_object;
        /*  565 */ unsigned char FJ_shader_binary_GCCSO;
        /*  566 */ unsigned char GREMEDY_frame_terminator;
        /*  567 */ unsigned char GREMEDY_string_marker;
        /*  568 */ unsigned char HP_convolution_border_modes;
        /*  569 */ unsigned char HP_image_transform;
        /*  570 */ unsigned char HP_occlusion_test;
        /*  571 */ unsigned char HP_texture_lighting;
        /*  572 */ unsigned char HUAWEI_cluster_culling_shader;
        /*  573 */ unsigned char HUAWEI_program_binary;
        /*  574 */ unsigned char HUAWEI_shader_binary;
        /*  575 */ unsigned char HUAWEI_subpass_shading;
        /*  576 */ unsigned char IBM_cull_vertex;
        /*  577 */ unsigned char IBM_multimode_draw_arrays;
        /*  578 */ unsigned char IBM_rasterpos_clip;
        /*  579 */ unsigned char IBM_static_data;
        /*  580 */ unsigned char IBM_texture_mirrored_repeat;
        /*  581 */ unsigned char IBM_vertex_array_lists;
        /*  582 */ unsigned char IMG_bindless_texture;
        /*  583 */ unsigned char IMG_framebuffer_downsample;
        /*  584 */ unsigned char IMG_multisampled_render_to_texture;
        /*  585 */ unsigned char IMG_program_binary;
        /*  586 */ unsigned char IMG_read_format;
        /*  587 */ unsigned char IMG_shader_binary;
        /*  588 */ unsigned char IMG_texture_compression_pvrtc;
        /*  589 */ unsigned char IMG_texture_compression_pvrtc2;
        /*  590 */ unsigned char IMG_texture_filter_cubic;
        /*  591 */ unsigned char INGR_blend_func_separate;
        /*  592 */ unsigned char INGR_color_clamp;
        /*  593 */ unsigned char INGR_interlace_read;
        /*  594 */ unsigned char INTEL_blackhole_render;
        /*  595 */ unsigned char INTEL_conservative_rasterization;
        /*  596 */ unsigned char INTEL_fragment_shader_ordering;
        /*  597 */ unsigned char INTEL_framebuffer_CMAA;
        /*  598 */ unsigned char INTEL_map_texture;
        /*  599 */ unsigned char INTEL_parallel_arrays;
        /*  600 */ unsigned char INTEL_performance_query;
        /*  601 */ unsigned char KHR_blend_equation_advanced;
        /*  602 */ unsigned char KHR_blend_equation_advanced_coherent;
        /*  603 */ unsigned char KHR_context_flush_control;
        /*  604 */ unsigned char KHR_cooperative_matrix;
        /*  605 */ unsigned char KHR_debug;
        /*  606 */ unsigned char KHR_memory_scope_semantics;
        /*  607 */ unsigned char KHR_no_error;
        /*  608 */ unsigned char KHR_parallel_shader_compile;
        /*  609 */ unsigned char KHR_robust_buffer_access_behavior;
        /*  610 */ unsigned char KHR_robustness;
        /*  611 */ unsigned char KHR_shader_subgroup;
        /*  612 */ unsigned char KHR_shader_subgroup_arithmetic;
        /*  613 */ unsigned char KHR_shader_subgroup_ballot;
        /*  614 */ unsigned char KHR_shader_subgroup_basic;
        /*  615 */ unsigned char KHR_shader_subgroup_clustered;
        /*  616 */ unsigned char KHR_shader_subgroup_quad;
        /*  617 */ unsigned char KHR_shader_subgroup_rotate;
        /*  618 */ unsigned char KHR_shader_subgroup_shuffle;
        /*  619 */ unsigned char KHR_shader_subgroup_shuffle_relative;
        /*  620 */ unsigned char KHR_shader_subgroup_vote;
        /*  621 */ unsigned char KHR_texture_compression_astc_hdr;
        /*  622 */ unsigned char KHR_texture_compression_astc_ldr;
        /*  623 */ unsigned char KHR_texture_compression_astc_sliced_3d;
        /*  624 */ unsigned char KHR_vulkan_glsl;
        /*  625 */ unsigned char MESAX_texture_stack;
        /*  626 */ unsigned char MESA_bgra;
        /*  627 */ unsigned char MESA_framebuffer_flip_x;
        /*  628 */ unsigned char MESA_framebuffer_flip_y;
        /*  629 */ unsigned char MESA_framebuffer_swap_xy;
        /*  630 */ unsigned char MESA_map_buffer_client_pointer;
        /*  631 */ unsigned char MESA_pack_invert;
        /*  632 */ unsigned char MESA_program_binary_formats;
        /*  633 */ unsigned char MESA_resize_buffers;
        /*  634 */ unsigned char MESA_sampler_objects;
        /*  635 */ unsigned char MESA_shader_integer_functions;
        /*  636 */ unsigned char MESA_texture_const_bandwidth;
        /*  637 */ unsigned char MESA_tile_raster_order;
        /*  638 */ unsigned char MESA_window_pos;
        /*  639 */ unsigned char MESA_ycbcr_texture;
        /*  640 */ unsigned char NVX_blend_equation_advanced_multi_draw_buffers;
        /*  641 */ unsigned char NVX_conditional_render;
        /*  642 */ unsigned char NVX_gpu_memory_info;
        /*  643 */ unsigned char NVX_gpu_multicast2;
        /*  644 */ unsigned char NVX_linked_gpu_multicast;
        /*  645 */ unsigned char NVX_multiview_per_view_attributes;
        /*  646 */ unsigned char NVX_progress_fence;
        /*  647 */ unsigned char NV_alpha_to_coverage_dither_control;
        /*  648 */ unsigned char NV_bindless_multi_draw_indirect;
        /*  649 */ unsigned char NV_bindless_multi_draw_indirect_count;
        /*  650 */ unsigned char NV_bindless_texture;
        /*  651 */ unsigned char NV_blend_equation_advanced;
        /*  652 */ unsigned char NV_blend_equation_advanced_coherent;
        /*  653 */ unsigned char NV_blend_minmax_factor;
        /*  654 */ unsigned char NV_blend_square;
        /*  655 */ unsigned char NV_clip_space_w_scaling;
        /*  656 */ unsigned char NV_cluster_acceleration_structure;
        /*  657 */ unsigned char NV_command_list;
        /*  658 */ unsigned char NV_compute_program5;
        /*  659 */ unsigned char NV_compute_shader_derivatives;
        /*  660 */ unsigned char NV_conditional_render;
        /*  661 */ unsigned char NV_conservative_raster;
        /*  662 */ unsigned char NV_conservative_raster_dilate;
        /*  663 */ unsigned char NV_conservative_raster_pre_snap;
        /*  664 */ unsigned char NV_conservative_raster_pre_snap_triangles;
        /*  665 */ unsigned char NV_conservative_raster_underestimation;
        /*  666 */ unsigned char NV_cooperative_matrix;
        /*  667 */ unsigned char NV_cooperative_matrix2;
        /*  668 */ unsigned char NV_cooperative_vector;
        /*  669 */ unsigned char NV_copy_buffer;
        /*  670 */ unsigned char NV_copy_depth_to_color;
        /*  671 */ unsigned char NV_copy_image;
        /*  672 */ unsigned char NV_coverage_sample;
        /*  673 */ unsigned char NV_deep_texture3D;
        /*  674 */ unsigned char NV_depth_buffer_float;
        /*  675 */ unsigned char NV_depth_clamp;
        /*  676 */ unsigned char NV_depth_nonlinear;
        /*  677 */ unsigned char NV_displacement_micromap;
        /*  678 */ unsigned char NV_draw_buffers;
        /*  679 */ unsigned char NV_draw_instanced;
        /*  680 */ unsigned char NV_draw_texture;
        /*  681 */ unsigned char NV_draw_vulkan_image;
        /*  682 */ unsigned char NV_evaluators;
        /*  683 */ unsigned char NV_explicit_attrib_location;
        /*  684 */ unsigned char NV_explicit_multisample;
        /*  685 */ unsigned char NV_fbo_color_attachments;
        /*  686 */ unsigned char NV_fence;
        /*  687 */ unsigned char NV_fill_rectangle;
        /*  688 */ unsigned char NV_float_buffer;
        /*  689 */ unsigned char NV_fog_distance;
        /*  690 */ unsigned char NV_fragment_coverage_to_color;
        /*  691 */ unsigned char NV_fragment_program;
        /*  692 */ unsigned char NV_fragment_program2;
        /*  693 */ unsigned char NV_fragment_program4;
        /*  694 */ unsigned char NV_fragment_program_option;
        /*  695 */ unsigned char NV_fragment_shader_barycentric;
        /*  696 */ unsigned char NV_fragment_shader_interlock;
        /*  697 */ unsigned char NV_framebuffer_blit;
        /*  698 */ unsigned char NV_framebuffer_mixed_samples;
        /*  699 */ unsigned char NV_framebuffer_multisample;
        /*  700 */ unsigned char NV_framebuffer_multisample_coverage;
        /*  701 */ unsigned char NV_generate_mipmap_sRGB;
        /*  702 */ unsigned char NV_geometry_program4;
        /*  703 */ unsigned char NV_geometry_shader4;
        /*  704 */ unsigned char NV_geometry_shader_passthrough;
        /*  705 */ unsigned char NV_gpu_multicast;
        /*  706 */ unsigned char NV_gpu_program4;
        /*  707 */ unsigned char NV_gpu_program5;
        /*  708 */ unsigned char NV_gpu_program5_mem_extended;
        /*  709 */ unsigned char NV_gpu_shader5;
        /*  710 */ unsigned char NV_half_float;
        /*  711 */ unsigned char NV_image_formats;
        /*  712 */ unsigned char NV_instanced_arrays;
        /*  713 */ unsigned char NV_integer_cooperative_matrix;
        /*  714 */ unsigned char NV_internalformat_sample_query;
        /*  715 */ unsigned char NV_light_max_exponent;
        /*  716 */ unsigned char NV_linear_swept_spheres;
        /*  717 */ unsigned char NV_memory_attachment;
        /*  718 */ unsigned char NV_memory_object_sparse;
        /*  719 */ unsigned char NV_mesh_shader;
        /*  720 */ unsigned char NV_multisample_coverage;
        /*  721 */ unsigned char NV_multisample_filter_hint;
        /*  722 */ unsigned char NV_non_square_matrices;
        /*  723 */ unsigned char NV_occlusion_query;
        /*  724 */ unsigned char NV_pack_subimage;
        /*  725 */ unsigned char NV_packed_depth_stencil;
        /*  726 */ unsigned char NV_parameter_buffer_object;
        /*  727 */ unsigned char NV_parameter_buffer_object2;
        /*  728 */ unsigned char NV_path_rendering;
        /*  729 */ unsigned char NV_path_rendering_shared_edge;
        /*  730 */ unsigned char NV_pixel_buffer_object;
        /*  731 */ unsigned char NV_pixel_data_range;
        /*  732 */ unsigned char NV_point_sprite;
        /*  733 */ unsigned char NV_polygon_mode;
        /*  734 */ unsigned char NV_present_video;
        /*  735 */ unsigned char NV_primitive_restart;
        /*  736 */ unsigned char NV_primitive_shading_rate;
        /*  737 */ unsigned char NV_query_resource;
        /*  738 */ unsigned char NV_query_resource_tag;
        /*  739 */ unsigned char NV_ray_tracing;
        /*  740 */ unsigned char NV_ray_tracing_motion_blur;
        /*  741 */ unsigned char NV_read_buffer;
        /*  742 */ unsigned char NV_read_buffer_front;
        /*  743 */ unsigned char NV_read_depth;
        /*  744 */ unsigned char NV_read_depth_stencil;
        /*  745 */ unsigned char NV_read_stencil;
        /*  746 */ unsigned char NV_register_combiners;
        /*  747 */ unsigned char NV_register_combiners2;
        /*  748 */ unsigned char NV_representative_fragment_test;
        /*  749 */ unsigned char NV_robustness_video_memory_purge;
        /*  750 */ unsigned char NV_sRGB_formats;
        /*  751 */ unsigned char NV_sample_locations;
        /*  752 */ unsigned char NV_sample_mask_override_coverage;
        /*  753 */ unsigned char NV_scissor_exclusive;
        /*  754 */ unsigned char NV_shader_atomic_counters;
        /*  755 */ unsigned char NV_shader_atomic_float;
        /*  756 */ unsigned char NV_shader_atomic_float64;
        /*  757 */ unsigned char NV_shader_atomic_fp16_vector;
        /*  758 */ unsigned char NV_shader_atomic_int64;
        /*  759 */ unsigned char NV_shader_buffer_load;
        /*  760 */ unsigned char NV_shader_buffer_store;
        /*  761 */ unsigned char NV_shader_invocation_reorder;
        /*  762 */ unsigned char NV_shader_noperspective_interpolation;
        /*  763 */ unsigned char NV_shader_sm_builtins;
        /*  764 */ unsigned char NV_shader_storage_buffer_object;
        /*  765 */ unsigned char NV_shader_subgroup_partitioned;
        /*  766 */ unsigned char NV_shader_texture_footprint;
        /*  767 */ unsigned char NV_shader_thread_group;
        /*  768 */ unsigned char NV_shader_thread_shuffle;
        /*  769 */ unsigned char NV_shading_rate_image;
        /*  770 */ unsigned char NV_shadow_samplers_array;
        /*  771 */ unsigned char NV_shadow_samplers_cube;
        /*  772 */ unsigned char NV_stereo_view_rendering;
        /*  773 */ unsigned char NV_tessellation_program5;
        /*  774 */ unsigned char NV_texgen_emboss;
        /*  775 */ unsigned char NV_texgen_reflection;
        /*  776 */ unsigned char NV_texture_barrier;
        /*  777 */ unsigned char NV_texture_border_clamp;
        /*  778 */ unsigned char NV_texture_compression_s3tc_update;
        /*  779 */ unsigned char NV_texture_compression_vtc;
        /*  780 */ unsigned char NV_texture_env_combine4;
        /*  781 */ unsigned char NV_texture_expand_normal;
        /*  782 */ unsigned char NV_texture_multisample;
        /*  783 */ unsigned char NV_texture_npot_2D_mipmap;
        /*  784 */ unsigned char NV_texture_rectangle;
        /*  785 */ unsigned char NV_texture_rectangle_compressed;
        /*  786 */ unsigned char NV_texture_shader;
        /*  787 */ unsigned char NV_texture_shader2;
        /*  788 */ unsigned char NV_texture_shader3;
        /*  789 */ unsigned char NV_timeline_semaphore;
        /*  790 */ unsigned char NV_transform_feedback;
        /*  791 */ unsigned char NV_transform_feedback2;
        /*  792 */ unsigned char NV_uniform_buffer_std430_layout;
        /*  793 */ unsigned char NV_uniform_buffer_unified_memory;
        /*  794 */ unsigned char NV_vdpau_interop;
        /*  795 */ unsigned char NV_vdpau_interop2;
        /*  796 */ unsigned char NV_vertex_array_range;
        /*  797 */ unsigned char NV_vertex_array_range2;
        /*  798 */ unsigned char NV_vertex_attrib_integer_64bit;
        /*  799 */ unsigned char NV_vertex_buffer_unified_memory;
        /*  800 */ unsigned char NV_vertex_program;
        /*  801 */ unsigned char NV_vertex_program1_1;
        /*  802 */ unsigned char NV_vertex_program2;
        /*  803 */ unsigned char NV_vertex_program2_option;
        /*  804 */ unsigned char NV_vertex_program3;
        /*  805 */ unsigned char NV_vertex_program4;
        /*  806 */ unsigned char NV_video_capture;
        /*  807 */ unsigned char NV_viewport_array;
        /*  808 */ unsigned char NV_viewport_array2;
        /*  809 */ unsigned char NV_viewport_swizzle;
        /*  810 */ unsigned char OES_EGL_image;
        /*  811 */ unsigned char OES_EGL_image_external;
        /*  812 */ unsigned char OES_EGL_image_external_essl3;
        /*  813 */ unsigned char OES_byte_coordinates;
        /*  814 */ unsigned char OES_compressed_ETC1_RGB8_sub_texture;
        /*  815 */ unsigned char OES_compressed_ETC1_RGB8_texture;
        /*  816 */ unsigned char OES_compressed_paletted_texture;
        /*  817 */ unsigned char OES_copy_image;
        /*  818 */ unsigned char OES_depth24;
        /*  819 */ unsigned char OES_depth32;
        /*  820 */ unsigned char OES_depth_texture;
        /*  821 */ unsigned char OES_draw_buffers_indexed;
        /*  822 */ unsigned char OES_draw_elements_base_vertex;
        /*  823 */ unsigned char OES_element_index_uint;
        /*  824 */ unsigned char OES_fbo_render_mipmap;
        /*  825 */ unsigned char OES_fixed_point;
        /*  826 */ unsigned char OES_fragment_precision_high;
        /*  827 */ unsigned char OES_geometry_point_size;
        /*  828 */ unsigned char OES_geometry_shader;
        /*  829 */ unsigned char OES_get_program_binary;
        /*  830 */ unsigned char OES_gpu_shader5;
        /*  831 */ unsigned char OES_mapbuffer;
        /*  832 */ unsigned char OES_packed_depth_stencil;
        /*  833 */ unsigned char OES_primitive_bounding_box;
        /*  834 */ unsigned char OES_query_matrix;
        /*  835 */ unsigned char OES_read_format;
        /*  836 */ unsigned char OES_required_internalformat;
        /*  837 */ unsigned char OES_rgb8_rgba8;
        /*  838 */ unsigned char OES_sample_shading;
        /*  839 */ unsigned char OES_sample_variables;
        /*  840 */ unsigned char OES_shader_image_atomic;
        /*  841 */ unsigned char OES_shader_io_blocks;
        /*  842 */ unsigned char OES_shader_multisample_interpolation;
        /*  843 */ unsigned char OES_single_precision;
        /*  844 */ unsigned char OES_standard_derivatives;
        /*  845 */ unsigned char OES_stencil1;
        /*  846 */ unsigned char OES_stencil4;
        /*  847 */ unsigned char OES_surfaceless_context;
        /*  848 */ unsigned char OES_tessellation_point_size;
        /*  849 */ unsigned char OES_tessellation_shader;
        /*  850 */ unsigned char OES_texture_3D;
        /*  851 */ unsigned char OES_texture_border_clamp;
        /*  852 */ unsigned char OES_texture_buffer;
        /*  853 */ unsigned char OES_texture_compression_astc;
        /*  854 */ unsigned char OES_texture_cube_map_array;
        /*  855 */ unsigned char OES_texture_float;
        /*  856 */ unsigned char OES_texture_float_linear;
        /*  857 */ unsigned char OES_texture_half_float;
        /*  858 */ unsigned char OES_texture_half_float_linear;
        /*  859 */ unsigned char OES_texture_npot;
        /*  860 */ unsigned char OES_texture_stencil8;
        /*  861 */ unsigned char OES_texture_storage_multisample_2d_array;
        /*  862 */ unsigned char OES_texture_view;
        /*  863 */ unsigned char OES_vertex_array_object;
        /*  864 */ unsigned char OES_vertex_half_float;
        /*  865 */ unsigned char OES_vertex_type_10_10_10_2;
        /*  866 */ unsigned char OES_viewport_array;
        /*  867 */ unsigned char OML_interlace;
        /*  868 */ unsigned char OML_resample;
        /*  869 */ unsigned char OML_subsample;
        /*  870 */ unsigned char OVR_multiview;
        /*  871 */ unsigned char OVR_multiview2;
        /*  872 */ unsigned char OVR_multiview_multisampled_render_to_texture;
        /*  873 */ unsigned char PGI_misc_hints;
        /*  874 */ unsigned char PGI_vertex_hints;
        /*  875 */ unsigned char QCOM_YUV_texture_gather;
        /*  876 */ unsigned char QCOM_alpha_test;
        /*  877 */ unsigned char QCOM_binning_control;
        /*  878 */ unsigned char QCOM_cooperative_matrix_conversion;
        /*  879 */ unsigned char QCOM_driver_control;
        /*  880 */ unsigned char QCOM_extended_get;
        /*  881 */ unsigned char QCOM_extended_get2;
        /*  882 */ unsigned char QCOM_frame_extrapolation;
        /*  883 */ unsigned char QCOM_framebuffer_foveated;
        /*  884 */ unsigned char QCOM_image_processing;
        /*  885 */ unsigned char QCOM_image_processing2;
        /*  886 */ unsigned char QCOM_motion_estimation;
        /*  887 */ unsigned char QCOM_perfmon_global_mode;
        /*  888 */ unsigned char QCOM_render_sRGB_R8_RG8;
        /*  889 */ unsigned char QCOM_render_shared_exponent;
        /*  890 */ unsigned char QCOM_shader_framebuffer_fetch_noncoherent;
        /*  891 */ unsigned char QCOM_shader_framebuffer_fetch_rate;
        /*  892 */ unsigned char QCOM_shading_rate;
        /*  893 */ unsigned char QCOM_texture_foveated;
        /*  894 */ unsigned char QCOM_texture_foveated2;
        /*  895 */ unsigned char QCOM_texture_foveated_subsampled_layout;
        /*  896 */ unsigned char QCOM_texture_lod_bias;
        /*  897 */ unsigned char QCOM_tile_shading;
        /*  898 */ unsigned char QCOM_tiled_rendering;
        /*  899 */ unsigned char QCOM_writeonly_rendering;
        /*  900 */ unsigned char QCOM_ycbcr_degamma;
        /*  901 */ unsigned char REND_screen_coordinates;
        /*  902 */ unsigned char S3_s3tc;
        /*  903 */ unsigned char SGIS_detail_texture;
        /*  904 */ unsigned char SGIS_fog_function;
        /*  905 */ unsigned char SGIS_generate_mipmap;
        /*  906 */ unsigned char SGIS_multisample;
        /*  907 */ unsigned char SGIS_pixel_texture;
        /*  908 */ unsigned char SGIS_point_line_texgen;
        /*  909 */ unsigned char SGIS_point_parameters;
        /*  910 */ unsigned char SGIS_sharpen_texture;
        /*  911 */ unsigned char SGIS_texture4D;
        /*  912 */ unsigned char SGIS_texture_border_clamp;
        /*  913 */ unsigned char SGIS_texture_color_mask;
        /*  914 */ unsigned char SGIS_texture_edge_clamp;
        /*  915 */ unsigned char SGIS_texture_filter4;
        /*  916 */ unsigned char SGIS_texture_lod;
        /*  917 */ unsigned char SGIS_texture_select;
        /*  918 */ unsigned char SGIX_async;
        /*  919 */ unsigned char SGIX_async_histogram;
        /*  920 */ unsigned char SGIX_async_pixel;
        /*  921 */ unsigned char SGIX_blend_alpha_minmax;
        /*  922 */ unsigned char SGIX_calligraphic_fragment;
        /*  923 */ unsigned char SGIX_clipmap;
        /*  924 */ unsigned char SGIX_convolution_accuracy;
        /*  925 */ unsigned char SGIX_depth_pass_instrument;
        /*  926 */ unsigned char SGIX_depth_texture;
        /*  927 */ unsigned char SGIX_flush_raster;
        /*  928 */ unsigned char SGIX_fog_offset;
        /*  929 */ unsigned char SGIX_fragment_lighting;
        /*  930 */ unsigned char SGIX_framezoom;
        /*  931 */ unsigned char SGIX_igloo_interface;
        /*  932 */ unsigned char SGIX_instruments;
        /*  933 */ unsigned char SGIX_interlace;
        /*  934 */ unsigned char SGIX_ir_instrument1;
        /*  935 */ unsigned char SGIX_list_priority;
        /*  936 */ unsigned char SGIX_pixel_texture;
        /*  937 */ unsigned char SGIX_pixel_tiles;
        /*  938 */ unsigned char SGIX_polynomial_ffd;
        /*  939 */ unsigned char SGIX_reference_plane;
        /*  940 */ unsigned char SGIX_resample;
        /*  941 */ unsigned char SGIX_scalebias_hint;
        /*  942 */ unsigned char SGIX_shadow;
        /*  943 */ unsigned char SGIX_shadow_ambient;
        /*  944 */ unsigned char SGIX_sprite;
        /*  945 */ unsigned char SGIX_subsample;
        /*  946 */ unsigned char SGIX_tag_sample_buffer;
        /*  947 */ unsigned char SGIX_texture_add_env;
        /*  948 */ unsigned char SGIX_texture_coordinate_clamp;
        /*  949 */ unsigned char SGIX_texture_lod_bias;
        /*  950 */ unsigned char SGIX_texture_multi_buffer;
        /*  951 */ unsigned char SGIX_texture_scale_bias;
        /*  952 */ unsigned char SGIX_vertex_preclip;
        /*  953 */ unsigned char SGIX_ycrcb;
        /*  954 */ unsigned char SGIX_ycrcb_subsample;
        /*  955 */ unsigned char SGIX_ycrcba;
        /*  956 */ unsigned char SGI_color_matrix;
        /*  957 */ unsigned char SGI_color_table;
        /*  958 */ unsigned char SGI_texture_color_table;
        /*  959 */ unsigned char SUNX_constant_data;
        /*  960 */ unsigned char SUN_convolution_border_modes;
        /*  961 */ unsigned char SUN_global_alpha;
        /*  962 */ unsigned char SUN_mesh_array;
        /*  963 */ unsigned char SUN_slice_accum;
        /*  964 */ unsigned char SUN_triangle_list;
        /*  965 */ unsigned char SUN_vertex;
        /*  966 */ unsigned char VIV_shader_binary;
        /*  967 */ unsigned char WIN_phong_shading;
        /*  968 */ unsigned char WIN_specular_fog;
        };
    };

    union {
        void *pfnArray[2955];
        struct {
        /*    0 */ PFNGLCULLFACEPROC CullFace;
        /*    1 */ PFNGLFRONTFACEPROC FrontFace;
        /*    2 */ PFNGLHINTPROC Hint;
        /*    3 */ PFNGLLINEWIDTHPROC LineWidth;
        /*    4 */ PFNGLPOINTSIZEPROC PointSize;
        /*    5 */ PFNGLPOLYGONMODEPROC PolygonMode;
        /*    6 */ PFNGLSCISSORPROC Scissor;
        /*    7 */ PFNGLTEXPARAMETERFPROC TexParameterf;
        /*    8 */ PFNGLTEXPARAMETERFVPROC TexParameterfv;
        /*    9 */ PFNGLTEXPARAMETERIPROC TexParameteri;
        /*   10 */ PFNGLTEXPARAMETERIVPROC TexParameteriv;
        /*   11 */ PFNGLTEXIMAGE1DPROC TexImage1D;
        /*   12 */ PFNGLTEXIMAGE2DPROC TexImage2D;
        /*   13 */ PFNGLDRAWBUFFERPROC DrawBuffer;
        /*   14 */ PFNGLCLEARPROC Clear;
        /*   15 */ PFNGLCLEARCOLORPROC ClearColor;
        /*   16 */ PFNGLCLEARSTENCILPROC ClearStencil;
        /*   17 */ PFNGLCLEARDEPTHPROC ClearDepth;
        /*   18 */ PFNGLSTENCILMASKPROC StencilMask;
        /*   19 */ PFNGLCOLORMASKPROC ColorMask;
        /*   20 */ PFNGLDEPTHMASKPROC DepthMask;
        /*   21 */ PFNGLDISABLEPROC Disable;
        /*   22 */ PFNGLENABLEPROC Enable;
        /*   23 */ PFNGLFINISHPROC Finish;
        /*   24 */ PFNGLFLUSHPROC Flush;
        /*   25 */ PFNGLBLENDFUNCPROC BlendFunc;
        /*   26 */ PFNGLLOGICOPPROC LogicOp;
        /*   27 */ PFNGLSTENCILFUNCPROC StencilFunc;
        /*   28 */ PFNGLSTENCILOPPROC StencilOp;
        /*   29 */ PFNGLDEPTHFUNCPROC DepthFunc;
        /*   30 */ PFNGLPIXELSTOREFPROC PixelStoref;
        /*   31 */ PFNGLPIXELSTOREIPROC PixelStorei;
        /*   32 */ PFNGLREADBUFFERPROC ReadBuffer;
        /*   33 */ PFNGLREADPIXELSPROC ReadPixels;
        /*   34 */ PFNGLGETBOOLEANVPROC GetBooleanv;
        /*   35 */ PFNGLGETDOUBLEVPROC GetDoublev;
        /*   36 */ PFNGLGETERRORPROC GetError;
        /*   37 */ PFNGLGETFLOATVPROC GetFloatv;
        /*   38 */ PFNGLGETINTEGERVPROC GetIntegerv;
        /*   39 */ PFNGLGETSTRINGPROC GetString;
        /*   40 */ PFNGLGETTEXIMAGEPROC GetTexImage;
        /*   41 */ PFNGLGETTEXPARAMETERFVPROC GetTexParameterfv;
        /*   42 */ PFNGLGETTEXPARAMETERIVPROC GetTexParameteriv;
        /*   43 */ PFNGLGETTEXLEVELPARAMETERFVPROC GetTexLevelParameterfv;
        /*   44 */ PFNGLGETTEXLEVELPARAMETERIVPROC GetTexLevelParameteriv;
        /*   45 */ PFNGLISENABLEDPROC IsEnabled;
        /*   46 */ PFNGLDEPTHRANGEPROC DepthRange;
        /*   47 */ PFNGLVIEWPORTPROC Viewport;
        /*   48 */ PFNGLDRAWARRAYSPROC DrawArrays;
        /*   49 */ PFNGLDRAWELEMENTSPROC DrawElements;
        /*   50 */ PFNGLPOLYGONOFFSETPROC PolygonOffset;
        /*   51 */ PFNGLCOPYTEXIMAGE1DPROC CopyTexImage1D;
        /*   52 */ PFNGLCOPYTEXIMAGE2DPROC CopyTexImage2D;
        /*   53 */ PFNGLCOPYTEXSUBIMAGE1DPROC CopyTexSubImage1D;
        /*   54 */ PFNGLCOPYTEXSUBIMAGE2DPROC CopyTexSubImage2D;
        /*   55 */ PFNGLTEXSUBIMAGE1DPROC TexSubImage1D;
        /*   56 */ PFNGLTEXSUBIMAGE2DPROC TexSubImage2D;
        /*   57 */ PFNGLBINDTEXTUREPROC BindTexture;
        /*   58 */ PFNGLDELETETEXTURESPROC DeleteTextures;
        /*   59 */ PFNGLGENTEXTURESPROC GenTextures;
        /*   60 */ PFNGLISTEXTUREPROC IsTexture;
        /*   61 */ PFNGLDRAWRANGEELEMENTSPROC DrawRangeElements;
        /*   62 */ PFNGLTEXIMAGE3DPROC TexImage3D;
        /*   63 */ PFNGLTEXSUBIMAGE3DPROC TexSubImage3D;
        /*   64 */ PFNGLCOPYTEXSUBIMAGE3DPROC CopyTexSubImage3D;
        /*   65 */ PFNGLACTIVETEXTUREPROC ActiveTexture;
        /*   66 */ PFNGLSAMPLECOVERAGEPROC SampleCoverage;
        /*   67 */ PFNGLCOMPRESSEDTEXIMAGE3DPROC CompressedTexImage3D;
        /*   68 */ PFNGLCOMPRESSEDTEXIMAGE2DPROC CompressedTexImage2D;
        /*   69 */ PFNGLCOMPRESSEDTEXIMAGE1DPROC CompressedTexImage1D;
        /*   70 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DPROC CompressedTexSubImage3D;
        /*   71 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC CompressedTexSubImage2D;
        /*   72 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DPROC CompressedTexSubImage1D;
        /*   73 */ PFNGLGETCOMPRESSEDTEXIMAGEPROC GetCompressedTexImage;
        /*   74 */ PFNGLBLENDFUNCSEPARATEPROC BlendFuncSeparate;
        /*   75 */ PFNGLMULTIDRAWARRAYSPROC MultiDrawArrays;
        /*   76 */ PFNGLMULTIDRAWELEMENTSPROC MultiDrawElements;
        /*   77 */ PFNGLPOINTPARAMETERFPROC PointParameterf;
        /*   78 */ PFNGLPOINTPARAMETERFVPROC PointParameterfv;
        /*   79 */ PFNGLPOINTPARAMETERIPROC PointParameteri;
        /*   80 */ PFNGLPOINTPARAMETERIVPROC PointParameteriv;
        /*   81 */ PFNGLBLENDCOLORPROC BlendColor;
        /*   82 */ PFNGLBLENDEQUATIONPROC BlendEquation;
        /*   83 */ PFNGLGENQUERIESPROC GenQueries;
        /*   84 */ PFNGLDELETEQUERIESPROC DeleteQueries;
        /*   85 */ PFNGLISQUERYPROC IsQuery;
        /*   86 */ PFNGLBEGINQUERYPROC BeginQuery;
        /*   87 */ PFNGLENDQUERYPROC EndQuery;
        /*   88 */ PFNGLGETQUERYIVPROC GetQueryiv;
        /*   89 */ PFNGLGETQUERYOBJECTIVPROC GetQueryObjectiv;
        /*   90 */ PFNGLGETQUERYOBJECTUIVPROC GetQueryObjectuiv;
        /*   91 */ PFNGLBINDBUFFERPROC BindBuffer;
        /*   92 */ PFNGLDELETEBUFFERSPROC DeleteBuffers;
        /*   93 */ PFNGLGENBUFFERSPROC GenBuffers;
        /*   94 */ PFNGLISBUFFERPROC IsBuffer;
        /*   95 */ PFNGLBUFFERDATAPROC BufferData;
        /*   96 */ PFNGLBUFFERSUBDATAPROC BufferSubData;
        /*   97 */ PFNGLGETBUFFERSUBDATAPROC GetBufferSubData;
        /*   98 */ PFNGLMAPBUFFERPROC MapBuffer;
        /*   99 */ PFNGLUNMAPBUFFERPROC UnmapBuffer;
        /*  100 */ PFNGLGETBUFFERPARAMETERIVPROC GetBufferParameteriv;
        /*  101 */ PFNGLGETBUFFERPOINTERVPROC GetBufferPointerv;
        /*  102 */ PFNGLBLENDEQUATIONSEPARATEPROC BlendEquationSeparate;
        /*  103 */ PFNGLDRAWBUFFERSPROC DrawBuffers;
        /*  104 */ PFNGLSTENCILOPSEPARATEPROC StencilOpSeparate;
        /*  105 */ PFNGLSTENCILFUNCSEPARATEPROC StencilFuncSeparate;
        /*  106 */ PFNGLSTENCILMASKSEPARATEPROC StencilMaskSeparate;
        /*  107 */ PFNGLATTACHSHADERPROC AttachShader;
        /*  108 */ PFNGLBINDATTRIBLOCATIONPROC BindAttribLocation;
        /*  109 */ PFNGLCOMPILESHADERPROC CompileShader;
        /*  110 */ PFNGLCREATEPROGRAMPROC CreateProgram;
        /*  111 */ PFNGLCREATESHADERPROC CreateShader;
        /*  112 */ PFNGLDELETEPROGRAMPROC DeleteProgram;
        /*  113 */ PFNGLDELETESHADERPROC DeleteShader;
        /*  114 */ PFNGLDETACHSHADERPROC DetachShader;
        /*  115 */ PFNGLDISABLEVERTEXATTRIBARRAYPROC DisableVertexAttribArray;
        /*  116 */ PFNGLENABLEVERTEXATTRIBARRAYPROC EnableVertexAttribArray;
        /*  117 */ PFNGLGETACTIVEATTRIBPROC GetActiveAttrib;
        /*  118 */ PFNGLGETACTIVEUNIFORMPROC GetActiveUniform;
        /*  119 */ PFNGLGETATTACHEDSHADERSPROC GetAttachedShaders;
        /*  120 */ PFNGLGETATTRIBLOCATIONPROC GetAttribLocation;
        /*  121 */ PFNGLGETPROGRAMIVPROC GetProgramiv;
        /*  122 */ PFNGLGETPROGRAMINFOLOGPROC GetProgramInfoLog;
        /*  123 */ PFNGLGETSHADERIVPROC GetShaderiv;
        /*  124 */ PFNGLGETSHADERINFOLOGPROC GetShaderInfoLog;
        /*  125 */ PFNGLGETSHADERSOURCEPROC GetShaderSource;
        /*  126 */ PFNGLGETUNIFORMLOCATIONPROC GetUniformLocation;
        /*  127 */ PFNGLGETUNIFORMFVPROC GetUniformfv;
        /*  128 */ PFNGLGETUNIFORMIVPROC GetUniformiv;
        /*  129 */ PFNGLGETVERTEXATTRIBDVPROC GetVertexAttribdv;
        /*  130 */ PFNGLGETVERTEXATTRIBFVPROC GetVertexAttribfv;
        /*  131 */ PFNGLGETVERTEXATTRIBIVPROC GetVertexAttribiv;
        /*  132 */ PFNGLGETVERTEXATTRIBPOINTERVPROC GetVertexAttribPointerv;
        /*  133 */ PFNGLISPROGRAMPROC IsProgram;
        /*  134 */ PFNGLISSHADERPROC IsShader;
        /*  135 */ PFNGLLINKPROGRAMPROC LinkProgram;
        /*  136 */ PFNGLSHADERSOURCEPROC ShaderSource;
        /*  137 */ PFNGLUSEPROGRAMPROC UseProgram;
        /*  138 */ PFNGLUNIFORM1FPROC Uniform1f;
        /*  139 */ PFNGLUNIFORM2FPROC Uniform2f;
        /*  140 */ PFNGLUNIFORM3FPROC Uniform3f;
        /*  141 */ PFNGLUNIFORM4FPROC Uniform4f;
        /*  142 */ PFNGLUNIFORM1IPROC Uniform1i;
        /*  143 */ PFNGLUNIFORM2IPROC Uniform2i;
        /*  144 */ PFNGLUNIFORM3IPROC Uniform3i;
        /*  145 */ PFNGLUNIFORM4IPROC Uniform4i;
        /*  146 */ PFNGLUNIFORM1FVPROC Uniform1fv;
        /*  147 */ PFNGLUNIFORM2FVPROC Uniform2fv;
        /*  148 */ PFNGLUNIFORM3FVPROC Uniform3fv;
        /*  149 */ PFNGLUNIFORM4FVPROC Uniform4fv;
        /*  150 */ PFNGLUNIFORM1IVPROC Uniform1iv;
        /*  151 */ PFNGLUNIFORM2IVPROC Uniform2iv;
        /*  152 */ PFNGLUNIFORM3IVPROC Uniform3iv;
        /*  153 */ PFNGLUNIFORM4IVPROC Uniform4iv;
        /*  154 */ PFNGLUNIFORMMATRIX2FVPROC UniformMatrix2fv;
        /*  155 */ PFNGLUNIFORMMATRIX3FVPROC UniformMatrix3fv;
        /*  156 */ PFNGLUNIFORMMATRIX4FVPROC UniformMatrix4fv;
        /*  157 */ PFNGLVALIDATEPROGRAMPROC ValidateProgram;
        /*  158 */ PFNGLVERTEXATTRIB1DPROC VertexAttrib1d;
        /*  159 */ PFNGLVERTEXATTRIB1DVPROC VertexAttrib1dv;
        /*  160 */ PFNGLVERTEXATTRIB1FPROC VertexAttrib1f;
        /*  161 */ PFNGLVERTEXATTRIB1FVPROC VertexAttrib1fv;
        /*  162 */ PFNGLVERTEXATTRIB1SPROC VertexAttrib1s;
        /*  163 */ PFNGLVERTEXATTRIB1SVPROC VertexAttrib1sv;
        /*  164 */ PFNGLVERTEXATTRIB2DPROC VertexAttrib2d;
        /*  165 */ PFNGLVERTEXATTRIB2DVPROC VertexAttrib2dv;
        /*  166 */ PFNGLVERTEXATTRIB2FPROC VertexAttrib2f;
        /*  167 */ PFNGLVERTEXATTRIB2FVPROC VertexAttrib2fv;
        /*  168 */ PFNGLVERTEXATTRIB2SPROC VertexAttrib2s;
        /*  169 */ PFNGLVERTEXATTRIB2SVPROC VertexAttrib2sv;
        /*  170 */ PFNGLVERTEXATTRIB3DPROC VertexAttrib3d;
        /*  171 */ PFNGLVERTEXATTRIB3DVPROC VertexAttrib3dv;
        /*  172 */ PFNGLVERTEXATTRIB3FPROC VertexAttrib3f;
        /*  173 */ PFNGLVERTEXATTRIB3FVPROC VertexAttrib3fv;
        /*  174 */ PFNGLVERTEXATTRIB3SPROC VertexAttrib3s;
        /*  175 */ PFNGLVERTEXATTRIB3SVPROC VertexAttrib3sv;
        /*  176 */ PFNGLVERTEXATTRIB4NBVPROC VertexAttrib4Nbv;
        /*  177 */ PFNGLVERTEXATTRIB4NIVPROC VertexAttrib4Niv;
        /*  178 */ PFNGLVERTEXATTRIB4NSVPROC VertexAttrib4Nsv;
        /*  179 */ PFNGLVERTEXATTRIB4NUBPROC VertexAttrib4Nub;
        /*  180 */ PFNGLVERTEXATTRIB4NUBVPROC VertexAttrib4Nubv;
        /*  181 */ PFNGLVERTEXATTRIB4NUIVPROC VertexAttrib4Nuiv;
        /*  182 */ PFNGLVERTEXATTRIB4NUSVPROC VertexAttrib4Nusv;
        /*  183 */ PFNGLVERTEXATTRIB4BVPROC VertexAttrib4bv;
        /*  184 */ PFNGLVERTEXATTRIB4DPROC VertexAttrib4d;
        /*  185 */ PFNGLVERTEXATTRIB4DVPROC VertexAttrib4dv;
        /*  186 */ PFNGLVERTEXATTRIB4FPROC VertexAttrib4f;
        /*  187 */ PFNGLVERTEXATTRIB4FVPROC VertexAttrib4fv;
        /*  188 */ PFNGLVERTEXATTRIB4IVPROC VertexAttrib4iv;
        /*  189 */ PFNGLVERTEXATTRIB4SPROC VertexAttrib4s;
        /*  190 */ PFNGLVERTEXATTRIB4SVPROC VertexAttrib4sv;
        /*  191 */ PFNGLVERTEXATTRIB4UBVPROC VertexAttrib4ubv;
        /*  192 */ PFNGLVERTEXATTRIB4UIVPROC VertexAttrib4uiv;
        /*  193 */ PFNGLVERTEXATTRIB4USVPROC VertexAttrib4usv;
        /*  194 */ PFNGLVERTEXATTRIBPOINTERPROC VertexAttribPointer;
        /*  195 */ PFNGLUNIFORMMATRIX2X3FVPROC UniformMatrix2x3fv;
        /*  196 */ PFNGLUNIFORMMATRIX3X2FVPROC UniformMatrix3x2fv;
        /*  197 */ PFNGLUNIFORMMATRIX2X4FVPROC UniformMatrix2x4fv;
        /*  198 */ PFNGLUNIFORMMATRIX4X2FVPROC UniformMatrix4x2fv;
        /*  199 */ PFNGLUNIFORMMATRIX3X4FVPROC UniformMatrix3x4fv;
        /*  200 */ PFNGLUNIFORMMATRIX4X3FVPROC UniformMatrix4x3fv;
        /*  201 */ PFNGLCOLORMASKIPROC ColorMaski;
        /*  202 */ PFNGLGETBOOLEANI_VPROC GetBooleani_v;
        /*  203 */ PFNGLGETINTEGERI_VPROC GetIntegeri_v;
        /*  204 */ PFNGLENABLEIPROC Enablei;
        /*  205 */ PFNGLDISABLEIPROC Disablei;
        /*  206 */ PFNGLISENABLEDIPROC IsEnabledi;
        /*  207 */ PFNGLBEGINTRANSFORMFEEDBACKPROC BeginTransformFeedback;
        /*  208 */ PFNGLENDTRANSFORMFEEDBACKPROC EndTransformFeedback;
        /*  209 */ PFNGLBINDBUFFERRANGEPROC BindBufferRange;
        /*  210 */ PFNGLBINDBUFFERBASEPROC BindBufferBase;
        /*  211 */ PFNGLTRANSFORMFEEDBACKVARYINGSPROC TransformFeedbackVaryings;
        /*  212 */ PFNGLGETTRANSFORMFEEDBACKVARYINGPROC GetTransformFeedbackVarying;
        /*  213 */ PFNGLCLAMPCOLORPROC ClampColor;
        /*  214 */ PFNGLBEGINCONDITIONALRENDERPROC BeginConditionalRender;
        /*  215 */ PFNGLENDCONDITIONALRENDERPROC EndConditionalRender;
        /*  216 */ PFNGLVERTEXATTRIBIPOINTERPROC VertexAttribIPointer;
        /*  217 */ PFNGLGETVERTEXATTRIBIIVPROC GetVertexAttribIiv;
        /*  218 */ PFNGLGETVERTEXATTRIBIUIVPROC GetVertexAttribIuiv;
        /*  219 */ PFNGLVERTEXATTRIBI1IPROC VertexAttribI1i;
        /*  220 */ PFNGLVERTEXATTRIBI2IPROC VertexAttribI2i;
        /*  221 */ PFNGLVERTEXATTRIBI3IPROC VertexAttribI3i;
        /*  222 */ PFNGLVERTEXATTRIBI4IPROC VertexAttribI4i;
        /*  223 */ PFNGLVERTEXATTRIBI1UIPROC VertexAttribI1ui;
        /*  224 */ PFNGLVERTEXATTRIBI2UIPROC VertexAttribI2ui;
        /*  225 */ PFNGLVERTEXATTRIBI3UIPROC VertexAttribI3ui;
        /*  226 */ PFNGLVERTEXATTRIBI4UIPROC VertexAttribI4ui;
        /*  227 */ PFNGLVERTEXATTRIBI1IVPROC VertexAttribI1iv;
        /*  228 */ PFNGLVERTEXATTRIBI2IVPROC VertexAttribI2iv;
        /*  229 */ PFNGLVERTEXATTRIBI3IVPROC VertexAttribI3iv;
        /*  230 */ PFNGLVERTEXATTRIBI4IVPROC VertexAttribI4iv;
        /*  231 */ PFNGLVERTEXATTRIBI1UIVPROC VertexAttribI1uiv;
        /*  232 */ PFNGLVERTEXATTRIBI2UIVPROC VertexAttribI2uiv;
        /*  233 */ PFNGLVERTEXATTRIBI3UIVPROC VertexAttribI3uiv;
        /*  234 */ PFNGLVERTEXATTRIBI4UIVPROC VertexAttribI4uiv;
        /*  235 */ PFNGLVERTEXATTRIBI4BVPROC VertexAttribI4bv;
        /*  236 */ PFNGLVERTEXATTRIBI4SVPROC VertexAttribI4sv;
        /*  237 */ PFNGLVERTEXATTRIBI4UBVPROC VertexAttribI4ubv;
        /*  238 */ PFNGLVERTEXATTRIBI4USVPROC VertexAttribI4usv;
        /*  239 */ PFNGLGETUNIFORMUIVPROC GetUniformuiv;
        /*  240 */ PFNGLBINDFRAGDATALOCATIONPROC BindFragDataLocation;
        /*  241 */ PFNGLGETFRAGDATALOCATIONPROC GetFragDataLocation;
        /*  242 */ PFNGLUNIFORM1UIPROC Uniform1ui;
        /*  243 */ PFNGLUNIFORM2UIPROC Uniform2ui;
        /*  244 */ PFNGLUNIFORM3UIPROC Uniform3ui;
        /*  245 */ PFNGLUNIFORM4UIPROC Uniform4ui;
        /*  246 */ PFNGLUNIFORM1UIVPROC Uniform1uiv;
        /*  247 */ PFNGLUNIFORM2UIVPROC Uniform2uiv;
        /*  248 */ PFNGLUNIFORM3UIVPROC Uniform3uiv;
        /*  249 */ PFNGLUNIFORM4UIVPROC Uniform4uiv;
        /*  250 */ PFNGLTEXPARAMETERIIVPROC TexParameterIiv;
        /*  251 */ PFNGLTEXPARAMETERIUIVPROC TexParameterIuiv;
        /*  252 */ PFNGLGETTEXPARAMETERIIVPROC GetTexParameterIiv;
        /*  253 */ PFNGLGETTEXPARAMETERIUIVPROC GetTexParameterIuiv;
        /*  254 */ PFNGLCLEARBUFFERIVPROC ClearBufferiv;
        /*  255 */ PFNGLCLEARBUFFERUIVPROC ClearBufferuiv;
        /*  256 */ PFNGLCLEARBUFFERFVPROC ClearBufferfv;
        /*  257 */ PFNGLCLEARBUFFERFIPROC ClearBufferfi;
        /*  258 */ PFNGLGETSTRINGIPROC GetStringi;
        /*  259 */ PFNGLISRENDERBUFFERPROC IsRenderbuffer;
        /*  260 */ PFNGLBINDRENDERBUFFERPROC BindRenderbuffer;
        /*  261 */ PFNGLDELETERENDERBUFFERSPROC DeleteRenderbuffers;
        /*  262 */ PFNGLGENRENDERBUFFERSPROC GenRenderbuffers;
        /*  263 */ PFNGLRENDERBUFFERSTORAGEPROC RenderbufferStorage;
        /*  264 */ PFNGLGETRENDERBUFFERPARAMETERIVPROC GetRenderbufferParameteriv;
        /*  265 */ PFNGLISFRAMEBUFFERPROC IsFramebuffer;
        /*  266 */ PFNGLBINDFRAMEBUFFERPROC BindFramebuffer;
        /*  267 */ PFNGLDELETEFRAMEBUFFERSPROC DeleteFramebuffers;
        /*  268 */ PFNGLGENFRAMEBUFFERSPROC GenFramebuffers;
        /*  269 */ PFNGLCHECKFRAMEBUFFERSTATUSPROC CheckFramebufferStatus;
        /*  270 */ PFNGLFRAMEBUFFERTEXTURE1DPROC FramebufferTexture1D;
        /*  271 */ PFNGLFRAMEBUFFERTEXTURE2DPROC FramebufferTexture2D;
        /*  272 */ PFNGLFRAMEBUFFERTEXTURE3DPROC FramebufferTexture3D;
        /*  273 */ PFNGLFRAMEBUFFERRENDERBUFFERPROC FramebufferRenderbuffer;
        /*  274 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetFramebufferAttachmentParameteriv;
        /*  275 */ PFNGLGENERATEMIPMAPPROC GenerateMipmap;
        /*  276 */ PFNGLBLITFRAMEBUFFERPROC BlitFramebuffer;
        /*  277 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEPROC RenderbufferStorageMultisample;
        /*  278 */ PFNGLFRAMEBUFFERTEXTURELAYERPROC FramebufferTextureLayer;
        /*  279 */ PFNGLMAPBUFFERRANGEPROC MapBufferRange;
        /*  280 */ PFNGLFLUSHMAPPEDBUFFERRANGEPROC FlushMappedBufferRange;
        /*  281 */ PFNGLBINDVERTEXARRAYPROC BindVertexArray;
        /*  282 */ PFNGLDELETEVERTEXARRAYSPROC DeleteVertexArrays;
        /*  283 */ PFNGLGENVERTEXARRAYSPROC GenVertexArrays;
        /*  284 */ PFNGLISVERTEXARRAYPROC IsVertexArray;
        /*  285 */ PFNGLDRAWARRAYSINSTANCEDPROC DrawArraysInstanced;
        /*  286 */ PFNGLDRAWELEMENTSINSTANCEDPROC DrawElementsInstanced;
        /*  287 */ PFNGLTEXBUFFERPROC TexBuffer;
        /*  288 */ PFNGLPRIMITIVERESTARTINDEXPROC PrimitiveRestartIndex;
        /*  289 */ PFNGLCOPYBUFFERSUBDATAPROC CopyBufferSubData;
        /*  290 */ PFNGLGETUNIFORMINDICESPROC GetUniformIndices;
        /*  291 */ PFNGLGETACTIVEUNIFORMSIVPROC GetActiveUniformsiv;
        /*  292 */ PFNGLGETACTIVEUNIFORMNAMEPROC GetActiveUniformName;
        /*  293 */ PFNGLGETUNIFORMBLOCKINDEXPROC GetUniformBlockIndex;
        /*  294 */ PFNGLGETACTIVEUNIFORMBLOCKIVPROC GetActiveUniformBlockiv;
        /*  295 */ PFNGLGETACTIVEUNIFORMBLOCKNAMEPROC GetActiveUniformBlockName;
        /*  296 */ PFNGLUNIFORMBLOCKBINDINGPROC UniformBlockBinding;
        /*  297 */ PFNGLDRAWELEMENTSBASEVERTEXPROC DrawElementsBaseVertex;
        /*  298 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXPROC DrawRangeElementsBaseVertex;
        /*  299 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXPROC DrawElementsInstancedBaseVertex;
        /*  300 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXPROC MultiDrawElementsBaseVertex;
        /*  301 */ PFNGLPROVOKINGVERTEXPROC ProvokingVertex;
        /*  302 */ PFNGLFENCESYNCPROC FenceSync;
        /*  303 */ PFNGLISSYNCPROC IsSync;
        /*  304 */ PFNGLDELETESYNCPROC DeleteSync;
        /*  305 */ PFNGLCLIENTWAITSYNCPROC ClientWaitSync;
        /*  306 */ PFNGLWAITSYNCPROC WaitSync;
        /*  307 */ PFNGLGETINTEGER64VPROC GetInteger64v;
        /*  308 */ PFNGLGETSYNCIVPROC GetSynciv;
        /*  309 */ PFNGLGETINTEGER64I_VPROC GetInteger64i_v;
        /*  310 */ PFNGLGETBUFFERPARAMETERI64VPROC GetBufferParameteri64v;
        /*  311 */ PFNGLFRAMEBUFFERTEXTUREPROC FramebufferTexture;
        /*  312 */ PFNGLTEXIMAGE2DMULTISAMPLEPROC TexImage2DMultisample;
        /*  313 */ PFNGLTEXIMAGE3DMULTISAMPLEPROC TexImage3DMultisample;
        /*  314 */ PFNGLGETMULTISAMPLEFVPROC GetMultisamplefv;
        /*  315 */ PFNGLSAMPLEMASKIPROC SampleMaski;
        /*  316 */ PFNGLBINDFRAGDATALOCATIONINDEXEDPROC BindFragDataLocationIndexed;
        /*  317 */ PFNGLGETFRAGDATAINDEXPROC GetFragDataIndex;
        /*  318 */ PFNGLGENSAMPLERSPROC GenSamplers;
        /*  319 */ PFNGLDELETESAMPLERSPROC DeleteSamplers;
        /*  320 */ PFNGLISSAMPLERPROC IsSampler;
        /*  321 */ PFNGLBINDSAMPLERPROC BindSampler;
        /*  322 */ PFNGLSAMPLERPARAMETERIPROC SamplerParameteri;
        /*  323 */ PFNGLSAMPLERPARAMETERIVPROC SamplerParameteriv;
        /*  324 */ PFNGLSAMPLERPARAMETERFPROC SamplerParameterf;
        /*  325 */ PFNGLSAMPLERPARAMETERFVPROC SamplerParameterfv;
        /*  326 */ PFNGLSAMPLERPARAMETERIIVPROC SamplerParameterIiv;
        /*  327 */ PFNGLSAMPLERPARAMETERIUIVPROC SamplerParameterIuiv;
        /*  328 */ PFNGLGETSAMPLERPARAMETERIVPROC GetSamplerParameteriv;
        /*  329 */ PFNGLGETSAMPLERPARAMETERIIVPROC GetSamplerParameterIiv;
        /*  330 */ PFNGLGETSAMPLERPARAMETERFVPROC GetSamplerParameterfv;
        /*  331 */ PFNGLGETSAMPLERPARAMETERIUIVPROC GetSamplerParameterIuiv;
        /*  332 */ PFNGLQUERYCOUNTERPROC QueryCounter;
        /*  333 */ PFNGLGETQUERYOBJECTI64VPROC GetQueryObjecti64v;
        /*  334 */ PFNGLGETQUERYOBJECTUI64VPROC GetQueryObjectui64v;
        /*  335 */ PFNGLVERTEXATTRIBDIVISORPROC VertexAttribDivisor;
        /*  336 */ PFNGLVERTEXATTRIBP1UIPROC VertexAttribP1ui;
        /*  337 */ PFNGLVERTEXATTRIBP1UIVPROC VertexAttribP1uiv;
        /*  338 */ PFNGLVERTEXATTRIBP2UIPROC VertexAttribP2ui;
        /*  339 */ PFNGLVERTEXATTRIBP2UIVPROC VertexAttribP2uiv;
        /*  340 */ PFNGLVERTEXATTRIBP3UIPROC VertexAttribP3ui;
        /*  341 */ PFNGLVERTEXATTRIBP3UIVPROC VertexAttribP3uiv;
        /*  342 */ PFNGLVERTEXATTRIBP4UIPROC VertexAttribP4ui;
        /*  343 */ PFNGLVERTEXATTRIBP4UIVPROC VertexAttribP4uiv;
        /*  344 */ PFNGLMINSAMPLESHADINGPROC MinSampleShading;
        /*  345 */ PFNGLBLENDEQUATIONIPROC BlendEquationi;
        /*  346 */ PFNGLBLENDEQUATIONSEPARATEIPROC BlendEquationSeparatei;
        /*  347 */ PFNGLBLENDFUNCIPROC BlendFunci;
        /*  348 */ PFNGLBLENDFUNCSEPARATEIPROC BlendFuncSeparatei;
        /*  349 */ PFNGLDRAWARRAYSINDIRECTPROC DrawArraysIndirect;
        /*  350 */ PFNGLDRAWELEMENTSINDIRECTPROC DrawElementsIndirect;
        /*  351 */ PFNGLUNIFORM1DPROC Uniform1d;
        /*  352 */ PFNGLUNIFORM2DPROC Uniform2d;
        /*  353 */ PFNGLUNIFORM3DPROC Uniform3d;
        /*  354 */ PFNGLUNIFORM4DPROC Uniform4d;
        /*  355 */ PFNGLUNIFORM1DVPROC Uniform1dv;
        /*  356 */ PFNGLUNIFORM2DVPROC Uniform2dv;
        /*  357 */ PFNGLUNIFORM3DVPROC Uniform3dv;
        /*  358 */ PFNGLUNIFORM4DVPROC Uniform4dv;
        /*  359 */ PFNGLUNIFORMMATRIX2DVPROC UniformMatrix2dv;
        /*  360 */ PFNGLUNIFORMMATRIX3DVPROC UniformMatrix3dv;
        /*  361 */ PFNGLUNIFORMMATRIX4DVPROC UniformMatrix4dv;
        /*  362 */ PFNGLUNIFORMMATRIX2X3DVPROC UniformMatrix2x3dv;
        /*  363 */ PFNGLUNIFORMMATRIX2X4DVPROC UniformMatrix2x4dv;
        /*  364 */ PFNGLUNIFORMMATRIX3X2DVPROC UniformMatrix3x2dv;
        /*  365 */ PFNGLUNIFORMMATRIX3X4DVPROC UniformMatrix3x4dv;
        /*  366 */ PFNGLUNIFORMMATRIX4X2DVPROC UniformMatrix4x2dv;
        /*  367 */ PFNGLUNIFORMMATRIX4X3DVPROC UniformMatrix4x3dv;
        /*  368 */ PFNGLGETUNIFORMDVPROC GetUniformdv;
        /*  369 */ PFNGLGETSUBROUTINEUNIFORMLOCATIONPROC GetSubroutineUniformLocation;
        /*  370 */ PFNGLGETSUBROUTINEINDEXPROC GetSubroutineIndex;
        /*  371 */ PFNGLGETACTIVESUBROUTINEUNIFORMIVPROC GetActiveSubroutineUniformiv;
        /*  372 */ PFNGLGETACTIVESUBROUTINEUNIFORMNAMEPROC GetActiveSubroutineUniformName;
        /*  373 */ PFNGLGETACTIVESUBROUTINENAMEPROC GetActiveSubroutineName;
        /*  374 */ PFNGLUNIFORMSUBROUTINESUIVPROC UniformSubroutinesuiv;
        /*  375 */ PFNGLGETUNIFORMSUBROUTINEUIVPROC GetUniformSubroutineuiv;
        /*  376 */ PFNGLGETPROGRAMSTAGEIVPROC GetProgramStageiv;
        /*  377 */ PFNGLPATCHPARAMETERIPROC PatchParameteri;
        /*  378 */ PFNGLPATCHPARAMETERFVPROC PatchParameterfv;
        /*  379 */ PFNGLBINDTRANSFORMFEEDBACKPROC BindTransformFeedback;
        /*  380 */ PFNGLDELETETRANSFORMFEEDBACKSPROC DeleteTransformFeedbacks;
        /*  381 */ PFNGLGENTRANSFORMFEEDBACKSPROC GenTransformFeedbacks;
        /*  382 */ PFNGLISTRANSFORMFEEDBACKPROC IsTransformFeedback;
        /*  383 */ PFNGLPAUSETRANSFORMFEEDBACKPROC PauseTransformFeedback;
        /*  384 */ PFNGLRESUMETRANSFORMFEEDBACKPROC ResumeTransformFeedback;
        /*  385 */ PFNGLDRAWTRANSFORMFEEDBACKPROC DrawTransformFeedback;
        /*  386 */ PFNGLDRAWTRANSFORMFEEDBACKSTREAMPROC DrawTransformFeedbackStream;
        /*  387 */ PFNGLBEGINQUERYINDEXEDPROC BeginQueryIndexed;
        /*  388 */ PFNGLENDQUERYINDEXEDPROC EndQueryIndexed;
        /*  389 */ PFNGLGETQUERYINDEXEDIVPROC GetQueryIndexediv;
        /*  390 */ PFNGLRELEASESHADERCOMPILERPROC ReleaseShaderCompiler;
        /*  391 */ PFNGLSHADERBINARYPROC ShaderBinary;
        /*  392 */ PFNGLGETSHADERPRECISIONFORMATPROC GetShaderPrecisionFormat;
        /*  393 */ PFNGLDEPTHRANGEFPROC DepthRangef;
        /*  394 */ PFNGLCLEARDEPTHFPROC ClearDepthf;
        /*  395 */ PFNGLGETPROGRAMBINARYPROC GetProgramBinary;
        /*  396 */ PFNGLPROGRAMBINARYPROC ProgramBinary;
        /*  397 */ PFNGLPROGRAMPARAMETERIPROC ProgramParameteri;
        /*  398 */ PFNGLUSEPROGRAMSTAGESPROC UseProgramStages;
        /*  399 */ PFNGLACTIVESHADERPROGRAMPROC ActiveShaderProgram;
        /*  400 */ PFNGLCREATESHADERPROGRAMVPROC CreateShaderProgramv;
        /*  401 */ PFNGLBINDPROGRAMPIPELINEPROC BindProgramPipeline;
        /*  402 */ PFNGLDELETEPROGRAMPIPELINESPROC DeleteProgramPipelines;
        /*  403 */ PFNGLGENPROGRAMPIPELINESPROC GenProgramPipelines;
        /*  404 */ PFNGLISPROGRAMPIPELINEPROC IsProgramPipeline;
        /*  405 */ PFNGLGETPROGRAMPIPELINEIVPROC GetProgramPipelineiv;
        /*  406 */ PFNGLPROGRAMUNIFORM1IPROC ProgramUniform1i;
        /*  407 */ PFNGLPROGRAMUNIFORM1IVPROC ProgramUniform1iv;
        /*  408 */ PFNGLPROGRAMUNIFORM1FPROC ProgramUniform1f;
        /*  409 */ PFNGLPROGRAMUNIFORM1FVPROC ProgramUniform1fv;
        /*  410 */ PFNGLPROGRAMUNIFORM1DPROC ProgramUniform1d;
        /*  411 */ PFNGLPROGRAMUNIFORM1DVPROC ProgramUniform1dv;
        /*  412 */ PFNGLPROGRAMUNIFORM1UIPROC ProgramUniform1ui;
        /*  413 */ PFNGLPROGRAMUNIFORM1UIVPROC ProgramUniform1uiv;
        /*  414 */ PFNGLPROGRAMUNIFORM2IPROC ProgramUniform2i;
        /*  415 */ PFNGLPROGRAMUNIFORM2IVPROC ProgramUniform2iv;
        /*  416 */ PFNGLPROGRAMUNIFORM2FPROC ProgramUniform2f;
        /*  417 */ PFNGLPROGRAMUNIFORM2FVPROC ProgramUniform2fv;
        /*  418 */ PFNGLPROGRAMUNIFORM2DPROC ProgramUniform2d;
        /*  419 */ PFNGLPROGRAMUNIFORM2DVPROC ProgramUniform2dv;
        /*  420 */ PFNGLPROGRAMUNIFORM2UIPROC ProgramUniform2ui;
        /*  421 */ PFNGLPROGRAMUNIFORM2UIVPROC ProgramUniform2uiv;
        /*  422 */ PFNGLPROGRAMUNIFORM3IPROC ProgramUniform3i;
        /*  423 */ PFNGLPROGRAMUNIFORM3IVPROC ProgramUniform3iv;
        /*  424 */ PFNGLPROGRAMUNIFORM3FPROC ProgramUniform3f;
        /*  425 */ PFNGLPROGRAMUNIFORM3FVPROC ProgramUniform3fv;
        /*  426 */ PFNGLPROGRAMUNIFORM3DPROC ProgramUniform3d;
        /*  427 */ PFNGLPROGRAMUNIFORM3DVPROC ProgramUniform3dv;
        /*  428 */ PFNGLPROGRAMUNIFORM3UIPROC ProgramUniform3ui;
        /*  429 */ PFNGLPROGRAMUNIFORM3UIVPROC ProgramUniform3uiv;
        /*  430 */ PFNGLPROGRAMUNIFORM4IPROC ProgramUniform4i;
        /*  431 */ PFNGLPROGRAMUNIFORM4IVPROC ProgramUniform4iv;
        /*  432 */ PFNGLPROGRAMUNIFORM4FPROC ProgramUniform4f;
        /*  433 */ PFNGLPROGRAMUNIFORM4FVPROC ProgramUniform4fv;
        /*  434 */ PFNGLPROGRAMUNIFORM4DPROC ProgramUniform4d;
        /*  435 */ PFNGLPROGRAMUNIFORM4DVPROC ProgramUniform4dv;
        /*  436 */ PFNGLPROGRAMUNIFORM4UIPROC ProgramUniform4ui;
        /*  437 */ PFNGLPROGRAMUNIFORM4UIVPROC ProgramUniform4uiv;
        /*  438 */ PFNGLPROGRAMUNIFORMMATRIX2FVPROC ProgramUniformMatrix2fv;
        /*  439 */ PFNGLPROGRAMUNIFORMMATRIX3FVPROC ProgramUniformMatrix3fv;
        /*  440 */ PFNGLPROGRAMUNIFORMMATRIX4FVPROC ProgramUniformMatrix4fv;
        /*  441 */ PFNGLPROGRAMUNIFORMMATRIX2DVPROC ProgramUniformMatrix2dv;
        /*  442 */ PFNGLPROGRAMUNIFORMMATRIX3DVPROC ProgramUniformMatrix3dv;
        /*  443 */ PFNGLPROGRAMUNIFORMMATRIX4DVPROC ProgramUniformMatrix4dv;
        /*  444 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVPROC ProgramUniformMatrix2x3fv;
        /*  445 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVPROC ProgramUniformMatrix3x2fv;
        /*  446 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVPROC ProgramUniformMatrix2x4fv;
        /*  447 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVPROC ProgramUniformMatrix4x2fv;
        /*  448 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVPROC ProgramUniformMatrix3x4fv;
        /*  449 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVPROC ProgramUniformMatrix4x3fv;
        /*  450 */ PFNGLPROGRAMUNIFORMMATRIX2X3DVPROC ProgramUniformMatrix2x3dv;
        /*  451 */ PFNGLPROGRAMUNIFORMMATRIX3X2DVPROC ProgramUniformMatrix3x2dv;
        /*  452 */ PFNGLPROGRAMUNIFORMMATRIX2X4DVPROC ProgramUniformMatrix2x4dv;
        /*  453 */ PFNGLPROGRAMUNIFORMMATRIX4X2DVPROC ProgramUniformMatrix4x2dv;
        /*  454 */ PFNGLPROGRAMUNIFORMMATRIX3X4DVPROC ProgramUniformMatrix3x4dv;
        /*  455 */ PFNGLPROGRAMUNIFORMMATRIX4X3DVPROC ProgramUniformMatrix4x3dv;
        /*  456 */ PFNGLVALIDATEPROGRAMPIPELINEPROC ValidateProgramPipeline;
        /*  457 */ PFNGLGETPROGRAMPIPELINEINFOLOGPROC GetProgramPipelineInfoLog;
        /*  458 */ PFNGLVERTEXATTRIBL1DPROC VertexAttribL1d;
        /*  459 */ PFNGLVERTEXATTRIBL2DPROC VertexAttribL2d;
        /*  460 */ PFNGLVERTEXATTRIBL3DPROC VertexAttribL3d;
        /*  461 */ PFNGLVERTEXATTRIBL4DPROC VertexAttribL4d;
        /*  462 */ PFNGLVERTEXATTRIBL1DVPROC VertexAttribL1dv;
        /*  463 */ PFNGLVERTEXATTRIBL2DVPROC VertexAttribL2dv;
        /*  464 */ PFNGLVERTEXATTRIBL3DVPROC VertexAttribL3dv;
        /*  465 */ PFNGLVERTEXATTRIBL4DVPROC VertexAttribL4dv;
        /*  466 */ PFNGLVERTEXATTRIBLPOINTERPROC VertexAttribLPointer;
        /*  467 */ PFNGLGETVERTEXATTRIBLDVPROC GetVertexAttribLdv;
        /*  468 */ PFNGLVIEWPORTARRAYVPROC ViewportArrayv;
        /*  469 */ PFNGLVIEWPORTINDEXEDFPROC ViewportIndexedf;
        /*  470 */ PFNGLVIEWPORTINDEXEDFVPROC ViewportIndexedfv;
        /*  471 */ PFNGLSCISSORARRAYVPROC ScissorArrayv;
        /*  472 */ PFNGLSCISSORINDEXEDPROC ScissorIndexed;
        /*  473 */ PFNGLSCISSORINDEXEDVPROC ScissorIndexedv;
        /*  474 */ PFNGLDEPTHRANGEARRAYVPROC DepthRangeArrayv;
        /*  475 */ PFNGLDEPTHRANGEINDEXEDPROC DepthRangeIndexed;
        /*  476 */ PFNGLGETFLOATI_VPROC GetFloati_v;
        /*  477 */ PFNGLGETDOUBLEI_VPROC GetDoublei_v;
        /*  478 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEPROC DrawArraysInstancedBaseInstance;
        /*  479 */ PFNGLDRAWELEMENTSINSTANCEDBASEINSTANCEPROC DrawElementsInstancedBaseInstance;
        /*  480 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEPROC DrawElementsInstancedBaseVertexBaseInstance;
        /*  481 */ PFNGLGETINTERNALFORMATIVPROC GetInternalformativ;
        /*  482 */ PFNGLGETACTIVEATOMICCOUNTERBUFFERIVPROC GetActiveAtomicCounterBufferiv;
        /*  483 */ PFNGLBINDIMAGETEXTUREPROC BindImageTexture;
        /*  484 */ PFNGLMEMORYBARRIERPROC MemoryBarrier;
        /*  485 */ PFNGLTEXSTORAGE1DPROC TexStorage1D;
        /*  486 */ PFNGLTEXSTORAGE2DPROC TexStorage2D;
        /*  487 */ PFNGLTEXSTORAGE3DPROC TexStorage3D;
        /*  488 */ PFNGLDRAWTRANSFORMFEEDBACKINSTANCEDPROC DrawTransformFeedbackInstanced;
        /*  489 */ PFNGLDRAWTRANSFORMFEEDBACKSTREAMINSTANCEDPROC DrawTransformFeedbackStreamInstanced;
        /*  490 */ PFNGLCLEARBUFFERDATAPROC ClearBufferData;
        /*  491 */ PFNGLCLEARBUFFERSUBDATAPROC ClearBufferSubData;
        /*  492 */ PFNGLDISPATCHCOMPUTEPROC DispatchCompute;
        /*  493 */ PFNGLDISPATCHCOMPUTEINDIRECTPROC DispatchComputeIndirect;
        /*  494 */ PFNGLCOPYIMAGESUBDATAPROC CopyImageSubData;
        /*  495 */ PFNGLFRAMEBUFFERPARAMETERIPROC FramebufferParameteri;
        /*  496 */ PFNGLGETFRAMEBUFFERPARAMETERIVPROC GetFramebufferParameteriv;
        /*  497 */ PFNGLGETINTERNALFORMATI64VPROC GetInternalformati64v;
        /*  498 */ PFNGLINVALIDATETEXSUBIMAGEPROC InvalidateTexSubImage;
        /*  499 */ PFNGLINVALIDATETEXIMAGEPROC InvalidateTexImage;
        /*  500 */ PFNGLINVALIDATEBUFFERSUBDATAPROC InvalidateBufferSubData;
        /*  501 */ PFNGLINVALIDATEBUFFERDATAPROC InvalidateBufferData;
        /*  502 */ PFNGLINVALIDATEFRAMEBUFFERPROC InvalidateFramebuffer;
        /*  503 */ PFNGLINVALIDATESUBFRAMEBUFFERPROC InvalidateSubFramebuffer;
        /*  504 */ PFNGLMULTIDRAWARRAYSINDIRECTPROC MultiDrawArraysIndirect;
        /*  505 */ PFNGLMULTIDRAWELEMENTSINDIRECTPROC MultiDrawElementsIndirect;
        /*  506 */ PFNGLGETPROGRAMINTERFACEIVPROC GetProgramInterfaceiv;
        /*  507 */ PFNGLGETPROGRAMRESOURCEINDEXPROC GetProgramResourceIndex;
        /*  508 */ PFNGLGETPROGRAMRESOURCENAMEPROC GetProgramResourceName;
        /*  509 */ PFNGLGETPROGRAMRESOURCEIVPROC GetProgramResourceiv;
        /*  510 */ PFNGLGETPROGRAMRESOURCELOCATIONPROC GetProgramResourceLocation;
        /*  511 */ PFNGLGETPROGRAMRESOURCELOCATIONINDEXPROC GetProgramResourceLocationIndex;
        /*  512 */ PFNGLSHADERSTORAGEBLOCKBINDINGPROC ShaderStorageBlockBinding;
        /*  513 */ PFNGLTEXBUFFERRANGEPROC TexBufferRange;
        /*  514 */ PFNGLTEXSTORAGE2DMULTISAMPLEPROC TexStorage2DMultisample;
        /*  515 */ PFNGLTEXSTORAGE3DMULTISAMPLEPROC TexStorage3DMultisample;
        /*  516 */ PFNGLTEXTUREVIEWPROC TextureView;
        /*  517 */ PFNGLBINDVERTEXBUFFERPROC BindVertexBuffer;
        /*  518 */ PFNGLVERTEXATTRIBFORMATPROC VertexAttribFormat;
        /*  519 */ PFNGLVERTEXATTRIBIFORMATPROC VertexAttribIFormat;
        /*  520 */ PFNGLVERTEXATTRIBLFORMATPROC VertexAttribLFormat;
        /*  521 */ PFNGLVERTEXATTRIBBINDINGPROC VertexAttribBinding;
        /*  522 */ PFNGLVERTEXBINDINGDIVISORPROC VertexBindingDivisor;
        /*  523 */ PFNGLDEBUGMESSAGECONTROLPROC DebugMessageControl;
        /*  524 */ PFNGLDEBUGMESSAGEINSERTPROC DebugMessageInsert;
        /*  525 */ PFNGLDEBUGMESSAGECALLBACKPROC DebugMessageCallback;
        /*  526 */ PFNGLGETDEBUGMESSAGELOGPROC GetDebugMessageLog;
        /*  527 */ PFNGLPUSHDEBUGGROUPPROC PushDebugGroup;
        /*  528 */ PFNGLPOPDEBUGGROUPPROC PopDebugGroup;
        /*  529 */ PFNGLOBJECTLABELPROC ObjectLabel;
        /*  530 */ PFNGLGETOBJECTLABELPROC GetObjectLabel;
        /*  531 */ PFNGLOBJECTPTRLABELPROC ObjectPtrLabel;
        /*  532 */ PFNGLGETOBJECTPTRLABELPROC GetObjectPtrLabel;
        /*  533 */ PFNGLBUFFERSTORAGEPROC BufferStorage;
        /*  534 */ PFNGLCLEARTEXIMAGEPROC ClearTexImage;
        /*  535 */ PFNGLCLEARTEXSUBIMAGEPROC ClearTexSubImage;
        /*  536 */ PFNGLBINDBUFFERSBASEPROC BindBuffersBase;
        /*  537 */ PFNGLBINDBUFFERSRANGEPROC BindBuffersRange;
        /*  538 */ PFNGLBINDTEXTURESPROC BindTextures;
        /*  539 */ PFNGLBINDSAMPLERSPROC BindSamplers;
        /*  540 */ PFNGLBINDIMAGETEXTURESPROC BindImageTextures;
        /*  541 */ PFNGLBINDVERTEXBUFFERSPROC BindVertexBuffers;
        /*  542 */ PFNGLCLIPCONTROLPROC ClipControl;
        /*  543 */ PFNGLCREATETRANSFORMFEEDBACKSPROC CreateTransformFeedbacks;
        /*  544 */ PFNGLTRANSFORMFEEDBACKBUFFERBASEPROC TransformFeedbackBufferBase;
        /*  545 */ PFNGLTRANSFORMFEEDBACKBUFFERRANGEPROC TransformFeedbackBufferRange;
        /*  546 */ PFNGLGETTRANSFORMFEEDBACKIVPROC GetTransformFeedbackiv;
        /*  547 */ PFNGLGETTRANSFORMFEEDBACKI_VPROC GetTransformFeedbacki_v;
        /*  548 */ PFNGLGETTRANSFORMFEEDBACKI64_VPROC GetTransformFeedbacki64_v;
        /*  549 */ PFNGLCREATEBUFFERSPROC CreateBuffers;
        /*  550 */ PFNGLNAMEDBUFFERSTORAGEPROC NamedBufferStorage;
        /*  551 */ PFNGLNAMEDBUFFERDATAPROC NamedBufferData;
        /*  552 */ PFNGLNAMEDBUFFERSUBDATAPROC NamedBufferSubData;
        /*  553 */ PFNGLCOPYNAMEDBUFFERSUBDATAPROC CopyNamedBufferSubData;
        /*  554 */ PFNGLCLEARNAMEDBUFFERDATAPROC ClearNamedBufferData;
        /*  555 */ PFNGLCLEARNAMEDBUFFERSUBDATAPROC ClearNamedBufferSubData;
        /*  556 */ PFNGLMAPNAMEDBUFFERPROC MapNamedBuffer;
        /*  557 */ PFNGLMAPNAMEDBUFFERRANGEPROC MapNamedBufferRange;
        /*  558 */ PFNGLUNMAPNAMEDBUFFERPROC UnmapNamedBuffer;
        /*  559 */ PFNGLFLUSHMAPPEDNAMEDBUFFERRANGEPROC FlushMappedNamedBufferRange;
        /*  560 */ PFNGLGETNAMEDBUFFERPARAMETERIVPROC GetNamedBufferParameteriv;
        /*  561 */ PFNGLGETNAMEDBUFFERPARAMETERI64VPROC GetNamedBufferParameteri64v;
        /*  562 */ PFNGLGETNAMEDBUFFERPOINTERVPROC GetNamedBufferPointerv;
        /*  563 */ PFNGLGETNAMEDBUFFERSUBDATAPROC GetNamedBufferSubData;
        /*  564 */ PFNGLCREATEFRAMEBUFFERSPROC CreateFramebuffers;
        /*  565 */ PFNGLNAMEDFRAMEBUFFERRENDERBUFFERPROC NamedFramebufferRenderbuffer;
        /*  566 */ PFNGLNAMEDFRAMEBUFFERPARAMETERIPROC NamedFramebufferParameteri;
        /*  567 */ PFNGLNAMEDFRAMEBUFFERTEXTUREPROC NamedFramebufferTexture;
        /*  568 */ PFNGLNAMEDFRAMEBUFFERTEXTURELAYERPROC NamedFramebufferTextureLayer;
        /*  569 */ PFNGLNAMEDFRAMEBUFFERDRAWBUFFERPROC NamedFramebufferDrawBuffer;
        /*  570 */ PFNGLNAMEDFRAMEBUFFERDRAWBUFFERSPROC NamedFramebufferDrawBuffers;
        /*  571 */ PFNGLNAMEDFRAMEBUFFERREADBUFFERPROC NamedFramebufferReadBuffer;
        /*  572 */ PFNGLINVALIDATENAMEDFRAMEBUFFERDATAPROC InvalidateNamedFramebufferData;
        /*  573 */ PFNGLINVALIDATENAMEDFRAMEBUFFERSUBDATAPROC InvalidateNamedFramebufferSubData;
        /*  574 */ PFNGLCLEARNAMEDFRAMEBUFFERIVPROC ClearNamedFramebufferiv;
        /*  575 */ PFNGLCLEARNAMEDFRAMEBUFFERUIVPROC ClearNamedFramebufferuiv;
        /*  576 */ PFNGLCLEARNAMEDFRAMEBUFFERFVPROC ClearNamedFramebufferfv;
        /*  577 */ PFNGLCLEARNAMEDFRAMEBUFFERFIPROC ClearNamedFramebufferfi;
        /*  578 */ PFNGLBLITNAMEDFRAMEBUFFERPROC BlitNamedFramebuffer;
        /*  579 */ PFNGLCHECKNAMEDFRAMEBUFFERSTATUSPROC CheckNamedFramebufferStatus;
        /*  580 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERIVPROC GetNamedFramebufferParameteriv;
        /*  581 */ PFNGLGETNAMEDFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetNamedFramebufferAttachmentParameteriv;
        /*  582 */ PFNGLCREATERENDERBUFFERSPROC CreateRenderbuffers;
        /*  583 */ PFNGLNAMEDRENDERBUFFERSTORAGEPROC NamedRenderbufferStorage;
        /*  584 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEPROC NamedRenderbufferStorageMultisample;
        /*  585 */ PFNGLGETNAMEDRENDERBUFFERPARAMETERIVPROC GetNamedRenderbufferParameteriv;
        /*  586 */ PFNGLCREATETEXTURESPROC CreateTextures;
        /*  587 */ PFNGLTEXTUREBUFFERPROC TextureBuffer;
        /*  588 */ PFNGLTEXTUREBUFFERRANGEPROC TextureBufferRange;
        /*  589 */ PFNGLTEXTURESTORAGE1DPROC TextureStorage1D;
        /*  590 */ PFNGLTEXTURESTORAGE2DPROC TextureStorage2D;
        /*  591 */ PFNGLTEXTURESTORAGE3DPROC TextureStorage3D;
        /*  592 */ PFNGLTEXTURESTORAGE2DMULTISAMPLEPROC TextureStorage2DMultisample;
        /*  593 */ PFNGLTEXTURESTORAGE3DMULTISAMPLEPROC TextureStorage3DMultisample;
        /*  594 */ PFNGLTEXTURESUBIMAGE1DPROC TextureSubImage1D;
        /*  595 */ PFNGLTEXTURESUBIMAGE2DPROC TextureSubImage2D;
        /*  596 */ PFNGLTEXTURESUBIMAGE3DPROC TextureSubImage3D;
        /*  597 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE1DPROC CompressedTextureSubImage1D;
        /*  598 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE2DPROC CompressedTextureSubImage2D;
        /*  599 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE3DPROC CompressedTextureSubImage3D;
        /*  600 */ PFNGLCOPYTEXTURESUBIMAGE1DPROC CopyTextureSubImage1D;
        /*  601 */ PFNGLCOPYTEXTURESUBIMAGE2DPROC CopyTextureSubImage2D;
        /*  602 */ PFNGLCOPYTEXTURESUBIMAGE3DPROC CopyTextureSubImage3D;
        /*  603 */ PFNGLTEXTUREPARAMETERFPROC TextureParameterf;
        /*  604 */ PFNGLTEXTUREPARAMETERFVPROC TextureParameterfv;
        /*  605 */ PFNGLTEXTUREPARAMETERIPROC TextureParameteri;
        /*  606 */ PFNGLTEXTUREPARAMETERIIVPROC TextureParameterIiv;
        /*  607 */ PFNGLTEXTUREPARAMETERIUIVPROC TextureParameterIuiv;
        /*  608 */ PFNGLTEXTUREPARAMETERIVPROC TextureParameteriv;
        /*  609 */ PFNGLGENERATETEXTUREMIPMAPPROC GenerateTextureMipmap;
        /*  610 */ PFNGLBINDTEXTUREUNITPROC BindTextureUnit;
        /*  611 */ PFNGLGETTEXTUREIMAGEPROC GetTextureImage;
        /*  612 */ PFNGLGETCOMPRESSEDTEXTUREIMAGEPROC GetCompressedTextureImage;
        /*  613 */ PFNGLGETTEXTURELEVELPARAMETERFVPROC GetTextureLevelParameterfv;
        /*  614 */ PFNGLGETTEXTURELEVELPARAMETERIVPROC GetTextureLevelParameteriv;
        /*  615 */ PFNGLGETTEXTUREPARAMETERFVPROC GetTextureParameterfv;
        /*  616 */ PFNGLGETTEXTUREPARAMETERIIVPROC GetTextureParameterIiv;
        /*  617 */ PFNGLGETTEXTUREPARAMETERIUIVPROC GetTextureParameterIuiv;
        /*  618 */ PFNGLGETTEXTUREPARAMETERIVPROC GetTextureParameteriv;
        /*  619 */ PFNGLCREATEVERTEXARRAYSPROC CreateVertexArrays;
        /*  620 */ PFNGLDISABLEVERTEXARRAYATTRIBPROC DisableVertexArrayAttrib;
        /*  621 */ PFNGLENABLEVERTEXARRAYATTRIBPROC EnableVertexArrayAttrib;
        /*  622 */ PFNGLVERTEXARRAYELEMENTBUFFERPROC VertexArrayElementBuffer;
        /*  623 */ PFNGLVERTEXARRAYVERTEXBUFFERPROC VertexArrayVertexBuffer;
        /*  624 */ PFNGLVERTEXARRAYVERTEXBUFFERSPROC VertexArrayVertexBuffers;
        /*  625 */ PFNGLVERTEXARRAYATTRIBBINDINGPROC VertexArrayAttribBinding;
        /*  626 */ PFNGLVERTEXARRAYATTRIBFORMATPROC VertexArrayAttribFormat;
        /*  627 */ PFNGLVERTEXARRAYATTRIBIFORMATPROC VertexArrayAttribIFormat;
        /*  628 */ PFNGLVERTEXARRAYATTRIBLFORMATPROC VertexArrayAttribLFormat;
        /*  629 */ PFNGLVERTEXARRAYBINDINGDIVISORPROC VertexArrayBindingDivisor;
        /*  630 */ PFNGLGETVERTEXARRAYIVPROC GetVertexArrayiv;
        /*  631 */ PFNGLGETVERTEXARRAYINDEXEDIVPROC GetVertexArrayIndexediv;
        /*  632 */ PFNGLGETVERTEXARRAYINDEXED64IVPROC GetVertexArrayIndexed64iv;
        /*  633 */ PFNGLCREATESAMPLERSPROC CreateSamplers;
        /*  634 */ PFNGLCREATEPROGRAMPIPELINESPROC CreateProgramPipelines;
        /*  635 */ PFNGLCREATEQUERIESPROC CreateQueries;
        /*  636 */ PFNGLGETQUERYBUFFEROBJECTI64VPROC GetQueryBufferObjecti64v;
        /*  637 */ PFNGLGETQUERYBUFFEROBJECTIVPROC GetQueryBufferObjectiv;
        /*  638 */ PFNGLGETQUERYBUFFEROBJECTUI64VPROC GetQueryBufferObjectui64v;
        /*  639 */ PFNGLGETQUERYBUFFEROBJECTUIVPROC GetQueryBufferObjectuiv;
        /*  640 */ PFNGLMEMORYBARRIERBYREGIONPROC MemoryBarrierByRegion;
        /*  641 */ PFNGLGETTEXTURESUBIMAGEPROC GetTextureSubImage;
        /*  642 */ PFNGLGETCOMPRESSEDTEXTURESUBIMAGEPROC GetCompressedTextureSubImage;
        /*  643 */ PFNGLGETGRAPHICSRESETSTATUSPROC GetGraphicsResetStatus;
        /*  644 */ PFNGLGETNCOMPRESSEDTEXIMAGEPROC GetnCompressedTexImage;
        /*  645 */ PFNGLGETNTEXIMAGEPROC GetnTexImage;
        /*  646 */ PFNGLGETNUNIFORMDVPROC GetnUniformdv;
        /*  647 */ PFNGLGETNUNIFORMFVPROC GetnUniformfv;
        /*  648 */ PFNGLGETNUNIFORMIVPROC GetnUniformiv;
        /*  649 */ PFNGLGETNUNIFORMUIVPROC GetnUniformuiv;
        /*  650 */ PFNGLREADNPIXELSPROC ReadnPixels;
        /*  651 */ PFNGLTEXTUREBARRIERPROC TextureBarrier;
        /*  652 */ PFNGLSPECIALIZESHADERPROC SpecializeShader;
        /*  653 */ PFNGLMULTIDRAWARRAYSINDIRECTCOUNTPROC MultiDrawArraysIndirectCount;
        /*  654 */ PFNGLMULTIDRAWELEMENTSINDIRECTCOUNTPROC MultiDrawElementsIndirectCount;
        /*  655 */ PFNGLPOLYGONOFFSETCLAMPPROC PolygonOffsetClamp;
        /*  656 */ PFNGLBLENDBARRIERPROC BlendBarrier;
        /*  657 */ PFNGLPRIMITIVEBOUNDINGBOXPROC PrimitiveBoundingBox;
        /*  658 */ PFNGLTBUFFERMASK3DFXPROC TbufferMask3DFX;
        /*  659 */ PFNGLDEBUGMESSAGEENABLEAMDPROC DebugMessageEnableAMD;
        /*  660 */ PFNGLDEBUGMESSAGEINSERTAMDPROC DebugMessageInsertAMD;
        /*  661 */ PFNGLDEBUGMESSAGECALLBACKAMDPROC DebugMessageCallbackAMD;
        /*  662 */ PFNGLGETDEBUGMESSAGELOGAMDPROC GetDebugMessageLogAMD;
        /*  663 */ PFNGLBLENDFUNCINDEXEDAMDPROC BlendFuncIndexedAMD;
        /*  664 */ PFNGLBLENDFUNCSEPARATEINDEXEDAMDPROC BlendFuncSeparateIndexedAMD;
        /*  665 */ PFNGLBLENDEQUATIONINDEXEDAMDPROC BlendEquationIndexedAMD;
        /*  666 */ PFNGLBLENDEQUATIONSEPARATEINDEXEDAMDPROC BlendEquationSeparateIndexedAMD;
        /*  667 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEADVANCEDAMDPROC RenderbufferStorageMultisampleAdvancedAMD;
        /*  668 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEADVANCEDAMDPROC NamedRenderbufferStorageMultisampleAdvancedAMD;
        /*  669 */ PFNGLFRAMEBUFFERSAMPLEPOSITIONSFVAMDPROC FramebufferSamplePositionsfvAMD;
        /*  670 */ PFNGLNAMEDFRAMEBUFFERSAMPLEPOSITIONSFVAMDPROC NamedFramebufferSamplePositionsfvAMD;
        /*  671 */ PFNGLGETFRAMEBUFFERPARAMETERFVAMDPROC GetFramebufferParameterfvAMD;
        /*  672 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERFVAMDPROC GetNamedFramebufferParameterfvAMD;
        /*  673 */ PFNGLUNIFORM1I64NVPROC Uniform1i64NV;
        /*  674 */ PFNGLUNIFORM2I64NVPROC Uniform2i64NV;
        /*  675 */ PFNGLUNIFORM3I64NVPROC Uniform3i64NV;
        /*  676 */ PFNGLUNIFORM4I64NVPROC Uniform4i64NV;
        /*  677 */ PFNGLUNIFORM1I64VNVPROC Uniform1i64vNV;
        /*  678 */ PFNGLUNIFORM2I64VNVPROC Uniform2i64vNV;
        /*  679 */ PFNGLUNIFORM3I64VNVPROC Uniform3i64vNV;
        /*  680 */ PFNGLUNIFORM4I64VNVPROC Uniform4i64vNV;
        /*  681 */ PFNGLUNIFORM1UI64NVPROC Uniform1ui64NV;
        /*  682 */ PFNGLUNIFORM2UI64NVPROC Uniform2ui64NV;
        /*  683 */ PFNGLUNIFORM3UI64NVPROC Uniform3ui64NV;
        /*  684 */ PFNGLUNIFORM4UI64NVPROC Uniform4ui64NV;
        /*  685 */ PFNGLUNIFORM1UI64VNVPROC Uniform1ui64vNV;
        /*  686 */ PFNGLUNIFORM2UI64VNVPROC Uniform2ui64vNV;
        /*  687 */ PFNGLUNIFORM3UI64VNVPROC Uniform3ui64vNV;
        /*  688 */ PFNGLUNIFORM4UI64VNVPROC Uniform4ui64vNV;
        /*  689 */ PFNGLGETUNIFORMI64VNVPROC GetUniformi64vNV;
        /*  690 */ PFNGLGETUNIFORMUI64VNVPROC GetUniformui64vNV;
        /*  691 */ PFNGLPROGRAMUNIFORM1I64NVPROC ProgramUniform1i64NV;
        /*  692 */ PFNGLPROGRAMUNIFORM2I64NVPROC ProgramUniform2i64NV;
        /*  693 */ PFNGLPROGRAMUNIFORM3I64NVPROC ProgramUniform3i64NV;
        /*  694 */ PFNGLPROGRAMUNIFORM4I64NVPROC ProgramUniform4i64NV;
        /*  695 */ PFNGLPROGRAMUNIFORM1I64VNVPROC ProgramUniform1i64vNV;
        /*  696 */ PFNGLPROGRAMUNIFORM2I64VNVPROC ProgramUniform2i64vNV;
        /*  697 */ PFNGLPROGRAMUNIFORM3I64VNVPROC ProgramUniform3i64vNV;
        /*  698 */ PFNGLPROGRAMUNIFORM4I64VNVPROC ProgramUniform4i64vNV;
        /*  699 */ PFNGLPROGRAMUNIFORM1UI64NVPROC ProgramUniform1ui64NV;
        /*  700 */ PFNGLPROGRAMUNIFORM2UI64NVPROC ProgramUniform2ui64NV;
        /*  701 */ PFNGLPROGRAMUNIFORM3UI64NVPROC ProgramUniform3ui64NV;
        /*  702 */ PFNGLPROGRAMUNIFORM4UI64NVPROC ProgramUniform4ui64NV;
        /*  703 */ PFNGLPROGRAMUNIFORM1UI64VNVPROC ProgramUniform1ui64vNV;
        /*  704 */ PFNGLPROGRAMUNIFORM2UI64VNVPROC ProgramUniform2ui64vNV;
        /*  705 */ PFNGLPROGRAMUNIFORM3UI64VNVPROC ProgramUniform3ui64vNV;
        /*  706 */ PFNGLPROGRAMUNIFORM4UI64VNVPROC ProgramUniform4ui64vNV;
        /*  707 */ PFNGLVERTEXATTRIBPARAMETERIAMDPROC VertexAttribParameteriAMD;
        /*  708 */ PFNGLMULTIDRAWARRAYSINDIRECTAMDPROC MultiDrawArraysIndirectAMD;
        /*  709 */ PFNGLMULTIDRAWELEMENTSINDIRECTAMDPROC MultiDrawElementsIndirectAMD;
        /*  710 */ PFNGLGENNAMESAMDPROC GenNamesAMD;
        /*  711 */ PFNGLDELETENAMESAMDPROC DeleteNamesAMD;
        /*  712 */ PFNGLISNAMEAMDPROC IsNameAMD;
        /*  713 */ PFNGLQUERYOBJECTPARAMETERUIAMDPROC QueryObjectParameteruiAMD;
        /*  714 */ PFNGLGETPERFMONITORGROUPSAMDPROC GetPerfMonitorGroupsAMD;
        /*  715 */ PFNGLGETPERFMONITORCOUNTERSAMDPROC GetPerfMonitorCountersAMD;
        /*  716 */ PFNGLGETPERFMONITORGROUPSTRINGAMDPROC GetPerfMonitorGroupStringAMD;
        /*  717 */ PFNGLGETPERFMONITORCOUNTERSTRINGAMDPROC GetPerfMonitorCounterStringAMD;
        /*  718 */ PFNGLGETPERFMONITORCOUNTERINFOAMDPROC GetPerfMonitorCounterInfoAMD;
        /*  719 */ PFNGLGENPERFMONITORSAMDPROC GenPerfMonitorsAMD;
        /*  720 */ PFNGLDELETEPERFMONITORSAMDPROC DeletePerfMonitorsAMD;
        /*  721 */ PFNGLSELECTPERFMONITORCOUNTERSAMDPROC SelectPerfMonitorCountersAMD;
        /*  722 */ PFNGLBEGINPERFMONITORAMDPROC BeginPerfMonitorAMD;
        /*  723 */ PFNGLENDPERFMONITORAMDPROC EndPerfMonitorAMD;
        /*  724 */ PFNGLGETPERFMONITORCOUNTERDATAAMDPROC GetPerfMonitorCounterDataAMD;
        /*  725 */ PFNGLSETMULTISAMPLEFVAMDPROC SetMultisamplefvAMD;
        /*  726 */ PFNGLTEXSTORAGESPARSEAMDPROC TexStorageSparseAMD;
        /*  727 */ PFNGLTEXTURESTORAGESPARSEAMDPROC TextureStorageSparseAMD;
        /*  728 */ PFNGLSTENCILOPVALUEAMDPROC StencilOpValueAMD;
        /*  729 */ PFNGLTESSELLATIONFACTORAMDPROC TessellationFactorAMD;
        /*  730 */ PFNGLTESSELLATIONMODEAMDPROC TessellationModeAMD;
        /*  731 */ PFNGLBLITFRAMEBUFFERANGLEPROC BlitFramebufferANGLE;
        /*  732 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEANGLEPROC RenderbufferStorageMultisampleANGLE;
        /*  733 */ PFNGLDRAWARRAYSINSTANCEDANGLEPROC DrawArraysInstancedANGLE;
        /*  734 */ PFNGLDRAWELEMENTSINSTANCEDANGLEPROC DrawElementsInstancedANGLE;
        /*  735 */ PFNGLVERTEXATTRIBDIVISORANGLEPROC VertexAttribDivisorANGLE;
        /*  736 */ PFNGLGETTRANSLATEDSHADERSOURCEANGLEPROC GetTranslatedShaderSourceANGLE;
        /*  737 */ PFNGLCOPYTEXTURELEVELSAPPLEPROC CopyTextureLevelsAPPLE;
        /*  738 */ PFNGLELEMENTPOINTERAPPLEPROC ElementPointerAPPLE;
        /*  739 */ PFNGLDRAWELEMENTARRAYAPPLEPROC DrawElementArrayAPPLE;
        /*  740 */ PFNGLDRAWRANGEELEMENTARRAYAPPLEPROC DrawRangeElementArrayAPPLE;
        /*  741 */ PFNGLMULTIDRAWELEMENTARRAYAPPLEPROC MultiDrawElementArrayAPPLE;
        /*  742 */ PFNGLMULTIDRAWRANGEELEMENTARRAYAPPLEPROC MultiDrawRangeElementArrayAPPLE;
        /*  743 */ PFNGLGENFENCESAPPLEPROC GenFencesAPPLE;
        /*  744 */ PFNGLDELETEFENCESAPPLEPROC DeleteFencesAPPLE;
        /*  745 */ PFNGLSETFENCEAPPLEPROC SetFenceAPPLE;
        /*  746 */ PFNGLISFENCEAPPLEPROC IsFenceAPPLE;
        /*  747 */ PFNGLTESTFENCEAPPLEPROC TestFenceAPPLE;
        /*  748 */ PFNGLFINISHFENCEAPPLEPROC FinishFenceAPPLE;
        /*  749 */ PFNGLTESTOBJECTAPPLEPROC TestObjectAPPLE;
        /*  750 */ PFNGLFINISHOBJECTAPPLEPROC FinishObjectAPPLE;
        /*  751 */ PFNGLBUFFERPARAMETERIAPPLEPROC BufferParameteriAPPLE;
        /*  752 */ PFNGLFLUSHMAPPEDBUFFERRANGEAPPLEPROC FlushMappedBufferRangeAPPLE;
        /*  753 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEAPPLEPROC RenderbufferStorageMultisampleAPPLE;
        /*  754 */ PFNGLRESOLVEMULTISAMPLEFRAMEBUFFERAPPLEPROC ResolveMultisampleFramebufferAPPLE;
        /*  755 */ PFNGLOBJECTPURGEABLEAPPLEPROC ObjectPurgeableAPPLE;
        /*  756 */ PFNGLOBJECTUNPURGEABLEAPPLEPROC ObjectUnpurgeableAPPLE;
        /*  757 */ PFNGLGETOBJECTPARAMETERIVAPPLEPROC GetObjectParameterivAPPLE;
        /*  758 */ PFNGLFENCESYNCAPPLEPROC FenceSyncAPPLE;
        /*  759 */ PFNGLISSYNCAPPLEPROC IsSyncAPPLE;
        /*  760 */ PFNGLDELETESYNCAPPLEPROC DeleteSyncAPPLE;
        /*  761 */ PFNGLCLIENTWAITSYNCAPPLEPROC ClientWaitSyncAPPLE;
        /*  762 */ PFNGLWAITSYNCAPPLEPROC WaitSyncAPPLE;
        /*  763 */ PFNGLGETINTEGER64VAPPLEPROC GetInteger64vAPPLE;
        /*  764 */ PFNGLGETSYNCIVAPPLEPROC GetSyncivAPPLE;
        /*  765 */ PFNGLTEXTURERANGEAPPLEPROC TextureRangeAPPLE;
        /*  766 */ PFNGLGETTEXPARAMETERPOINTERVAPPLEPROC GetTexParameterPointervAPPLE;
        /*  767 */ PFNGLBINDVERTEXARRAYAPPLEPROC BindVertexArrayAPPLE;
        /*  768 */ PFNGLDELETEVERTEXARRAYSAPPLEPROC DeleteVertexArraysAPPLE;
        /*  769 */ PFNGLGENVERTEXARRAYSAPPLEPROC GenVertexArraysAPPLE;
        /*  770 */ PFNGLISVERTEXARRAYAPPLEPROC IsVertexArrayAPPLE;
        /*  771 */ PFNGLVERTEXARRAYRANGEAPPLEPROC VertexArrayRangeAPPLE;
        /*  772 */ PFNGLFLUSHVERTEXARRAYRANGEAPPLEPROC FlushVertexArrayRangeAPPLE;
        /*  773 */ PFNGLVERTEXARRAYPARAMETERIAPPLEPROC VertexArrayParameteriAPPLE;
        /*  774 */ PFNGLENABLEVERTEXATTRIBAPPLEPROC EnableVertexAttribAPPLE;
        /*  775 */ PFNGLDISABLEVERTEXATTRIBAPPLEPROC DisableVertexAttribAPPLE;
        /*  776 */ PFNGLISVERTEXATTRIBENABLEDAPPLEPROC IsVertexAttribEnabledAPPLE;
        /*  777 */ PFNGLMAPVERTEXATTRIB1DAPPLEPROC MapVertexAttrib1dAPPLE;
        /*  778 */ PFNGLMAPVERTEXATTRIB1FAPPLEPROC MapVertexAttrib1fAPPLE;
        /*  779 */ PFNGLMAPVERTEXATTRIB2DAPPLEPROC MapVertexAttrib2dAPPLE;
        /*  780 */ PFNGLMAPVERTEXATTRIB2FAPPLEPROC MapVertexAttrib2fAPPLE;
        /*  781 */ PFNGLPRIMITIVEBOUNDINGBOXARBPROC PrimitiveBoundingBoxARB;
        /*  782 */ PFNGLGETTEXTUREHANDLEARBPROC GetTextureHandleARB;
        /*  783 */ PFNGLGETTEXTURESAMPLERHANDLEARBPROC GetTextureSamplerHandleARB;
        /*  784 */ PFNGLMAKETEXTUREHANDLERESIDENTARBPROC MakeTextureHandleResidentARB;
        /*  785 */ PFNGLMAKETEXTUREHANDLENONRESIDENTARBPROC MakeTextureHandleNonResidentARB;
        /*  786 */ PFNGLGETIMAGEHANDLEARBPROC GetImageHandleARB;
        /*  787 */ PFNGLMAKEIMAGEHANDLERESIDENTARBPROC MakeImageHandleResidentARB;
        /*  788 */ PFNGLMAKEIMAGEHANDLENONRESIDENTARBPROC MakeImageHandleNonResidentARB;
        /*  789 */ PFNGLUNIFORMHANDLEUI64ARBPROC UniformHandleui64ARB;
        /*  790 */ PFNGLUNIFORMHANDLEUI64VARBPROC UniformHandleui64vARB;
        /*  791 */ PFNGLPROGRAMUNIFORMHANDLEUI64ARBPROC ProgramUniformHandleui64ARB;
        /*  792 */ PFNGLPROGRAMUNIFORMHANDLEUI64VARBPROC ProgramUniformHandleui64vARB;
        /*  793 */ PFNGLISTEXTUREHANDLERESIDENTARBPROC IsTextureHandleResidentARB;
        /*  794 */ PFNGLISIMAGEHANDLERESIDENTARBPROC IsImageHandleResidentARB;
        /*  795 */ PFNGLVERTEXATTRIBL1UI64ARBPROC VertexAttribL1ui64ARB;
        /*  796 */ PFNGLVERTEXATTRIBL1UI64VARBPROC VertexAttribL1ui64vARB;
        /*  797 */ PFNGLGETVERTEXATTRIBLUI64VARBPROC GetVertexAttribLui64vARB;
        /*  798 */ PFNGLCREATESYNCFROMCLEVENTARBPROC CreateSyncFromCLeventARB;
        /*  799 */ PFNGLCLAMPCOLORARBPROC ClampColorARB;
        /*  800 */ PFNGLDISPATCHCOMPUTEGROUPSIZEARBPROC DispatchComputeGroupSizeARB;
        /*  801 */ PFNGLDEBUGMESSAGECONTROLARBPROC DebugMessageControlARB;
        /*  802 */ PFNGLDEBUGMESSAGEINSERTARBPROC DebugMessageInsertARB;
        /*  803 */ PFNGLDEBUGMESSAGECALLBACKARBPROC DebugMessageCallbackARB;
        /*  804 */ PFNGLGETDEBUGMESSAGELOGARBPROC GetDebugMessageLogARB;
        /*  805 */ PFNGLDRAWBUFFERSARBPROC DrawBuffersARB;
        /*  806 */ PFNGLBLENDEQUATIONIARBPROC BlendEquationiARB;
        /*  807 */ PFNGLBLENDEQUATIONSEPARATEIARBPROC BlendEquationSeparateiARB;
        /*  808 */ PFNGLBLENDFUNCIARBPROC BlendFunciARB;
        /*  809 */ PFNGLBLENDFUNCSEPARATEIARBPROC BlendFuncSeparateiARB;
        /*  810 */ PFNGLDRAWARRAYSINSTANCEDARBPROC DrawArraysInstancedARB;
        /*  811 */ PFNGLDRAWELEMENTSINSTANCEDARBPROC DrawElementsInstancedARB;
        /*  812 */ PFNGLPROGRAMSTRINGARBPROC ProgramStringARB;
        /*  813 */ PFNGLBINDPROGRAMARBPROC BindProgramARB;
        /*  814 */ PFNGLDELETEPROGRAMSARBPROC DeleteProgramsARB;
        /*  815 */ PFNGLGENPROGRAMSARBPROC GenProgramsARB;
        /*  816 */ PFNGLPROGRAMENVPARAMETER4DARBPROC ProgramEnvParameter4dARB;
        /*  817 */ PFNGLPROGRAMENVPARAMETER4DVARBPROC ProgramEnvParameter4dvARB;
        /*  818 */ PFNGLPROGRAMENVPARAMETER4FARBPROC ProgramEnvParameter4fARB;
        /*  819 */ PFNGLPROGRAMENVPARAMETER4FVARBPROC ProgramEnvParameter4fvARB;
        /*  820 */ PFNGLPROGRAMLOCALPARAMETER4DARBPROC ProgramLocalParameter4dARB;
        /*  821 */ PFNGLPROGRAMLOCALPARAMETER4DVARBPROC ProgramLocalParameter4dvARB;
        /*  822 */ PFNGLPROGRAMLOCALPARAMETER4FARBPROC ProgramLocalParameter4fARB;
        /*  823 */ PFNGLPROGRAMLOCALPARAMETER4FVARBPROC ProgramLocalParameter4fvARB;
        /*  824 */ PFNGLGETPROGRAMENVPARAMETERDVARBPROC GetProgramEnvParameterdvARB;
        /*  825 */ PFNGLGETPROGRAMENVPARAMETERFVARBPROC GetProgramEnvParameterfvARB;
        /*  826 */ PFNGLGETPROGRAMLOCALPARAMETERDVARBPROC GetProgramLocalParameterdvARB;
        /*  827 */ PFNGLGETPROGRAMLOCALPARAMETERFVARBPROC GetProgramLocalParameterfvARB;
        /*  828 */ PFNGLGETPROGRAMIVARBPROC GetProgramivARB;
        /*  829 */ PFNGLGETPROGRAMSTRINGARBPROC GetProgramStringARB;
        /*  830 */ PFNGLISPROGRAMARBPROC IsProgramARB;
        /*  831 */ PFNGLPROGRAMPARAMETERIARBPROC ProgramParameteriARB;
        /*  832 */ PFNGLFRAMEBUFFERTEXTUREARBPROC FramebufferTextureARB;
        /*  833 */ PFNGLFRAMEBUFFERTEXTURELAYERARBPROC FramebufferTextureLayerARB;
        /*  834 */ PFNGLFRAMEBUFFERTEXTUREFACEARBPROC FramebufferTextureFaceARB;
        /*  835 */ PFNGLSPECIALIZESHADERARBPROC SpecializeShaderARB;
        /*  836 */ PFNGLUNIFORM1I64ARBPROC Uniform1i64ARB;
        /*  837 */ PFNGLUNIFORM2I64ARBPROC Uniform2i64ARB;
        /*  838 */ PFNGLUNIFORM3I64ARBPROC Uniform3i64ARB;
        /*  839 */ PFNGLUNIFORM4I64ARBPROC Uniform4i64ARB;
        /*  840 */ PFNGLUNIFORM1I64VARBPROC Uniform1i64vARB;
        /*  841 */ PFNGLUNIFORM2I64VARBPROC Uniform2i64vARB;
        /*  842 */ PFNGLUNIFORM3I64VARBPROC Uniform3i64vARB;
        /*  843 */ PFNGLUNIFORM4I64VARBPROC Uniform4i64vARB;
        /*  844 */ PFNGLUNIFORM1UI64ARBPROC Uniform1ui64ARB;
        /*  845 */ PFNGLUNIFORM2UI64ARBPROC Uniform2ui64ARB;
        /*  846 */ PFNGLUNIFORM3UI64ARBPROC Uniform3ui64ARB;
        /*  847 */ PFNGLUNIFORM4UI64ARBPROC Uniform4ui64ARB;
        /*  848 */ PFNGLUNIFORM1UI64VARBPROC Uniform1ui64vARB;
        /*  849 */ PFNGLUNIFORM2UI64VARBPROC Uniform2ui64vARB;
        /*  850 */ PFNGLUNIFORM3UI64VARBPROC Uniform3ui64vARB;
        /*  851 */ PFNGLUNIFORM4UI64VARBPROC Uniform4ui64vARB;
        /*  852 */ PFNGLGETUNIFORMI64VARBPROC GetUniformi64vARB;
        /*  853 */ PFNGLGETUNIFORMUI64VARBPROC GetUniformui64vARB;
        /*  854 */ PFNGLGETNUNIFORMI64VARBPROC GetnUniformi64vARB;
        /*  855 */ PFNGLGETNUNIFORMUI64VARBPROC GetnUniformui64vARB;
        /*  856 */ PFNGLPROGRAMUNIFORM1I64ARBPROC ProgramUniform1i64ARB;
        /*  857 */ PFNGLPROGRAMUNIFORM2I64ARBPROC ProgramUniform2i64ARB;
        /*  858 */ PFNGLPROGRAMUNIFORM3I64ARBPROC ProgramUniform3i64ARB;
        /*  859 */ PFNGLPROGRAMUNIFORM4I64ARBPROC ProgramUniform4i64ARB;
        /*  860 */ PFNGLPROGRAMUNIFORM1I64VARBPROC ProgramUniform1i64vARB;
        /*  861 */ PFNGLPROGRAMUNIFORM2I64VARBPROC ProgramUniform2i64vARB;
        /*  862 */ PFNGLPROGRAMUNIFORM3I64VARBPROC ProgramUniform3i64vARB;
        /*  863 */ PFNGLPROGRAMUNIFORM4I64VARBPROC ProgramUniform4i64vARB;
        /*  864 */ PFNGLPROGRAMUNIFORM1UI64ARBPROC ProgramUniform1ui64ARB;
        /*  865 */ PFNGLPROGRAMUNIFORM2UI64ARBPROC ProgramUniform2ui64ARB;
        /*  866 */ PFNGLPROGRAMUNIFORM3UI64ARBPROC ProgramUniform3ui64ARB;
        /*  867 */ PFNGLPROGRAMUNIFORM4UI64ARBPROC ProgramUniform4ui64ARB;
        /*  868 */ PFNGLPROGRAMUNIFORM1UI64VARBPROC ProgramUniform1ui64vARB;
        /*  869 */ PFNGLPROGRAMUNIFORM2UI64VARBPROC ProgramUniform2ui64vARB;
        /*  870 */ PFNGLPROGRAMUNIFORM3UI64VARBPROC ProgramUniform3ui64vARB;
        /*  871 */ PFNGLPROGRAMUNIFORM4UI64VARBPROC ProgramUniform4ui64vARB;
        /*  872 */ PFNGLCOLORTABLEPROC ColorTable;
        /*  873 */ PFNGLCOLORTABLEPARAMETERFVPROC ColorTableParameterfv;
        /*  874 */ PFNGLCOLORTABLEPARAMETERIVPROC ColorTableParameteriv;
        /*  875 */ PFNGLCOPYCOLORTABLEPROC CopyColorTable;
        /*  876 */ PFNGLGETCOLORTABLEPROC GetColorTable;
        /*  877 */ PFNGLGETCOLORTABLEPARAMETERFVPROC GetColorTableParameterfv;
        /*  878 */ PFNGLGETCOLORTABLEPARAMETERIVPROC GetColorTableParameteriv;
        /*  879 */ PFNGLCOLORSUBTABLEPROC ColorSubTable;
        /*  880 */ PFNGLCOPYCOLORSUBTABLEPROC CopyColorSubTable;
        /*  881 */ PFNGLCONVOLUTIONFILTER1DPROC ConvolutionFilter1D;
        /*  882 */ PFNGLCONVOLUTIONFILTER2DPROC ConvolutionFilter2D;
        /*  883 */ PFNGLCONVOLUTIONPARAMETERFPROC ConvolutionParameterf;
        /*  884 */ PFNGLCONVOLUTIONPARAMETERFVPROC ConvolutionParameterfv;
        /*  885 */ PFNGLCONVOLUTIONPARAMETERIPROC ConvolutionParameteri;
        /*  886 */ PFNGLCONVOLUTIONPARAMETERIVPROC ConvolutionParameteriv;
        /*  887 */ PFNGLCOPYCONVOLUTIONFILTER1DPROC CopyConvolutionFilter1D;
        /*  888 */ PFNGLCOPYCONVOLUTIONFILTER2DPROC CopyConvolutionFilter2D;
        /*  889 */ PFNGLGETCONVOLUTIONFILTERPROC GetConvolutionFilter;
        /*  890 */ PFNGLGETCONVOLUTIONPARAMETERFVPROC GetConvolutionParameterfv;
        /*  891 */ PFNGLGETCONVOLUTIONPARAMETERIVPROC GetConvolutionParameteriv;
        /*  892 */ PFNGLGETSEPARABLEFILTERPROC GetSeparableFilter;
        /*  893 */ PFNGLSEPARABLEFILTER2DPROC SeparableFilter2D;
        /*  894 */ PFNGLGETHISTOGRAMPROC GetHistogram;
        /*  895 */ PFNGLGETHISTOGRAMPARAMETERFVPROC GetHistogramParameterfv;
        /*  896 */ PFNGLGETHISTOGRAMPARAMETERIVPROC GetHistogramParameteriv;
        /*  897 */ PFNGLGETMINMAXPROC GetMinmax;
        /*  898 */ PFNGLGETMINMAXPARAMETERFVPROC GetMinmaxParameterfv;
        /*  899 */ PFNGLGETMINMAXPARAMETERIVPROC GetMinmaxParameteriv;
        /*  900 */ PFNGLHISTOGRAMPROC Histogram;
        /*  901 */ PFNGLMINMAXPROC Minmax;
        /*  902 */ PFNGLRESETHISTOGRAMPROC ResetHistogram;
        /*  903 */ PFNGLRESETMINMAXPROC ResetMinmax;
        /*  904 */ PFNGLMULTIDRAWARRAYSINDIRECTCOUNTARBPROC MultiDrawArraysIndirectCountARB;
        /*  905 */ PFNGLMULTIDRAWELEMENTSINDIRECTCOUNTARBPROC MultiDrawElementsIndirectCountARB;
        /*  906 */ PFNGLVERTEXATTRIBDIVISORARBPROC VertexAttribDivisorARB;
        /*  907 */ PFNGLCURRENTPALETTEMATRIXARBPROC CurrentPaletteMatrixARB;
        /*  908 */ PFNGLMATRIXINDEXUBVARBPROC MatrixIndexubvARB;
        /*  909 */ PFNGLMATRIXINDEXUSVARBPROC MatrixIndexusvARB;
        /*  910 */ PFNGLMATRIXINDEXUIVARBPROC MatrixIndexuivARB;
        /*  911 */ PFNGLMATRIXINDEXPOINTERARBPROC MatrixIndexPointerARB;
        /*  912 */ PFNGLSAMPLECOVERAGEARBPROC SampleCoverageARB;
        /*  913 */ PFNGLACTIVETEXTUREARBPROC ActiveTextureARB;
        /*  914 */ PFNGLCLIENTACTIVETEXTUREARBPROC ClientActiveTextureARB;
        /*  915 */ PFNGLMULTITEXCOORD1DARBPROC MultiTexCoord1dARB;
        /*  916 */ PFNGLMULTITEXCOORD1DVARBPROC MultiTexCoord1dvARB;
        /*  917 */ PFNGLMULTITEXCOORD1FARBPROC MultiTexCoord1fARB;
        /*  918 */ PFNGLMULTITEXCOORD1FVARBPROC MultiTexCoord1fvARB;
        /*  919 */ PFNGLMULTITEXCOORD1IARBPROC MultiTexCoord1iARB;
        /*  920 */ PFNGLMULTITEXCOORD1IVARBPROC MultiTexCoord1ivARB;
        /*  921 */ PFNGLMULTITEXCOORD1SARBPROC MultiTexCoord1sARB;
        /*  922 */ PFNGLMULTITEXCOORD1SVARBPROC MultiTexCoord1svARB;
        /*  923 */ PFNGLMULTITEXCOORD2DARBPROC MultiTexCoord2dARB;
        /*  924 */ PFNGLMULTITEXCOORD2DVARBPROC MultiTexCoord2dvARB;
        /*  925 */ PFNGLMULTITEXCOORD2FARBPROC MultiTexCoord2fARB;
        /*  926 */ PFNGLMULTITEXCOORD2FVARBPROC MultiTexCoord2fvARB;
        /*  927 */ PFNGLMULTITEXCOORD2IARBPROC MultiTexCoord2iARB;
        /*  928 */ PFNGLMULTITEXCOORD2IVARBPROC MultiTexCoord2ivARB;
        /*  929 */ PFNGLMULTITEXCOORD2SARBPROC MultiTexCoord2sARB;
        /*  930 */ PFNGLMULTITEXCOORD2SVARBPROC MultiTexCoord2svARB;
        /*  931 */ PFNGLMULTITEXCOORD3DARBPROC MultiTexCoord3dARB;
        /*  932 */ PFNGLMULTITEXCOORD3DVARBPROC MultiTexCoord3dvARB;
        /*  933 */ PFNGLMULTITEXCOORD3FARBPROC MultiTexCoord3fARB;
        /*  934 */ PFNGLMULTITEXCOORD3FVARBPROC MultiTexCoord3fvARB;
        /*  935 */ PFNGLMULTITEXCOORD3IARBPROC MultiTexCoord3iARB;
        /*  936 */ PFNGLMULTITEXCOORD3IVARBPROC MultiTexCoord3ivARB;
        /*  937 */ PFNGLMULTITEXCOORD3SARBPROC MultiTexCoord3sARB;
        /*  938 */ PFNGLMULTITEXCOORD3SVARBPROC MultiTexCoord3svARB;
        /*  939 */ PFNGLMULTITEXCOORD4DARBPROC MultiTexCoord4dARB;
        /*  940 */ PFNGLMULTITEXCOORD4DVARBPROC MultiTexCoord4dvARB;
        /*  941 */ PFNGLMULTITEXCOORD4FARBPROC MultiTexCoord4fARB;
        /*  942 */ PFNGLMULTITEXCOORD4FVARBPROC MultiTexCoord4fvARB;
        /*  943 */ PFNGLMULTITEXCOORD4IARBPROC MultiTexCoord4iARB;
        /*  944 */ PFNGLMULTITEXCOORD4IVARBPROC MultiTexCoord4ivARB;
        /*  945 */ PFNGLMULTITEXCOORD4SARBPROC MultiTexCoord4sARB;
        /*  946 */ PFNGLMULTITEXCOORD4SVARBPROC MultiTexCoord4svARB;
        /*  947 */ PFNGLGENQUERIESARBPROC GenQueriesARB;
        /*  948 */ PFNGLDELETEQUERIESARBPROC DeleteQueriesARB;
        /*  949 */ PFNGLISQUERYARBPROC IsQueryARB;
        /*  950 */ PFNGLBEGINQUERYARBPROC BeginQueryARB;
        /*  951 */ PFNGLENDQUERYARBPROC EndQueryARB;
        /*  952 */ PFNGLGETQUERYIVARBPROC GetQueryivARB;
        /*  953 */ PFNGLGETQUERYOBJECTIVARBPROC GetQueryObjectivARB;
        /*  954 */ PFNGLGETQUERYOBJECTUIVARBPROC GetQueryObjectuivARB;
        /*  955 */ PFNGLMAXSHADERCOMPILERTHREADSARBPROC MaxShaderCompilerThreadsARB;
        /*  956 */ PFNGLPOINTPARAMETERFARBPROC PointParameterfARB;
        /*  957 */ PFNGLPOINTPARAMETERFVARBPROC PointParameterfvARB;
        /*  958 */ PFNGLGETGRAPHICSRESETSTATUSARBPROC GetGraphicsResetStatusARB;
        /*  959 */ PFNGLGETNTEXIMAGEARBPROC GetnTexImageARB;
        /*  960 */ PFNGLREADNPIXELSARBPROC ReadnPixelsARB;
        /*  961 */ PFNGLGETNCOMPRESSEDTEXIMAGEARBPROC GetnCompressedTexImageARB;
        /*  962 */ PFNGLGETNUNIFORMFVARBPROC GetnUniformfvARB;
        /*  963 */ PFNGLGETNUNIFORMIVARBPROC GetnUniformivARB;
        /*  964 */ PFNGLGETNUNIFORMUIVARBPROC GetnUniformuivARB;
        /*  965 */ PFNGLGETNUNIFORMDVARBPROC GetnUniformdvARB;
        /*  966 */ PFNGLGETNMAPDVARBPROC GetnMapdvARB;
        /*  967 */ PFNGLGETNMAPFVARBPROC GetnMapfvARB;
        /*  968 */ PFNGLGETNMAPIVARBPROC GetnMapivARB;
        /*  969 */ PFNGLGETNPIXELMAPFVARBPROC GetnPixelMapfvARB;
        /*  970 */ PFNGLGETNPIXELMAPUIVARBPROC GetnPixelMapuivARB;
        /*  971 */ PFNGLGETNPIXELMAPUSVARBPROC GetnPixelMapusvARB;
        /*  972 */ PFNGLGETNPOLYGONSTIPPLEARBPROC GetnPolygonStippleARB;
        /*  973 */ PFNGLGETNCOLORTABLEARBPROC GetnColorTableARB;
        /*  974 */ PFNGLGETNCONVOLUTIONFILTERARBPROC GetnConvolutionFilterARB;
        /*  975 */ PFNGLGETNSEPARABLEFILTERARBPROC GetnSeparableFilterARB;
        /*  976 */ PFNGLGETNHISTOGRAMARBPROC GetnHistogramARB;
        /*  977 */ PFNGLGETNMINMAXARBPROC GetnMinmaxARB;
        /*  978 */ PFNGLFRAMEBUFFERSAMPLELOCATIONSFVARBPROC FramebufferSampleLocationsfvARB;
        /*  979 */ PFNGLNAMEDFRAMEBUFFERSAMPLELOCATIONSFVARBPROC NamedFramebufferSampleLocationsfvARB;
        /*  980 */ PFNGLEVALUATEDEPTHVALUESARBPROC EvaluateDepthValuesARB;
        /*  981 */ PFNGLMINSAMPLESHADINGARBPROC MinSampleShadingARB;
        /*  982 */ PFNGLDELETEOBJECTARBPROC DeleteObjectARB;
        /*  983 */ PFNGLGETHANDLEARBPROC GetHandleARB;
        /*  984 */ PFNGLDETACHOBJECTARBPROC DetachObjectARB;
        /*  985 */ PFNGLCREATESHADEROBJECTARBPROC CreateShaderObjectARB;
        /*  986 */ PFNGLSHADERSOURCEARBPROC ShaderSourceARB;
        /*  987 */ PFNGLCOMPILESHADERARBPROC CompileShaderARB;
        /*  988 */ PFNGLCREATEPROGRAMOBJECTARBPROC CreateProgramObjectARB;
        /*  989 */ PFNGLATTACHOBJECTARBPROC AttachObjectARB;
        /*  990 */ PFNGLLINKPROGRAMARBPROC LinkProgramARB;
        /*  991 */ PFNGLUSEPROGRAMOBJECTARBPROC UseProgramObjectARB;
        /*  992 */ PFNGLVALIDATEPROGRAMARBPROC ValidateProgramARB;
        /*  993 */ PFNGLUNIFORM1FARBPROC Uniform1fARB;
        /*  994 */ PFNGLUNIFORM2FARBPROC Uniform2fARB;
        /*  995 */ PFNGLUNIFORM3FARBPROC Uniform3fARB;
        /*  996 */ PFNGLUNIFORM4FARBPROC Uniform4fARB;
        /*  997 */ PFNGLUNIFORM1IARBPROC Uniform1iARB;
        /*  998 */ PFNGLUNIFORM2IARBPROC Uniform2iARB;
        /*  999 */ PFNGLUNIFORM3IARBPROC Uniform3iARB;
        /* 1000 */ PFNGLUNIFORM4IARBPROC Uniform4iARB;
        /* 1001 */ PFNGLUNIFORM1FVARBPROC Uniform1fvARB;
        /* 1002 */ PFNGLUNIFORM2FVARBPROC Uniform2fvARB;
        /* 1003 */ PFNGLUNIFORM3FVARBPROC Uniform3fvARB;
        /* 1004 */ PFNGLUNIFORM4FVARBPROC Uniform4fvARB;
        /* 1005 */ PFNGLUNIFORM1IVARBPROC Uniform1ivARB;
        /* 1006 */ PFNGLUNIFORM2IVARBPROC Uniform2ivARB;
        /* 1007 */ PFNGLUNIFORM3IVARBPROC Uniform3ivARB;
        /* 1008 */ PFNGLUNIFORM4IVARBPROC Uniform4ivARB;
        /* 1009 */ PFNGLUNIFORMMATRIX2FVARBPROC UniformMatrix2fvARB;
        /* 1010 */ PFNGLUNIFORMMATRIX3FVARBPROC UniformMatrix3fvARB;
        /* 1011 */ PFNGLUNIFORMMATRIX4FVARBPROC UniformMatrix4fvARB;
        /* 1012 */ PFNGLGETOBJECTPARAMETERFVARBPROC GetObjectParameterfvARB;
        /* 1013 */ PFNGLGETOBJECTPARAMETERIVARBPROC GetObjectParameterivARB;
        /* 1014 */ PFNGLGETINFOLOGARBPROC GetInfoLogARB;
        /* 1015 */ PFNGLGETATTACHEDOBJECTSARBPROC GetAttachedObjectsARB;
        /* 1016 */ PFNGLGETUNIFORMLOCATIONARBPROC GetUniformLocationARB;
        /* 1017 */ PFNGLGETACTIVEUNIFORMARBPROC GetActiveUniformARB;
        /* 1018 */ PFNGLGETUNIFORMFVARBPROC GetUniformfvARB;
        /* 1019 */ PFNGLGETUNIFORMIVARBPROC GetUniformivARB;
        /* 1020 */ PFNGLGETSHADERSOURCEARBPROC GetShaderSourceARB;
        /* 1021 */ PFNGLNAMEDSTRINGARBPROC NamedStringARB;
        /* 1022 */ PFNGLDELETENAMEDSTRINGARBPROC DeleteNamedStringARB;
        /* 1023 */ PFNGLCOMPILESHADERINCLUDEARBPROC CompileShaderIncludeARB;
        /* 1024 */ PFNGLISNAMEDSTRINGARBPROC IsNamedStringARB;
        /* 1025 */ PFNGLGETNAMEDSTRINGARBPROC GetNamedStringARB;
        /* 1026 */ PFNGLGETNAMEDSTRINGIVARBPROC GetNamedStringivARB;
        /* 1027 */ PFNGLBUFFERPAGECOMMITMENTARBPROC BufferPageCommitmentARB;
        /* 1028 */ PFNGLNAMEDBUFFERPAGECOMMITMENTEXTPROC NamedBufferPageCommitmentEXT;
        /* 1029 */ PFNGLNAMEDBUFFERPAGECOMMITMENTARBPROC NamedBufferPageCommitmentARB;
        /* 1030 */ PFNGLTEXPAGECOMMITMENTARBPROC TexPageCommitmentARB;
        /* 1031 */ PFNGLTEXBUFFERARBPROC TexBufferARB;
        /* 1032 */ PFNGLCOMPRESSEDTEXIMAGE3DARBPROC CompressedTexImage3DARB;
        /* 1033 */ PFNGLCOMPRESSEDTEXIMAGE2DARBPROC CompressedTexImage2DARB;
        /* 1034 */ PFNGLCOMPRESSEDTEXIMAGE1DARBPROC CompressedTexImage1DARB;
        /* 1035 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DARBPROC CompressedTexSubImage3DARB;
        /* 1036 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DARBPROC CompressedTexSubImage2DARB;
        /* 1037 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DARBPROC CompressedTexSubImage1DARB;
        /* 1038 */ PFNGLGETCOMPRESSEDTEXIMAGEARBPROC GetCompressedTexImageARB;
        /* 1039 */ PFNGLLOADTRANSPOSEMATRIXFARBPROC LoadTransposeMatrixfARB;
        /* 1040 */ PFNGLLOADTRANSPOSEMATRIXDARBPROC LoadTransposeMatrixdARB;
        /* 1041 */ PFNGLMULTTRANSPOSEMATRIXFARBPROC MultTransposeMatrixfARB;
        /* 1042 */ PFNGLMULTTRANSPOSEMATRIXDARBPROC MultTransposeMatrixdARB;
        /* 1043 */ PFNGLWEIGHTBVARBPROC WeightbvARB;
        /* 1044 */ PFNGLWEIGHTSVARBPROC WeightsvARB;
        /* 1045 */ PFNGLWEIGHTIVARBPROC WeightivARB;
        /* 1046 */ PFNGLWEIGHTFVARBPROC WeightfvARB;
        /* 1047 */ PFNGLWEIGHTDVARBPROC WeightdvARB;
        /* 1048 */ PFNGLWEIGHTUBVARBPROC WeightubvARB;
        /* 1049 */ PFNGLWEIGHTUSVARBPROC WeightusvARB;
        /* 1050 */ PFNGLWEIGHTUIVARBPROC WeightuivARB;
        /* 1051 */ PFNGLWEIGHTPOINTERARBPROC WeightPointerARB;
        /* 1052 */ PFNGLVERTEXBLENDARBPROC VertexBlendARB;
        /* 1053 */ PFNGLBINDBUFFERARBPROC BindBufferARB;
        /* 1054 */ PFNGLDELETEBUFFERSARBPROC DeleteBuffersARB;
        /* 1055 */ PFNGLGENBUFFERSARBPROC GenBuffersARB;
        /* 1056 */ PFNGLISBUFFERARBPROC IsBufferARB;
        /* 1057 */ PFNGLBUFFERDATAARBPROC BufferDataARB;
        /* 1058 */ PFNGLBUFFERSUBDATAARBPROC BufferSubDataARB;
        /* 1059 */ PFNGLGETBUFFERSUBDATAARBPROC GetBufferSubDataARB;
        /* 1060 */ PFNGLMAPBUFFERARBPROC MapBufferARB;
        /* 1061 */ PFNGLUNMAPBUFFERARBPROC UnmapBufferARB;
        /* 1062 */ PFNGLGETBUFFERPARAMETERIVARBPROC GetBufferParameterivARB;
        /* 1063 */ PFNGLGETBUFFERPOINTERVARBPROC GetBufferPointervARB;
        /* 1064 */ PFNGLVERTEXATTRIB1DARBPROC VertexAttrib1dARB;
        /* 1065 */ PFNGLVERTEXATTRIB1DVARBPROC VertexAttrib1dvARB;
        /* 1066 */ PFNGLVERTEXATTRIB1FARBPROC VertexAttrib1fARB;
        /* 1067 */ PFNGLVERTEXATTRIB1FVARBPROC VertexAttrib1fvARB;
        /* 1068 */ PFNGLVERTEXATTRIB1SARBPROC VertexAttrib1sARB;
        /* 1069 */ PFNGLVERTEXATTRIB1SVARBPROC VertexAttrib1svARB;
        /* 1070 */ PFNGLVERTEXATTRIB2DARBPROC VertexAttrib2dARB;
        /* 1071 */ PFNGLVERTEXATTRIB2DVARBPROC VertexAttrib2dvARB;
        /* 1072 */ PFNGLVERTEXATTRIB2FARBPROC VertexAttrib2fARB;
        /* 1073 */ PFNGLVERTEXATTRIB2FVARBPROC VertexAttrib2fvARB;
        /* 1074 */ PFNGLVERTEXATTRIB2SARBPROC VertexAttrib2sARB;
        /* 1075 */ PFNGLVERTEXATTRIB2SVARBPROC VertexAttrib2svARB;
        /* 1076 */ PFNGLVERTEXATTRIB3DARBPROC VertexAttrib3dARB;
        /* 1077 */ PFNGLVERTEXATTRIB3DVARBPROC VertexAttrib3dvARB;
        /* 1078 */ PFNGLVERTEXATTRIB3FARBPROC VertexAttrib3fARB;
        /* 1079 */ PFNGLVERTEXATTRIB3FVARBPROC VertexAttrib3fvARB;
        /* 1080 */ PFNGLVERTEXATTRIB3SARBPROC VertexAttrib3sARB;
        /* 1081 */ PFNGLVERTEXATTRIB3SVARBPROC VertexAttrib3svARB;
        /* 1082 */ PFNGLVERTEXATTRIB4NBVARBPROC VertexAttrib4NbvARB;
        /* 1083 */ PFNGLVERTEXATTRIB4NIVARBPROC VertexAttrib4NivARB;
        /* 1084 */ PFNGLVERTEXATTRIB4NSVARBPROC VertexAttrib4NsvARB;
        /* 1085 */ PFNGLVERTEXATTRIB4NUBARBPROC VertexAttrib4NubARB;
        /* 1086 */ PFNGLVERTEXATTRIB4NUBVARBPROC VertexAttrib4NubvARB;
        /* 1087 */ PFNGLVERTEXATTRIB4NUIVARBPROC VertexAttrib4NuivARB;
        /* 1088 */ PFNGLVERTEXATTRIB4NUSVARBPROC VertexAttrib4NusvARB;
        /* 1089 */ PFNGLVERTEXATTRIB4BVARBPROC VertexAttrib4bvARB;
        /* 1090 */ PFNGLVERTEXATTRIB4DARBPROC VertexAttrib4dARB;
        /* 1091 */ PFNGLVERTEXATTRIB4DVARBPROC VertexAttrib4dvARB;
        /* 1092 */ PFNGLVERTEXATTRIB4FARBPROC VertexAttrib4fARB;
        /* 1093 */ PFNGLVERTEXATTRIB4FVARBPROC VertexAttrib4fvARB;
        /* 1094 */ PFNGLVERTEXATTRIB4IVARBPROC VertexAttrib4ivARB;
        /* 1095 */ PFNGLVERTEXATTRIB4SARBPROC VertexAttrib4sARB;
        /* 1096 */ PFNGLVERTEXATTRIB4SVARBPROC VertexAttrib4svARB;
        /* 1097 */ PFNGLVERTEXATTRIB4UBVARBPROC VertexAttrib4ubvARB;
        /* 1098 */ PFNGLVERTEXATTRIB4UIVARBPROC VertexAttrib4uivARB;
        /* 1099 */ PFNGLVERTEXATTRIB4USVARBPROC VertexAttrib4usvARB;
        /* 1100 */ PFNGLVERTEXATTRIBPOINTERARBPROC VertexAttribPointerARB;
        /* 1101 */ PFNGLENABLEVERTEXATTRIBARRAYARBPROC EnableVertexAttribArrayARB;
        /* 1102 */ PFNGLDISABLEVERTEXATTRIBARRAYARBPROC DisableVertexAttribArrayARB;
        /* 1103 */ PFNGLGETVERTEXATTRIBDVARBPROC GetVertexAttribdvARB;
        /* 1104 */ PFNGLGETVERTEXATTRIBFVARBPROC GetVertexAttribfvARB;
        /* 1105 */ PFNGLGETVERTEXATTRIBIVARBPROC GetVertexAttribivARB;
        /* 1106 */ PFNGLGETVERTEXATTRIBPOINTERVARBPROC GetVertexAttribPointervARB;
        /* 1107 */ PFNGLBINDATTRIBLOCATIONARBPROC BindAttribLocationARB;
        /* 1108 */ PFNGLGETACTIVEATTRIBARBPROC GetActiveAttribARB;
        /* 1109 */ PFNGLGETATTRIBLOCATIONARBPROC GetAttribLocationARB;
        /* 1110 */ PFNGLVERTEXP2UIPROC VertexP2ui;
        /* 1111 */ PFNGLVERTEXP2UIVPROC VertexP2uiv;
        /* 1112 */ PFNGLVERTEXP3UIPROC VertexP3ui;
        /* 1113 */ PFNGLVERTEXP3UIVPROC VertexP3uiv;
        /* 1114 */ PFNGLVERTEXP4UIPROC VertexP4ui;
        /* 1115 */ PFNGLVERTEXP4UIVPROC VertexP4uiv;
        /* 1116 */ PFNGLTEXCOORDP1UIPROC TexCoordP1ui;
        /* 1117 */ PFNGLTEXCOORDP1UIVPROC TexCoordP1uiv;
        /* 1118 */ PFNGLTEXCOORDP2UIPROC TexCoordP2ui;
        /* 1119 */ PFNGLTEXCOORDP2UIVPROC TexCoordP2uiv;
        /* 1120 */ PFNGLTEXCOORDP3UIPROC TexCoordP3ui;
        /* 1121 */ PFNGLTEXCOORDP3UIVPROC TexCoordP3uiv;
        /* 1122 */ PFNGLTEXCOORDP4UIPROC TexCoordP4ui;
        /* 1123 */ PFNGLTEXCOORDP4UIVPROC TexCoordP4uiv;
        /* 1124 */ PFNGLMULTITEXCOORDP1UIPROC MultiTexCoordP1ui;
        /* 1125 */ PFNGLMULTITEXCOORDP1UIVPROC MultiTexCoordP1uiv;
        /* 1126 */ PFNGLMULTITEXCOORDP2UIPROC MultiTexCoordP2ui;
        /* 1127 */ PFNGLMULTITEXCOORDP2UIVPROC MultiTexCoordP2uiv;
        /* 1128 */ PFNGLMULTITEXCOORDP3UIPROC MultiTexCoordP3ui;
        /* 1129 */ PFNGLMULTITEXCOORDP3UIVPROC MultiTexCoordP3uiv;
        /* 1130 */ PFNGLMULTITEXCOORDP4UIPROC MultiTexCoordP4ui;
        /* 1131 */ PFNGLMULTITEXCOORDP4UIVPROC MultiTexCoordP4uiv;
        /* 1132 */ PFNGLNORMALP3UIPROC NormalP3ui;
        /* 1133 */ PFNGLNORMALP3UIVPROC NormalP3uiv;
        /* 1134 */ PFNGLCOLORP3UIPROC ColorP3ui;
        /* 1135 */ PFNGLCOLORP3UIVPROC ColorP3uiv;
        /* 1136 */ PFNGLCOLORP4UIPROC ColorP4ui;
        /* 1137 */ PFNGLCOLORP4UIVPROC ColorP4uiv;
        /* 1138 */ PFNGLSECONDARYCOLORP3UIPROC SecondaryColorP3ui;
        /* 1139 */ PFNGLSECONDARYCOLORP3UIVPROC SecondaryColorP3uiv;
        /* 1140 */ PFNGLDEPTHRANGEARRAYDVNVPROC DepthRangeArraydvNV;
        /* 1141 */ PFNGLDEPTHRANGEINDEXEDDNVPROC DepthRangeIndexeddNV;
        /* 1142 */ PFNGLWINDOWPOS2DARBPROC WindowPos2dARB;
        /* 1143 */ PFNGLWINDOWPOS2DVARBPROC WindowPos2dvARB;
        /* 1144 */ PFNGLWINDOWPOS2FARBPROC WindowPos2fARB;
        /* 1145 */ PFNGLWINDOWPOS2FVARBPROC WindowPos2fvARB;
        /* 1146 */ PFNGLWINDOWPOS2IARBPROC WindowPos2iARB;
        /* 1147 */ PFNGLWINDOWPOS2IVARBPROC WindowPos2ivARB;
        /* 1148 */ PFNGLWINDOWPOS2SARBPROC WindowPos2sARB;
        /* 1149 */ PFNGLWINDOWPOS2SVARBPROC WindowPos2svARB;
        /* 1150 */ PFNGLWINDOWPOS3DARBPROC WindowPos3dARB;
        /* 1151 */ PFNGLWINDOWPOS3DVARBPROC WindowPos3dvARB;
        /* 1152 */ PFNGLWINDOWPOS3FARBPROC WindowPos3fARB;
        /* 1153 */ PFNGLWINDOWPOS3FVARBPROC WindowPos3fvARB;
        /* 1154 */ PFNGLWINDOWPOS3IARBPROC WindowPos3iARB;
        /* 1155 */ PFNGLWINDOWPOS3IVARBPROC WindowPos3ivARB;
        /* 1156 */ PFNGLWINDOWPOS3SARBPROC WindowPos3sARB;
        /* 1157 */ PFNGLWINDOWPOS3SVARBPROC WindowPos3svARB;
        /* 1158 */ PFNGLMAXACTIVESHADERCORESARMPROC MaxActiveShaderCoresARM;
        /* 1159 */ PFNGLDRAWBUFFERSATIPROC DrawBuffersATI;
        /* 1160 */ PFNGLELEMENTPOINTERATIPROC ElementPointerATI;
        /* 1161 */ PFNGLDRAWELEMENTARRAYATIPROC DrawElementArrayATI;
        /* 1162 */ PFNGLDRAWRANGEELEMENTARRAYATIPROC DrawRangeElementArrayATI;
        /* 1163 */ PFNGLTEXBUMPPARAMETERIVATIPROC TexBumpParameterivATI;
        /* 1164 */ PFNGLTEXBUMPPARAMETERFVATIPROC TexBumpParameterfvATI;
        /* 1165 */ PFNGLGETTEXBUMPPARAMETERIVATIPROC GetTexBumpParameterivATI;
        /* 1166 */ PFNGLGETTEXBUMPPARAMETERFVATIPROC GetTexBumpParameterfvATI;
        /* 1167 */ PFNGLGENFRAGMENTSHADERSATIPROC GenFragmentShadersATI;
        /* 1168 */ PFNGLBINDFRAGMENTSHADERATIPROC BindFragmentShaderATI;
        /* 1169 */ PFNGLDELETEFRAGMENTSHADERATIPROC DeleteFragmentShaderATI;
        /* 1170 */ PFNGLBEGINFRAGMENTSHADERATIPROC BeginFragmentShaderATI;
        /* 1171 */ PFNGLENDFRAGMENTSHADERATIPROC EndFragmentShaderATI;
        /* 1172 */ PFNGLPASSTEXCOORDATIPROC PassTexCoordATI;
        /* 1173 */ PFNGLSAMPLEMAPATIPROC SampleMapATI;
        /* 1174 */ PFNGLCOLORFRAGMENTOP1ATIPROC ColorFragmentOp1ATI;
        /* 1175 */ PFNGLCOLORFRAGMENTOP2ATIPROC ColorFragmentOp2ATI;
        /* 1176 */ PFNGLCOLORFRAGMENTOP3ATIPROC ColorFragmentOp3ATI;
        /* 1177 */ PFNGLALPHAFRAGMENTOP1ATIPROC AlphaFragmentOp1ATI;
        /* 1178 */ PFNGLALPHAFRAGMENTOP2ATIPROC AlphaFragmentOp2ATI;
        /* 1179 */ PFNGLALPHAFRAGMENTOP3ATIPROC AlphaFragmentOp3ATI;
        /* 1180 */ PFNGLSETFRAGMENTSHADERCONSTANTATIPROC SetFragmentShaderConstantATI;
        /* 1181 */ PFNGLMAPOBJECTBUFFERATIPROC MapObjectBufferATI;
        /* 1182 */ PFNGLUNMAPOBJECTBUFFERATIPROC UnmapObjectBufferATI;
        /* 1183 */ PFNGLPNTRIANGLESIATIPROC PNTrianglesiATI;
        /* 1184 */ PFNGLPNTRIANGLESFATIPROC PNTrianglesfATI;
        /* 1185 */ PFNGLSTENCILOPSEPARATEATIPROC StencilOpSeparateATI;
        /* 1186 */ PFNGLSTENCILFUNCSEPARATEATIPROC StencilFuncSeparateATI;
        /* 1187 */ PFNGLNEWOBJECTBUFFERATIPROC NewObjectBufferATI;
        /* 1188 */ PFNGLISOBJECTBUFFERATIPROC IsObjectBufferATI;
        /* 1189 */ PFNGLUPDATEOBJECTBUFFERATIPROC UpdateObjectBufferATI;
        /* 1190 */ PFNGLGETOBJECTBUFFERFVATIPROC GetObjectBufferfvATI;
        /* 1191 */ PFNGLGETOBJECTBUFFERIVATIPROC GetObjectBufferivATI;
        /* 1192 */ PFNGLFREEOBJECTBUFFERATIPROC FreeObjectBufferATI;
        /* 1193 */ PFNGLARRAYOBJECTATIPROC ArrayObjectATI;
        /* 1194 */ PFNGLGETARRAYOBJECTFVATIPROC GetArrayObjectfvATI;
        /* 1195 */ PFNGLGETARRAYOBJECTIVATIPROC GetArrayObjectivATI;
        /* 1196 */ PFNGLVARIANTARRAYOBJECTATIPROC VariantArrayObjectATI;
        /* 1197 */ PFNGLGETVARIANTARRAYOBJECTFVATIPROC GetVariantArrayObjectfvATI;
        /* 1198 */ PFNGLGETVARIANTARRAYOBJECTIVATIPROC GetVariantArrayObjectivATI;
        /* 1199 */ PFNGLVERTEXATTRIBARRAYOBJECTATIPROC VertexAttribArrayObjectATI;
        /* 1200 */ PFNGLGETVERTEXATTRIBARRAYOBJECTFVATIPROC GetVertexAttribArrayObjectfvATI;
        /* 1201 */ PFNGLGETVERTEXATTRIBARRAYOBJECTIVATIPROC GetVertexAttribArrayObjectivATI;
        /* 1202 */ PFNGLVERTEXSTREAM1SATIPROC VertexStream1sATI;
        /* 1203 */ PFNGLVERTEXSTREAM1SVATIPROC VertexStream1svATI;
        /* 1204 */ PFNGLVERTEXSTREAM1IATIPROC VertexStream1iATI;
        /* 1205 */ PFNGLVERTEXSTREAM1IVATIPROC VertexStream1ivATI;
        /* 1206 */ PFNGLVERTEXSTREAM1FATIPROC VertexStream1fATI;
        /* 1207 */ PFNGLVERTEXSTREAM1FVATIPROC VertexStream1fvATI;
        /* 1208 */ PFNGLVERTEXSTREAM1DATIPROC VertexStream1dATI;
        /* 1209 */ PFNGLVERTEXSTREAM1DVATIPROC VertexStream1dvATI;
        /* 1210 */ PFNGLVERTEXSTREAM2SATIPROC VertexStream2sATI;
        /* 1211 */ PFNGLVERTEXSTREAM2SVATIPROC VertexStream2svATI;
        /* 1212 */ PFNGLVERTEXSTREAM2IATIPROC VertexStream2iATI;
        /* 1213 */ PFNGLVERTEXSTREAM2IVATIPROC VertexStream2ivATI;
        /* 1214 */ PFNGLVERTEXSTREAM2FATIPROC VertexStream2fATI;
        /* 1215 */ PFNGLVERTEXSTREAM2FVATIPROC VertexStream2fvATI;
        /* 1216 */ PFNGLVERTEXSTREAM2DATIPROC VertexStream2dATI;
        /* 1217 */ PFNGLVERTEXSTREAM2DVATIPROC VertexStream2dvATI;
        /* 1218 */ PFNGLVERTEXSTREAM3SATIPROC VertexStream3sATI;
        /* 1219 */ PFNGLVERTEXSTREAM3SVATIPROC VertexStream3svATI;
        /* 1220 */ PFNGLVERTEXSTREAM3IATIPROC VertexStream3iATI;
        /* 1221 */ PFNGLVERTEXSTREAM3IVATIPROC VertexStream3ivATI;
        /* 1222 */ PFNGLVERTEXSTREAM3FATIPROC VertexStream3fATI;
        /* 1223 */ PFNGLVERTEXSTREAM3FVATIPROC VertexStream3fvATI;
        /* 1224 */ PFNGLVERTEXSTREAM3DATIPROC VertexStream3dATI;
        /* 1225 */ PFNGLVERTEXSTREAM3DVATIPROC VertexStream3dvATI;
        /* 1226 */ PFNGLVERTEXSTREAM4SATIPROC VertexStream4sATI;
        /* 1227 */ PFNGLVERTEXSTREAM4SVATIPROC VertexStream4svATI;
        /* 1228 */ PFNGLVERTEXSTREAM4IATIPROC VertexStream4iATI;
        /* 1229 */ PFNGLVERTEXSTREAM4IVATIPROC VertexStream4ivATI;
        /* 1230 */ PFNGLVERTEXSTREAM4FATIPROC VertexStream4fATI;
        /* 1231 */ PFNGLVERTEXSTREAM4FVATIPROC VertexStream4fvATI;
        /* 1232 */ PFNGLVERTEXSTREAM4DATIPROC VertexStream4dATI;
        /* 1233 */ PFNGLVERTEXSTREAM4DVATIPROC VertexStream4dvATI;
        /* 1234 */ PFNGLNORMALSTREAM3BATIPROC NormalStream3bATI;
        /* 1235 */ PFNGLNORMALSTREAM3BVATIPROC NormalStream3bvATI;
        /* 1236 */ PFNGLNORMALSTREAM3SATIPROC NormalStream3sATI;
        /* 1237 */ PFNGLNORMALSTREAM3SVATIPROC NormalStream3svATI;
        /* 1238 */ PFNGLNORMALSTREAM3IATIPROC NormalStream3iATI;
        /* 1239 */ PFNGLNORMALSTREAM3IVATIPROC NormalStream3ivATI;
        /* 1240 */ PFNGLNORMALSTREAM3FATIPROC NormalStream3fATI;
        /* 1241 */ PFNGLNORMALSTREAM3FVATIPROC NormalStream3fvATI;
        /* 1242 */ PFNGLNORMALSTREAM3DATIPROC NormalStream3dATI;
        /* 1243 */ PFNGLNORMALSTREAM3DVATIPROC NormalStream3dvATI;
        /* 1244 */ PFNGLCLIENTACTIVEVERTEXSTREAMATIPROC ClientActiveVertexStreamATI;
        /* 1245 */ PFNGLVERTEXBLENDENVIATIPROC VertexBlendEnviATI;
        /* 1246 */ PFNGLVERTEXBLENDENVFATIPROC VertexBlendEnvfATI;
        /* 1247 */ PFNGLEGLIMAGETARGETTEXSTORAGEEXTPROC EGLImageTargetTexStorageEXT;
        /* 1248 */ PFNGLEGLIMAGETARGETTEXTURESTORAGEEXTPROC EGLImageTargetTextureStorageEXT;
        /* 1249 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEEXTPROC DrawArraysInstancedBaseInstanceEXT;
        /* 1250 */ PFNGLDRAWELEMENTSINSTANCEDBASEINSTANCEEXTPROC DrawElementsInstancedBaseInstanceEXT;
        /* 1251 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEEXTPROC DrawElementsInstancedBaseVertexBaseInstanceEXT;
        /* 1252 */ PFNGLUNIFORMBUFFEREXTPROC UniformBufferEXT;
        /* 1253 */ PFNGLGETUNIFORMBUFFERSIZEEXTPROC GetUniformBufferSizeEXT;
        /* 1254 */ PFNGLGETUNIFORMOFFSETEXTPROC GetUniformOffsetEXT;
        /* 1255 */ PFNGLBLENDCOLOREXTPROC BlendColorEXT;
        /* 1256 */ PFNGLBLENDEQUATIONSEPARATEEXTPROC BlendEquationSeparateEXT;
        /* 1257 */ PFNGLBINDFRAGDATALOCATIONINDEXEDEXTPROC BindFragDataLocationIndexedEXT;
        /* 1258 */ PFNGLBINDFRAGDATALOCATIONEXTPROC BindFragDataLocationEXT;
        /* 1259 */ PFNGLGETPROGRAMRESOURCELOCATIONINDEXEXTPROC GetProgramResourceLocationIndexEXT;
        /* 1260 */ PFNGLGETFRAGDATAINDEXEXTPROC GetFragDataIndexEXT;
        /* 1261 */ PFNGLBLENDFUNCSEPARATEEXTPROC BlendFuncSeparateEXT;
        /* 1262 */ PFNGLBLENDEQUATIONEXTPROC BlendEquationEXT;
        /* 1263 */ PFNGLBUFFERSTORAGEEXTPROC BufferStorageEXT;
        /* 1264 */ PFNGLCLEARTEXIMAGEEXTPROC ClearTexImageEXT;
        /* 1265 */ PFNGLCLEARTEXSUBIMAGEEXTPROC ClearTexSubImageEXT;
        /* 1266 */ PFNGLCLIPCONTROLEXTPROC ClipControlEXT;
        /* 1267 */ PFNGLCOLORSUBTABLEEXTPROC ColorSubTableEXT;
        /* 1268 */ PFNGLCOPYCOLORSUBTABLEEXTPROC CopyColorSubTableEXT;
        /* 1269 */ PFNGLLOCKARRAYSEXTPROC LockArraysEXT;
        /* 1270 */ PFNGLUNLOCKARRAYSEXTPROC UnlockArraysEXT;
        /* 1271 */ PFNGLCONVOLUTIONFILTER1DEXTPROC ConvolutionFilter1DEXT;
        /* 1272 */ PFNGLCONVOLUTIONFILTER2DEXTPROC ConvolutionFilter2DEXT;
        /* 1273 */ PFNGLCONVOLUTIONPARAMETERFEXTPROC ConvolutionParameterfEXT;
        /* 1274 */ PFNGLCONVOLUTIONPARAMETERFVEXTPROC ConvolutionParameterfvEXT;
        /* 1275 */ PFNGLCONVOLUTIONPARAMETERIEXTPROC ConvolutionParameteriEXT;
        /* 1276 */ PFNGLCONVOLUTIONPARAMETERIVEXTPROC ConvolutionParameterivEXT;
        /* 1277 */ PFNGLCOPYCONVOLUTIONFILTER1DEXTPROC CopyConvolutionFilter1DEXT;
        /* 1278 */ PFNGLCOPYCONVOLUTIONFILTER2DEXTPROC CopyConvolutionFilter2DEXT;
        /* 1279 */ PFNGLGETCONVOLUTIONFILTEREXTPROC GetConvolutionFilterEXT;
        /* 1280 */ PFNGLGETCONVOLUTIONPARAMETERFVEXTPROC GetConvolutionParameterfvEXT;
        /* 1281 */ PFNGLGETCONVOLUTIONPARAMETERIVEXTPROC GetConvolutionParameterivEXT;
        /* 1282 */ PFNGLGETSEPARABLEFILTEREXTPROC GetSeparableFilterEXT;
        /* 1283 */ PFNGLSEPARABLEFILTER2DEXTPROC SeparableFilter2DEXT;
        /* 1284 */ PFNGLTANGENT3BEXTPROC Tangent3bEXT;
        /* 1285 */ PFNGLTANGENT3BVEXTPROC Tangent3bvEXT;
        /* 1286 */ PFNGLTANGENT3DEXTPROC Tangent3dEXT;
        /* 1287 */ PFNGLTANGENT3DVEXTPROC Tangent3dvEXT;
        /* 1288 */ PFNGLTANGENT3FEXTPROC Tangent3fEXT;
        /* 1289 */ PFNGLTANGENT3FVEXTPROC Tangent3fvEXT;
        /* 1290 */ PFNGLTANGENT3IEXTPROC Tangent3iEXT;
        /* 1291 */ PFNGLTANGENT3IVEXTPROC Tangent3ivEXT;
        /* 1292 */ PFNGLTANGENT3SEXTPROC Tangent3sEXT;
        /* 1293 */ PFNGLTANGENT3SVEXTPROC Tangent3svEXT;
        /* 1294 */ PFNGLBINORMAL3BEXTPROC Binormal3bEXT;
        /* 1295 */ PFNGLBINORMAL3BVEXTPROC Binormal3bvEXT;
        /* 1296 */ PFNGLBINORMAL3DEXTPROC Binormal3dEXT;
        /* 1297 */ PFNGLBINORMAL3DVEXTPROC Binormal3dvEXT;
        /* 1298 */ PFNGLBINORMAL3FEXTPROC Binormal3fEXT;
        /* 1299 */ PFNGLBINORMAL3FVEXTPROC Binormal3fvEXT;
        /* 1300 */ PFNGLBINORMAL3IEXTPROC Binormal3iEXT;
        /* 1301 */ PFNGLBINORMAL3IVEXTPROC Binormal3ivEXT;
        /* 1302 */ PFNGLBINORMAL3SEXTPROC Binormal3sEXT;
        /* 1303 */ PFNGLBINORMAL3SVEXTPROC Binormal3svEXT;
        /* 1304 */ PFNGLTANGENTPOINTEREXTPROC TangentPointerEXT;
        /* 1305 */ PFNGLBINORMALPOINTEREXTPROC BinormalPointerEXT;
        /* 1306 */ PFNGLCOPYIMAGESUBDATAEXTPROC CopyImageSubDataEXT;
        /* 1307 */ PFNGLCOPYTEXIMAGE1DEXTPROC CopyTexImage1DEXT;
        /* 1308 */ PFNGLCOPYTEXIMAGE2DEXTPROC CopyTexImage2DEXT;
        /* 1309 */ PFNGLCOPYTEXSUBIMAGE1DEXTPROC CopyTexSubImage1DEXT;
        /* 1310 */ PFNGLCOPYTEXSUBIMAGE2DEXTPROC CopyTexSubImage2DEXT;
        /* 1311 */ PFNGLCOPYTEXSUBIMAGE3DEXTPROC CopyTexSubImage3DEXT;
        /* 1312 */ PFNGLCULLPARAMETERDVEXTPROC CullParameterdvEXT;
        /* 1313 */ PFNGLCULLPARAMETERFVEXTPROC CullParameterfvEXT;
        /* 1314 */ PFNGLLABELOBJECTEXTPROC LabelObjectEXT;
        /* 1315 */ PFNGLGETOBJECTLABELEXTPROC GetObjectLabelEXT;
        /* 1316 */ PFNGLINSERTEVENTMARKEREXTPROC InsertEventMarkerEXT;
        /* 1317 */ PFNGLPUSHGROUPMARKEREXTPROC PushGroupMarkerEXT;
        /* 1318 */ PFNGLPOPGROUPMARKEREXTPROC PopGroupMarkerEXT;
        /* 1319 */ PFNGLDEPTHBOUNDSEXTPROC DepthBoundsEXT;
        /* 1320 */ PFNGLMATRIXLOADFEXTPROC MatrixLoadfEXT;
        /* 1321 */ PFNGLMATRIXLOADDEXTPROC MatrixLoaddEXT;
        /* 1322 */ PFNGLMATRIXMULTFEXTPROC MatrixMultfEXT;
        /* 1323 */ PFNGLMATRIXMULTDEXTPROC MatrixMultdEXT;
        /* 1324 */ PFNGLMATRIXLOADIDENTITYEXTPROC MatrixLoadIdentityEXT;
        /* 1325 */ PFNGLMATRIXROTATEFEXTPROC MatrixRotatefEXT;
        /* 1326 */ PFNGLMATRIXROTATEDEXTPROC MatrixRotatedEXT;
        /* 1327 */ PFNGLMATRIXSCALEFEXTPROC MatrixScalefEXT;
        /* 1328 */ PFNGLMATRIXSCALEDEXTPROC MatrixScaledEXT;
        /* 1329 */ PFNGLMATRIXTRANSLATEFEXTPROC MatrixTranslatefEXT;
        /* 1330 */ PFNGLMATRIXTRANSLATEDEXTPROC MatrixTranslatedEXT;
        /* 1331 */ PFNGLMATRIXFRUSTUMEXTPROC MatrixFrustumEXT;
        /* 1332 */ PFNGLMATRIXORTHOEXTPROC MatrixOrthoEXT;
        /* 1333 */ PFNGLMATRIXPOPEXTPROC MatrixPopEXT;
        /* 1334 */ PFNGLMATRIXPUSHEXTPROC MatrixPushEXT;
        /* 1335 */ PFNGLCLIENTATTRIBDEFAULTEXTPROC ClientAttribDefaultEXT;
        /* 1336 */ PFNGLPUSHCLIENTATTRIBDEFAULTEXTPROC PushClientAttribDefaultEXT;
        /* 1337 */ PFNGLTEXTUREPARAMETERFEXTPROC TextureParameterfEXT;
        /* 1338 */ PFNGLTEXTUREPARAMETERFVEXTPROC TextureParameterfvEXT;
        /* 1339 */ PFNGLTEXTUREPARAMETERIEXTPROC TextureParameteriEXT;
        /* 1340 */ PFNGLTEXTUREPARAMETERIVEXTPROC TextureParameterivEXT;
        /* 1341 */ PFNGLTEXTUREIMAGE1DEXTPROC TextureImage1DEXT;
        /* 1342 */ PFNGLTEXTUREIMAGE2DEXTPROC TextureImage2DEXT;
        /* 1343 */ PFNGLTEXTURESUBIMAGE1DEXTPROC TextureSubImage1DEXT;
        /* 1344 */ PFNGLTEXTURESUBIMAGE2DEXTPROC TextureSubImage2DEXT;
        /* 1345 */ PFNGLCOPYTEXTUREIMAGE1DEXTPROC CopyTextureImage1DEXT;
        /* 1346 */ PFNGLCOPYTEXTUREIMAGE2DEXTPROC CopyTextureImage2DEXT;
        /* 1347 */ PFNGLCOPYTEXTURESUBIMAGE1DEXTPROC CopyTextureSubImage1DEXT;
        /* 1348 */ PFNGLCOPYTEXTURESUBIMAGE2DEXTPROC CopyTextureSubImage2DEXT;
        /* 1349 */ PFNGLGETTEXTUREIMAGEEXTPROC GetTextureImageEXT;
        /* 1350 */ PFNGLGETTEXTUREPARAMETERFVEXTPROC GetTextureParameterfvEXT;
        /* 1351 */ PFNGLGETTEXTUREPARAMETERIVEXTPROC GetTextureParameterivEXT;
        /* 1352 */ PFNGLGETTEXTURELEVELPARAMETERFVEXTPROC GetTextureLevelParameterfvEXT;
        /* 1353 */ PFNGLGETTEXTURELEVELPARAMETERIVEXTPROC GetTextureLevelParameterivEXT;
        /* 1354 */ PFNGLTEXTUREIMAGE3DEXTPROC TextureImage3DEXT;
        /* 1355 */ PFNGLTEXTURESUBIMAGE3DEXTPROC TextureSubImage3DEXT;
        /* 1356 */ PFNGLCOPYTEXTURESUBIMAGE3DEXTPROC CopyTextureSubImage3DEXT;
        /* 1357 */ PFNGLBINDMULTITEXTUREEXTPROC BindMultiTextureEXT;
        /* 1358 */ PFNGLMULTITEXCOORDPOINTEREXTPROC MultiTexCoordPointerEXT;
        /* 1359 */ PFNGLMULTITEXENVFEXTPROC MultiTexEnvfEXT;
        /* 1360 */ PFNGLMULTITEXENVFVEXTPROC MultiTexEnvfvEXT;
        /* 1361 */ PFNGLMULTITEXENVIEXTPROC MultiTexEnviEXT;
        /* 1362 */ PFNGLMULTITEXENVIVEXTPROC MultiTexEnvivEXT;
        /* 1363 */ PFNGLMULTITEXGENDEXTPROC MultiTexGendEXT;
        /* 1364 */ PFNGLMULTITEXGENDVEXTPROC MultiTexGendvEXT;
        /* 1365 */ PFNGLMULTITEXGENFEXTPROC MultiTexGenfEXT;
        /* 1366 */ PFNGLMULTITEXGENFVEXTPROC MultiTexGenfvEXT;
        /* 1367 */ PFNGLMULTITEXGENIEXTPROC MultiTexGeniEXT;
        /* 1368 */ PFNGLMULTITEXGENIVEXTPROC MultiTexGenivEXT;
        /* 1369 */ PFNGLGETMULTITEXENVFVEXTPROC GetMultiTexEnvfvEXT;
        /* 1370 */ PFNGLGETMULTITEXENVIVEXTPROC GetMultiTexEnvivEXT;
        /* 1371 */ PFNGLGETMULTITEXGENDVEXTPROC GetMultiTexGendvEXT;
        /* 1372 */ PFNGLGETMULTITEXGENFVEXTPROC GetMultiTexGenfvEXT;
        /* 1373 */ PFNGLGETMULTITEXGENIVEXTPROC GetMultiTexGenivEXT;
        /* 1374 */ PFNGLMULTITEXPARAMETERIEXTPROC MultiTexParameteriEXT;
        /* 1375 */ PFNGLMULTITEXPARAMETERIVEXTPROC MultiTexParameterivEXT;
        /* 1376 */ PFNGLMULTITEXPARAMETERFEXTPROC MultiTexParameterfEXT;
        /* 1377 */ PFNGLMULTITEXPARAMETERFVEXTPROC MultiTexParameterfvEXT;
        /* 1378 */ PFNGLMULTITEXIMAGE1DEXTPROC MultiTexImage1DEXT;
        /* 1379 */ PFNGLMULTITEXIMAGE2DEXTPROC MultiTexImage2DEXT;
        /* 1380 */ PFNGLMULTITEXSUBIMAGE1DEXTPROC MultiTexSubImage1DEXT;
        /* 1381 */ PFNGLMULTITEXSUBIMAGE2DEXTPROC MultiTexSubImage2DEXT;
        /* 1382 */ PFNGLCOPYMULTITEXIMAGE1DEXTPROC CopyMultiTexImage1DEXT;
        /* 1383 */ PFNGLCOPYMULTITEXIMAGE2DEXTPROC CopyMultiTexImage2DEXT;
        /* 1384 */ PFNGLCOPYMULTITEXSUBIMAGE1DEXTPROC CopyMultiTexSubImage1DEXT;
        /* 1385 */ PFNGLCOPYMULTITEXSUBIMAGE2DEXTPROC CopyMultiTexSubImage2DEXT;
        /* 1386 */ PFNGLGETMULTITEXIMAGEEXTPROC GetMultiTexImageEXT;
        /* 1387 */ PFNGLGETMULTITEXPARAMETERFVEXTPROC GetMultiTexParameterfvEXT;
        /* 1388 */ PFNGLGETMULTITEXPARAMETERIVEXTPROC GetMultiTexParameterivEXT;
        /* 1389 */ PFNGLGETMULTITEXLEVELPARAMETERFVEXTPROC GetMultiTexLevelParameterfvEXT;
        /* 1390 */ PFNGLGETMULTITEXLEVELPARAMETERIVEXTPROC GetMultiTexLevelParameterivEXT;
        /* 1391 */ PFNGLMULTITEXIMAGE3DEXTPROC MultiTexImage3DEXT;
        /* 1392 */ PFNGLMULTITEXSUBIMAGE3DEXTPROC MultiTexSubImage3DEXT;
        /* 1393 */ PFNGLCOPYMULTITEXSUBIMAGE3DEXTPROC CopyMultiTexSubImage3DEXT;
        /* 1394 */ PFNGLENABLECLIENTSTATEINDEXEDEXTPROC EnableClientStateIndexedEXT;
        /* 1395 */ PFNGLDISABLECLIENTSTATEINDEXEDEXTPROC DisableClientStateIndexedEXT;
        /* 1396 */ PFNGLGETFLOATINDEXEDVEXTPROC GetFloatIndexedvEXT;
        /* 1397 */ PFNGLGETDOUBLEINDEXEDVEXTPROC GetDoubleIndexedvEXT;
        /* 1398 */ PFNGLGETPOINTERINDEXEDVEXTPROC GetPointerIndexedvEXT;
        /* 1399 */ PFNGLENABLEINDEXEDEXTPROC EnableIndexedEXT;
        /* 1400 */ PFNGLDISABLEINDEXEDEXTPROC DisableIndexedEXT;
        /* 1401 */ PFNGLISENABLEDINDEXEDEXTPROC IsEnabledIndexedEXT;
        /* 1402 */ PFNGLGETINTEGERINDEXEDVEXTPROC GetIntegerIndexedvEXT;
        /* 1403 */ PFNGLGETBOOLEANINDEXEDVEXTPROC GetBooleanIndexedvEXT;
        /* 1404 */ PFNGLCOMPRESSEDTEXTUREIMAGE3DEXTPROC CompressedTextureImage3DEXT;
        /* 1405 */ PFNGLCOMPRESSEDTEXTUREIMAGE2DEXTPROC CompressedTextureImage2DEXT;
        /* 1406 */ PFNGLCOMPRESSEDTEXTUREIMAGE1DEXTPROC CompressedTextureImage1DEXT;
        /* 1407 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE3DEXTPROC CompressedTextureSubImage3DEXT;
        /* 1408 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE2DEXTPROC CompressedTextureSubImage2DEXT;
        /* 1409 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE1DEXTPROC CompressedTextureSubImage1DEXT;
        /* 1410 */ PFNGLGETCOMPRESSEDTEXTUREIMAGEEXTPROC GetCompressedTextureImageEXT;
        /* 1411 */ PFNGLCOMPRESSEDMULTITEXIMAGE3DEXTPROC CompressedMultiTexImage3DEXT;
        /* 1412 */ PFNGLCOMPRESSEDMULTITEXIMAGE2DEXTPROC CompressedMultiTexImage2DEXT;
        /* 1413 */ PFNGLCOMPRESSEDMULTITEXIMAGE1DEXTPROC CompressedMultiTexImage1DEXT;
        /* 1414 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE3DEXTPROC CompressedMultiTexSubImage3DEXT;
        /* 1415 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE2DEXTPROC CompressedMultiTexSubImage2DEXT;
        /* 1416 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE1DEXTPROC CompressedMultiTexSubImage1DEXT;
        /* 1417 */ PFNGLGETCOMPRESSEDMULTITEXIMAGEEXTPROC GetCompressedMultiTexImageEXT;
        /* 1418 */ PFNGLMATRIXLOADTRANSPOSEFEXTPROC MatrixLoadTransposefEXT;
        /* 1419 */ PFNGLMATRIXLOADTRANSPOSEDEXTPROC MatrixLoadTransposedEXT;
        /* 1420 */ PFNGLMATRIXMULTTRANSPOSEFEXTPROC MatrixMultTransposefEXT;
        /* 1421 */ PFNGLMATRIXMULTTRANSPOSEDEXTPROC MatrixMultTransposedEXT;
        /* 1422 */ PFNGLNAMEDBUFFERDATAEXTPROC NamedBufferDataEXT;
        /* 1423 */ PFNGLNAMEDBUFFERSUBDATAEXTPROC NamedBufferSubDataEXT;
        /* 1424 */ PFNGLMAPNAMEDBUFFEREXTPROC MapNamedBufferEXT;
        /* 1425 */ PFNGLUNMAPNAMEDBUFFEREXTPROC UnmapNamedBufferEXT;
        /* 1426 */ PFNGLGETNAMEDBUFFERPARAMETERIVEXTPROC GetNamedBufferParameterivEXT;
        /* 1427 */ PFNGLGETNAMEDBUFFERPOINTERVEXTPROC GetNamedBufferPointervEXT;
        /* 1428 */ PFNGLGETNAMEDBUFFERSUBDATAEXTPROC GetNamedBufferSubDataEXT;
        /* 1429 */ PFNGLPROGRAMUNIFORM1FEXTPROC ProgramUniform1fEXT;
        /* 1430 */ PFNGLPROGRAMUNIFORM2FEXTPROC ProgramUniform2fEXT;
        /* 1431 */ PFNGLPROGRAMUNIFORM3FEXTPROC ProgramUniform3fEXT;
        /* 1432 */ PFNGLPROGRAMUNIFORM4FEXTPROC ProgramUniform4fEXT;
        /* 1433 */ PFNGLPROGRAMUNIFORM1IEXTPROC ProgramUniform1iEXT;
        /* 1434 */ PFNGLPROGRAMUNIFORM2IEXTPROC ProgramUniform2iEXT;
        /* 1435 */ PFNGLPROGRAMUNIFORM3IEXTPROC ProgramUniform3iEXT;
        /* 1436 */ PFNGLPROGRAMUNIFORM4IEXTPROC ProgramUniform4iEXT;
        /* 1437 */ PFNGLPROGRAMUNIFORM1FVEXTPROC ProgramUniform1fvEXT;
        /* 1438 */ PFNGLPROGRAMUNIFORM2FVEXTPROC ProgramUniform2fvEXT;
        /* 1439 */ PFNGLPROGRAMUNIFORM3FVEXTPROC ProgramUniform3fvEXT;
        /* 1440 */ PFNGLPROGRAMUNIFORM4FVEXTPROC ProgramUniform4fvEXT;
        /* 1441 */ PFNGLPROGRAMUNIFORM1IVEXTPROC ProgramUniform1ivEXT;
        /* 1442 */ PFNGLPROGRAMUNIFORM2IVEXTPROC ProgramUniform2ivEXT;
        /* 1443 */ PFNGLPROGRAMUNIFORM3IVEXTPROC ProgramUniform3ivEXT;
        /* 1444 */ PFNGLPROGRAMUNIFORM4IVEXTPROC ProgramUniform4ivEXT;
        /* 1445 */ PFNGLPROGRAMUNIFORMMATRIX2FVEXTPROC ProgramUniformMatrix2fvEXT;
        /* 1446 */ PFNGLPROGRAMUNIFORMMATRIX3FVEXTPROC ProgramUniformMatrix3fvEXT;
        /* 1447 */ PFNGLPROGRAMUNIFORMMATRIX4FVEXTPROC ProgramUniformMatrix4fvEXT;
        /* 1448 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVEXTPROC ProgramUniformMatrix2x3fvEXT;
        /* 1449 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVEXTPROC ProgramUniformMatrix3x2fvEXT;
        /* 1450 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVEXTPROC ProgramUniformMatrix2x4fvEXT;
        /* 1451 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVEXTPROC ProgramUniformMatrix4x2fvEXT;
        /* 1452 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVEXTPROC ProgramUniformMatrix3x4fvEXT;
        /* 1453 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVEXTPROC ProgramUniformMatrix4x3fvEXT;
        /* 1454 */ PFNGLTEXTUREBUFFEREXTPROC TextureBufferEXT;
        /* 1455 */ PFNGLMULTITEXBUFFEREXTPROC MultiTexBufferEXT;
        /* 1456 */ PFNGLTEXTUREPARAMETERIIVEXTPROC TextureParameterIivEXT;
        /* 1457 */ PFNGLTEXTUREPARAMETERIUIVEXTPROC TextureParameterIuivEXT;
        /* 1458 */ PFNGLGETTEXTUREPARAMETERIIVEXTPROC GetTextureParameterIivEXT;
        /* 1459 */ PFNGLGETTEXTUREPARAMETERIUIVEXTPROC GetTextureParameterIuivEXT;
        /* 1460 */ PFNGLMULTITEXPARAMETERIIVEXTPROC MultiTexParameterIivEXT;
        /* 1461 */ PFNGLMULTITEXPARAMETERIUIVEXTPROC MultiTexParameterIuivEXT;
        /* 1462 */ PFNGLGETMULTITEXPARAMETERIIVEXTPROC GetMultiTexParameterIivEXT;
        /* 1463 */ PFNGLGETMULTITEXPARAMETERIUIVEXTPROC GetMultiTexParameterIuivEXT;
        /* 1464 */ PFNGLPROGRAMUNIFORM1UIEXTPROC ProgramUniform1uiEXT;
        /* 1465 */ PFNGLPROGRAMUNIFORM2UIEXTPROC ProgramUniform2uiEXT;
        /* 1466 */ PFNGLPROGRAMUNIFORM3UIEXTPROC ProgramUniform3uiEXT;
        /* 1467 */ PFNGLPROGRAMUNIFORM4UIEXTPROC ProgramUniform4uiEXT;
        /* 1468 */ PFNGLPROGRAMUNIFORM1UIVEXTPROC ProgramUniform1uivEXT;
        /* 1469 */ PFNGLPROGRAMUNIFORM2UIVEXTPROC ProgramUniform2uivEXT;
        /* 1470 */ PFNGLPROGRAMUNIFORM3UIVEXTPROC ProgramUniform3uivEXT;
        /* 1471 */ PFNGLPROGRAMUNIFORM4UIVEXTPROC ProgramUniform4uivEXT;
        /* 1472 */ PFNGLNAMEDPROGRAMLOCALPARAMETERS4FVEXTPROC NamedProgramLocalParameters4fvEXT;
        /* 1473 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IEXTPROC NamedProgramLocalParameterI4iEXT;
        /* 1474 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IVEXTPROC NamedProgramLocalParameterI4ivEXT;
        /* 1475 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4IVEXTPROC NamedProgramLocalParametersI4ivEXT;
        /* 1476 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIEXTPROC NamedProgramLocalParameterI4uiEXT;
        /* 1477 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIVEXTPROC NamedProgramLocalParameterI4uivEXT;
        /* 1478 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4UIVEXTPROC NamedProgramLocalParametersI4uivEXT;
        /* 1479 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIIVEXTPROC GetNamedProgramLocalParameterIivEXT;
        /* 1480 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIUIVEXTPROC GetNamedProgramLocalParameterIuivEXT;
        /* 1481 */ PFNGLENABLECLIENTSTATEIEXTPROC EnableClientStateiEXT;
        /* 1482 */ PFNGLDISABLECLIENTSTATEIEXTPROC DisableClientStateiEXT;
        /* 1483 */ PFNGLGETFLOATI_VEXTPROC GetFloati_vEXT;
        /* 1484 */ PFNGLGETDOUBLEI_VEXTPROC GetDoublei_vEXT;
        /* 1485 */ PFNGLGETPOINTERI_VEXTPROC GetPointeri_vEXT;
        /* 1486 */ PFNGLNAMEDPROGRAMSTRINGEXTPROC NamedProgramStringEXT;
        /* 1487 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DEXTPROC NamedProgramLocalParameter4dEXT;
        /* 1488 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DVEXTPROC NamedProgramLocalParameter4dvEXT;
        /* 1489 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FEXTPROC NamedProgramLocalParameter4fEXT;
        /* 1490 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FVEXTPROC NamedProgramLocalParameter4fvEXT;
        /* 1491 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERDVEXTPROC GetNamedProgramLocalParameterdvEXT;
        /* 1492 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERFVEXTPROC GetNamedProgramLocalParameterfvEXT;
        /* 1493 */ PFNGLGETNAMEDPROGRAMIVEXTPROC GetNamedProgramivEXT;
        /* 1494 */ PFNGLGETNAMEDPROGRAMSTRINGEXTPROC GetNamedProgramStringEXT;
        /* 1495 */ PFNGLNAMEDRENDERBUFFERSTORAGEEXTPROC NamedRenderbufferStorageEXT;
        /* 1496 */ PFNGLGETNAMEDRENDERBUFFERPARAMETERIVEXTPROC GetNamedRenderbufferParameterivEXT;
        /* 1497 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC NamedRenderbufferStorageMultisampleEXT;
        /* 1498 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLECOVERAGEEXTPROC NamedRenderbufferStorageMultisampleCoverageEXT;
        /* 1499 */ PFNGLCHECKNAMEDFRAMEBUFFERSTATUSEXTPROC CheckNamedFramebufferStatusEXT;
        /* 1500 */ PFNGLNAMEDFRAMEBUFFERTEXTURE1DEXTPROC NamedFramebufferTexture1DEXT;
        /* 1501 */ PFNGLNAMEDFRAMEBUFFERTEXTURE2DEXTPROC NamedFramebufferTexture2DEXT;
        /* 1502 */ PFNGLNAMEDFRAMEBUFFERTEXTURE3DEXTPROC NamedFramebufferTexture3DEXT;
        /* 1503 */ PFNGLNAMEDFRAMEBUFFERRENDERBUFFEREXTPROC NamedFramebufferRenderbufferEXT;
        /* 1504 */ PFNGLGETNAMEDFRAMEBUFFERATTACHMENTPARAMETERIVEXTPROC GetNamedFramebufferAttachmentParameterivEXT;
        /* 1505 */ PFNGLGENERATETEXTUREMIPMAPEXTPROC GenerateTextureMipmapEXT;
        /* 1506 */ PFNGLGENERATEMULTITEXMIPMAPEXTPROC GenerateMultiTexMipmapEXT;
        /* 1507 */ PFNGLFRAMEBUFFERDRAWBUFFEREXTPROC FramebufferDrawBufferEXT;
        /* 1508 */ PFNGLFRAMEBUFFERDRAWBUFFERSEXTPROC FramebufferDrawBuffersEXT;
        /* 1509 */ PFNGLFRAMEBUFFERREADBUFFEREXTPROC FramebufferReadBufferEXT;
        /* 1510 */ PFNGLGETFRAMEBUFFERPARAMETERIVEXTPROC GetFramebufferParameterivEXT;
        /* 1511 */ PFNGLNAMEDCOPYBUFFERSUBDATAEXTPROC NamedCopyBufferSubDataEXT;
        /* 1512 */ PFNGLNAMEDFRAMEBUFFERTEXTUREEXTPROC NamedFramebufferTextureEXT;
        /* 1513 */ PFNGLNAMEDFRAMEBUFFERTEXTURELAYEREXTPROC NamedFramebufferTextureLayerEXT;
        /* 1514 */ PFNGLNAMEDFRAMEBUFFERTEXTUREFACEEXTPROC NamedFramebufferTextureFaceEXT;
        /* 1515 */ PFNGLTEXTURERENDERBUFFEREXTPROC TextureRenderbufferEXT;
        /* 1516 */ PFNGLMULTITEXRENDERBUFFEREXTPROC MultiTexRenderbufferEXT;
        /* 1517 */ PFNGLVERTEXARRAYVERTEXOFFSETEXTPROC VertexArrayVertexOffsetEXT;
        /* 1518 */ PFNGLVERTEXARRAYCOLOROFFSETEXTPROC VertexArrayColorOffsetEXT;
        /* 1519 */ PFNGLVERTEXARRAYEDGEFLAGOFFSETEXTPROC VertexArrayEdgeFlagOffsetEXT;
        /* 1520 */ PFNGLVERTEXARRAYINDEXOFFSETEXTPROC VertexArrayIndexOffsetEXT;
        /* 1521 */ PFNGLVERTEXARRAYNORMALOFFSETEXTPROC VertexArrayNormalOffsetEXT;
        /* 1522 */ PFNGLVERTEXARRAYTEXCOORDOFFSETEXTPROC VertexArrayTexCoordOffsetEXT;
        /* 1523 */ PFNGLVERTEXARRAYMULTITEXCOORDOFFSETEXTPROC VertexArrayMultiTexCoordOffsetEXT;
        /* 1524 */ PFNGLVERTEXARRAYFOGCOORDOFFSETEXTPROC VertexArrayFogCoordOffsetEXT;
        /* 1525 */ PFNGLVERTEXARRAYSECONDARYCOLOROFFSETEXTPROC VertexArraySecondaryColorOffsetEXT;
        /* 1526 */ PFNGLVERTEXARRAYVERTEXATTRIBOFFSETEXTPROC VertexArrayVertexAttribOffsetEXT;
        /* 1527 */ PFNGLVERTEXARRAYVERTEXATTRIBIOFFSETEXTPROC VertexArrayVertexAttribIOffsetEXT;
        /* 1528 */ PFNGLENABLEVERTEXARRAYEXTPROC EnableVertexArrayEXT;
        /* 1529 */ PFNGLDISABLEVERTEXARRAYEXTPROC DisableVertexArrayEXT;
        /* 1530 */ PFNGLENABLEVERTEXARRAYATTRIBEXTPROC EnableVertexArrayAttribEXT;
        /* 1531 */ PFNGLDISABLEVERTEXARRAYATTRIBEXTPROC DisableVertexArrayAttribEXT;
        /* 1532 */ PFNGLGETVERTEXARRAYINTEGERVEXTPROC GetVertexArrayIntegervEXT;
        /* 1533 */ PFNGLGETVERTEXARRAYPOINTERVEXTPROC GetVertexArrayPointervEXT;
        /* 1534 */ PFNGLGETVERTEXARRAYINTEGERI_VEXTPROC GetVertexArrayIntegeri_vEXT;
        /* 1535 */ PFNGLGETVERTEXARRAYPOINTERI_VEXTPROC GetVertexArrayPointeri_vEXT;
        /* 1536 */ PFNGLMAPNAMEDBUFFERRANGEEXTPROC MapNamedBufferRangeEXT;
        /* 1537 */ PFNGLFLUSHMAPPEDNAMEDBUFFERRANGEEXTPROC FlushMappedNamedBufferRangeEXT;
        /* 1538 */ PFNGLNAMEDBUFFERSTORAGEEXTPROC NamedBufferStorageEXT;
        /* 1539 */ PFNGLCLEARNAMEDBUFFERDATAEXTPROC ClearNamedBufferDataEXT;
        /* 1540 */ PFNGLCLEARNAMEDBUFFERSUBDATAEXTPROC ClearNamedBufferSubDataEXT;
        /* 1541 */ PFNGLNAMEDFRAMEBUFFERPARAMETERIEXTPROC NamedFramebufferParameteriEXT;
        /* 1542 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERIVEXTPROC GetNamedFramebufferParameterivEXT;
        /* 1543 */ PFNGLPROGRAMUNIFORM1DEXTPROC ProgramUniform1dEXT;
        /* 1544 */ PFNGLPROGRAMUNIFORM2DEXTPROC ProgramUniform2dEXT;
        /* 1545 */ PFNGLPROGRAMUNIFORM3DEXTPROC ProgramUniform3dEXT;
        /* 1546 */ PFNGLPROGRAMUNIFORM4DEXTPROC ProgramUniform4dEXT;
        /* 1547 */ PFNGLPROGRAMUNIFORM1DVEXTPROC ProgramUniform1dvEXT;
        /* 1548 */ PFNGLPROGRAMUNIFORM2DVEXTPROC ProgramUniform2dvEXT;
        /* 1549 */ PFNGLPROGRAMUNIFORM3DVEXTPROC ProgramUniform3dvEXT;
        /* 1550 */ PFNGLPROGRAMUNIFORM4DVEXTPROC ProgramUniform4dvEXT;
        /* 1551 */ PFNGLPROGRAMUNIFORMMATRIX2DVEXTPROC ProgramUniformMatrix2dvEXT;
        /* 1552 */ PFNGLPROGRAMUNIFORMMATRIX3DVEXTPROC ProgramUniformMatrix3dvEXT;
        /* 1553 */ PFNGLPROGRAMUNIFORMMATRIX4DVEXTPROC ProgramUniformMatrix4dvEXT;
        /* 1554 */ PFNGLPROGRAMUNIFORMMATRIX2X3DVEXTPROC ProgramUniformMatrix2x3dvEXT;
        /* 1555 */ PFNGLPROGRAMUNIFORMMATRIX2X4DVEXTPROC ProgramUniformMatrix2x4dvEXT;
        /* 1556 */ PFNGLPROGRAMUNIFORMMATRIX3X2DVEXTPROC ProgramUniformMatrix3x2dvEXT;
        /* 1557 */ PFNGLPROGRAMUNIFORMMATRIX3X4DVEXTPROC ProgramUniformMatrix3x4dvEXT;
        /* 1558 */ PFNGLPROGRAMUNIFORMMATRIX4X2DVEXTPROC ProgramUniformMatrix4x2dvEXT;
        /* 1559 */ PFNGLPROGRAMUNIFORMMATRIX4X3DVEXTPROC ProgramUniformMatrix4x3dvEXT;
        /* 1560 */ PFNGLTEXTUREBUFFERRANGEEXTPROC TextureBufferRangeEXT;
        /* 1561 */ PFNGLTEXTURESTORAGE1DEXTPROC TextureStorage1DEXT;
        /* 1562 */ PFNGLTEXTURESTORAGE2DEXTPROC TextureStorage2DEXT;
        /* 1563 */ PFNGLTEXTURESTORAGE3DEXTPROC TextureStorage3DEXT;
        /* 1564 */ PFNGLTEXTURESTORAGE2DMULTISAMPLEEXTPROC TextureStorage2DMultisampleEXT;
        /* 1565 */ PFNGLTEXTURESTORAGE3DMULTISAMPLEEXTPROC TextureStorage3DMultisampleEXT;
        /* 1566 */ PFNGLVERTEXARRAYBINDVERTEXBUFFEREXTPROC VertexArrayBindVertexBufferEXT;
        /* 1567 */ PFNGLVERTEXARRAYVERTEXATTRIBFORMATEXTPROC VertexArrayVertexAttribFormatEXT;
        /* 1568 */ PFNGLVERTEXARRAYVERTEXATTRIBIFORMATEXTPROC VertexArrayVertexAttribIFormatEXT;
        /* 1569 */ PFNGLVERTEXARRAYVERTEXATTRIBLFORMATEXTPROC VertexArrayVertexAttribLFormatEXT;
        /* 1570 */ PFNGLVERTEXARRAYVERTEXATTRIBBINDINGEXTPROC VertexArrayVertexAttribBindingEXT;
        /* 1571 */ PFNGLVERTEXARRAYVERTEXBINDINGDIVISOREXTPROC VertexArrayVertexBindingDivisorEXT;
        /* 1572 */ PFNGLVERTEXARRAYVERTEXATTRIBLOFFSETEXTPROC VertexArrayVertexAttribLOffsetEXT;
        /* 1573 */ PFNGLTEXTUREPAGECOMMITMENTEXTPROC TexturePageCommitmentEXT;
        /* 1574 */ PFNGLVERTEXARRAYVERTEXATTRIBDIVISOREXTPROC VertexArrayVertexAttribDivisorEXT;
        /* 1575 */ PFNGLDISCARDFRAMEBUFFEREXTPROC DiscardFramebufferEXT;
        /* 1576 */ PFNGLGENQUERIESEXTPROC GenQueriesEXT;
        /* 1577 */ PFNGLDELETEQUERIESEXTPROC DeleteQueriesEXT;
        /* 1578 */ PFNGLISQUERYEXTPROC IsQueryEXT;
        /* 1579 */ PFNGLBEGINQUERYEXTPROC BeginQueryEXT;
        /* 1580 */ PFNGLENDQUERYEXTPROC EndQueryEXT;
        /* 1581 */ PFNGLQUERYCOUNTEREXTPROC QueryCounterEXT;
        /* 1582 */ PFNGLGETQUERYIVEXTPROC GetQueryivEXT;
        /* 1583 */ PFNGLGETQUERYOBJECTIVEXTPROC GetQueryObjectivEXT;
        /* 1584 */ PFNGLGETQUERYOBJECTUIVEXTPROC GetQueryObjectuivEXT;
        /* 1585 */ PFNGLGETQUERYOBJECTI64VEXTPROC GetQueryObjecti64vEXT;
        /* 1586 */ PFNGLGETQUERYOBJECTUI64VEXTPROC GetQueryObjectui64vEXT;
        /* 1587 */ PFNGLGETINTEGER64VEXTPROC GetInteger64vEXT;
        /* 1588 */ PFNGLDRAWBUFFERSEXTPROC DrawBuffersEXT;
        /* 1589 */ PFNGLCOLORMASKINDEXEDEXTPROC ColorMaskIndexedEXT;
        /* 1590 */ PFNGLENABLEIEXTPROC EnableiEXT;
        /* 1591 */ PFNGLDISABLEIEXTPROC DisableiEXT;
        /* 1592 */ PFNGLBLENDEQUATIONIEXTPROC BlendEquationiEXT;
        /* 1593 */ PFNGLBLENDEQUATIONSEPARATEIEXTPROC BlendEquationSeparateiEXT;
        /* 1594 */ PFNGLBLENDFUNCIEXTPROC BlendFunciEXT;
        /* 1595 */ PFNGLBLENDFUNCSEPARATEIEXTPROC BlendFuncSeparateiEXT;
        /* 1596 */ PFNGLCOLORMASKIEXTPROC ColorMaskiEXT;
        /* 1597 */ PFNGLISENABLEDIEXTPROC IsEnablediEXT;
        /* 1598 */ PFNGLDRAWELEMENTSBASEVERTEXEXTPROC DrawElementsBaseVertexEXT;
        /* 1599 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXEXTPROC DrawRangeElementsBaseVertexEXT;
        /* 1600 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXEXTPROC DrawElementsInstancedBaseVertexEXT;
        /* 1601 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXEXTPROC MultiDrawElementsBaseVertexEXT;
        /* 1602 */ PFNGLDRAWARRAYSINSTANCEDEXTPROC DrawArraysInstancedEXT;
        /* 1603 */ PFNGLDRAWELEMENTSINSTANCEDEXTPROC DrawElementsInstancedEXT;
        /* 1604 */ PFNGLDRAWRANGEELEMENTSEXTPROC DrawRangeElementsEXT;
        /* 1605 */ PFNGLDRAWTRANSFORMFEEDBACKEXTPROC DrawTransformFeedbackEXT;
        /* 1606 */ PFNGLDRAWTRANSFORMFEEDBACKINSTANCEDEXTPROC DrawTransformFeedbackInstancedEXT;
        /* 1607 */ PFNGLBUFFERSTORAGEEXTERNALEXTPROC BufferStorageExternalEXT;
        /* 1608 */ PFNGLNAMEDBUFFERSTORAGEEXTERNALEXTPROC NamedBufferStorageExternalEXT;
        /* 1609 */ PFNGLFOGCOORDFEXTPROC FogCoordfEXT;
        /* 1610 */ PFNGLFOGCOORDFVEXTPROC FogCoordfvEXT;
        /* 1611 */ PFNGLFOGCOORDDEXTPROC FogCoorddEXT;
        /* 1612 */ PFNGLFOGCOORDDVEXTPROC FogCoorddvEXT;
        /* 1613 */ PFNGLFOGCOORDPOINTEREXTPROC FogCoordPointerEXT;
        /* 1614 */ PFNGLGETFRAGMENTSHADINGRATESEXTPROC GetFragmentShadingRatesEXT;
        /* 1615 */ PFNGLSHADINGRATEEXTPROC ShadingRateEXT;
        /* 1616 */ PFNGLSHADINGRATECOMBINEROPSEXTPROC ShadingRateCombinerOpsEXT;
        /* 1617 */ PFNGLFRAMEBUFFERSHADINGRATEEXTPROC FramebufferShadingRateEXT;
        /* 1618 */ PFNGLBLITFRAMEBUFFEREXTPROC BlitFramebufferEXT;
        /* 1619 */ PFNGLBLITFRAMEBUFFERLAYERSEXTPROC BlitFramebufferLayersEXT;
        /* 1620 */ PFNGLBLITFRAMEBUFFERLAYEREXTPROC BlitFramebufferLayerEXT;
        /* 1621 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC RenderbufferStorageMultisampleEXT;
        /* 1622 */ PFNGLISRENDERBUFFEREXTPROC IsRenderbufferEXT;
        /* 1623 */ PFNGLBINDRENDERBUFFEREXTPROC BindRenderbufferEXT;
        /* 1624 */ PFNGLDELETERENDERBUFFERSEXTPROC DeleteRenderbuffersEXT;
        /* 1625 */ PFNGLGENRENDERBUFFERSEXTPROC GenRenderbuffersEXT;
        /* 1626 */ PFNGLRENDERBUFFERSTORAGEEXTPROC RenderbufferStorageEXT;
        /* 1627 */ PFNGLGETRENDERBUFFERPARAMETERIVEXTPROC GetRenderbufferParameterivEXT;
        /* 1628 */ PFNGLISFRAMEBUFFEREXTPROC IsFramebufferEXT;
        /* 1629 */ PFNGLBINDFRAMEBUFFEREXTPROC BindFramebufferEXT;
        /* 1630 */ PFNGLDELETEFRAMEBUFFERSEXTPROC DeleteFramebuffersEXT;
        /* 1631 */ PFNGLGENFRAMEBUFFERSEXTPROC GenFramebuffersEXT;
        /* 1632 */ PFNGLCHECKFRAMEBUFFERSTATUSEXTPROC CheckFramebufferStatusEXT;
        /* 1633 */ PFNGLFRAMEBUFFERTEXTURE1DEXTPROC FramebufferTexture1DEXT;
        /* 1634 */ PFNGLFRAMEBUFFERTEXTURE2DEXTPROC FramebufferTexture2DEXT;
        /* 1635 */ PFNGLFRAMEBUFFERTEXTURE3DEXTPROC FramebufferTexture3DEXT;
        /* 1636 */ PFNGLFRAMEBUFFERRENDERBUFFEREXTPROC FramebufferRenderbufferEXT;
        /* 1637 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVEXTPROC GetFramebufferAttachmentParameterivEXT;
        /* 1638 */ PFNGLGENERATEMIPMAPEXTPROC GenerateMipmapEXT;
        /* 1639 */ PFNGLFRAMEBUFFERTEXTUREEXTPROC FramebufferTextureEXT;
        /* 1640 */ PFNGLPROGRAMPARAMETERIEXTPROC ProgramParameteriEXT;
        /* 1641 */ PFNGLPROGRAMENVPARAMETERS4FVEXTPROC ProgramEnvParameters4fvEXT;
        /* 1642 */ PFNGLPROGRAMLOCALPARAMETERS4FVEXTPROC ProgramLocalParameters4fvEXT;
        /* 1643 */ PFNGLGETUNIFORMUIVEXTPROC GetUniformuivEXT;
        /* 1644 */ PFNGLGETFRAGDATALOCATIONEXTPROC GetFragDataLocationEXT;
        /* 1645 */ PFNGLUNIFORM1UIEXTPROC Uniform1uiEXT;
        /* 1646 */ PFNGLUNIFORM2UIEXTPROC Uniform2uiEXT;
        /* 1647 */ PFNGLUNIFORM3UIEXTPROC Uniform3uiEXT;
        /* 1648 */ PFNGLUNIFORM4UIEXTPROC Uniform4uiEXT;
        /* 1649 */ PFNGLUNIFORM1UIVEXTPROC Uniform1uivEXT;
        /* 1650 */ PFNGLUNIFORM2UIVEXTPROC Uniform2uivEXT;
        /* 1651 */ PFNGLUNIFORM3UIVEXTPROC Uniform3uivEXT;
        /* 1652 */ PFNGLUNIFORM4UIVEXTPROC Uniform4uivEXT;
        /* 1653 */ PFNGLVERTEXATTRIBI1IEXTPROC VertexAttribI1iEXT;
        /* 1654 */ PFNGLVERTEXATTRIBI2IEXTPROC VertexAttribI2iEXT;
        /* 1655 */ PFNGLVERTEXATTRIBI3IEXTPROC VertexAttribI3iEXT;
        /* 1656 */ PFNGLVERTEXATTRIBI4IEXTPROC VertexAttribI4iEXT;
        /* 1657 */ PFNGLVERTEXATTRIBI1UIEXTPROC VertexAttribI1uiEXT;
        /* 1658 */ PFNGLVERTEXATTRIBI2UIEXTPROC VertexAttribI2uiEXT;
        /* 1659 */ PFNGLVERTEXATTRIBI3UIEXTPROC VertexAttribI3uiEXT;
        /* 1660 */ PFNGLVERTEXATTRIBI4UIEXTPROC VertexAttribI4uiEXT;
        /* 1661 */ PFNGLVERTEXATTRIBI1IVEXTPROC VertexAttribI1ivEXT;
        /* 1662 */ PFNGLVERTEXATTRIBI2IVEXTPROC VertexAttribI2ivEXT;
        /* 1663 */ PFNGLVERTEXATTRIBI3IVEXTPROC VertexAttribI3ivEXT;
        /* 1664 */ PFNGLVERTEXATTRIBI4IVEXTPROC VertexAttribI4ivEXT;
        /* 1665 */ PFNGLVERTEXATTRIBI1UIVEXTPROC VertexAttribI1uivEXT;
        /* 1666 */ PFNGLVERTEXATTRIBI2UIVEXTPROC VertexAttribI2uivEXT;
        /* 1667 */ PFNGLVERTEXATTRIBI3UIVEXTPROC VertexAttribI3uivEXT;
        /* 1668 */ PFNGLVERTEXATTRIBI4UIVEXTPROC VertexAttribI4uivEXT;
        /* 1669 */ PFNGLVERTEXATTRIBI4BVEXTPROC VertexAttribI4bvEXT;
        /* 1670 */ PFNGLVERTEXATTRIBI4SVEXTPROC VertexAttribI4svEXT;
        /* 1671 */ PFNGLVERTEXATTRIBI4UBVEXTPROC VertexAttribI4ubvEXT;
        /* 1672 */ PFNGLVERTEXATTRIBI4USVEXTPROC VertexAttribI4usvEXT;
        /* 1673 */ PFNGLVERTEXATTRIBIPOINTEREXTPROC VertexAttribIPointerEXT;
        /* 1674 */ PFNGLGETVERTEXATTRIBIIVEXTPROC GetVertexAttribIivEXT;
        /* 1675 */ PFNGLGETVERTEXATTRIBIUIVEXTPROC GetVertexAttribIuivEXT;
        /* 1676 */ PFNGLGETHISTOGRAMEXTPROC GetHistogramEXT;
        /* 1677 */ PFNGLGETHISTOGRAMPARAMETERFVEXTPROC GetHistogramParameterfvEXT;
        /* 1678 */ PFNGLGETHISTOGRAMPARAMETERIVEXTPROC GetHistogramParameterivEXT;
        /* 1679 */ PFNGLGETMINMAXEXTPROC GetMinmaxEXT;
        /* 1680 */ PFNGLGETMINMAXPARAMETERFVEXTPROC GetMinmaxParameterfvEXT;
        /* 1681 */ PFNGLGETMINMAXPARAMETERIVEXTPROC GetMinmaxParameterivEXT;
        /* 1682 */ PFNGLHISTOGRAMEXTPROC HistogramEXT;
        /* 1683 */ PFNGLMINMAXEXTPROC MinmaxEXT;
        /* 1684 */ PFNGLRESETHISTOGRAMEXTPROC ResetHistogramEXT;
        /* 1685 */ PFNGLRESETMINMAXEXTPROC ResetMinmaxEXT;
        /* 1686 */ PFNGLINDEXFUNCEXTPROC IndexFuncEXT;
        /* 1687 */ PFNGLINDEXMATERIALEXTPROC IndexMaterialEXT;
        /* 1688 */ PFNGLVERTEXATTRIBDIVISOREXTPROC VertexAttribDivisorEXT;
        /* 1689 */ PFNGLAPPLYTEXTUREEXTPROC ApplyTextureEXT;
        /* 1690 */ PFNGLTEXTURELIGHTEXTPROC TextureLightEXT;
        /* 1691 */ PFNGLTEXTUREMATERIALEXTPROC TextureMaterialEXT;
        /* 1692 */ PFNGLMAPBUFFERRANGEEXTPROC MapBufferRangeEXT;
        /* 1693 */ PFNGLFLUSHMAPPEDBUFFERRANGEEXTPROC FlushMappedBufferRangeEXT;
        /* 1694 */ PFNGLGETUNSIGNEDBYTEVEXTPROC GetUnsignedBytevEXT;
        /* 1695 */ PFNGLGETUNSIGNEDBYTEI_VEXTPROC GetUnsignedBytei_vEXT;
        /* 1696 */ PFNGLDELETEMEMORYOBJECTSEXTPROC DeleteMemoryObjectsEXT;
        /* 1697 */ PFNGLISMEMORYOBJECTEXTPROC IsMemoryObjectEXT;
        /* 1698 */ PFNGLCREATEMEMORYOBJECTSEXTPROC CreateMemoryObjectsEXT;
        /* 1699 */ PFNGLMEMORYOBJECTPARAMETERIVEXTPROC MemoryObjectParameterivEXT;
        /* 1700 */ PFNGLGETMEMORYOBJECTPARAMETERIVEXTPROC GetMemoryObjectParameterivEXT;
        /* 1701 */ PFNGLTEXSTORAGEMEM2DEXTPROC TexStorageMem2DEXT;
        /* 1702 */ PFNGLTEXSTORAGEMEM2DMULTISAMPLEEXTPROC TexStorageMem2DMultisampleEXT;
        /* 1703 */ PFNGLTEXSTORAGEMEM3DEXTPROC TexStorageMem3DEXT;
        /* 1704 */ PFNGLTEXSTORAGEMEM3DMULTISAMPLEEXTPROC TexStorageMem3DMultisampleEXT;
        /* 1705 */ PFNGLBUFFERSTORAGEMEMEXTPROC BufferStorageMemEXT;
        /* 1706 */ PFNGLTEXTURESTORAGEMEM2DEXTPROC TextureStorageMem2DEXT;
        /* 1707 */ PFNGLTEXTURESTORAGEMEM2DMULTISAMPLEEXTPROC TextureStorageMem2DMultisampleEXT;
        /* 1708 */ PFNGLTEXTURESTORAGEMEM3DEXTPROC TextureStorageMem3DEXT;
        /* 1709 */ PFNGLTEXTURESTORAGEMEM3DMULTISAMPLEEXTPROC TextureStorageMem3DMultisampleEXT;
        /* 1710 */ PFNGLNAMEDBUFFERSTORAGEMEMEXTPROC NamedBufferStorageMemEXT;
        /* 1711 */ PFNGLTEXSTORAGEMEM1DEXTPROC TexStorageMem1DEXT;
        /* 1712 */ PFNGLTEXTURESTORAGEMEM1DEXTPROC TextureStorageMem1DEXT;
        /* 1713 */ PFNGLIMPORTMEMORYFDEXTPROC ImportMemoryFdEXT;
        /* 1714 */ PFNGLIMPORTMEMORYWIN32HANDLEEXTPROC ImportMemoryWin32HandleEXT;
        /* 1715 */ PFNGLIMPORTMEMORYWIN32NAMEEXTPROC ImportMemoryWin32NameEXT;
        /* 1716 */ PFNGLDRAWMESHTASKSEXTPROC DrawMeshTasksEXT;
        /* 1717 */ PFNGLDRAWMESHTASKSINDIRECTEXTPROC DrawMeshTasksIndirectEXT;
        /* 1718 */ PFNGLMULTIDRAWMESHTASKSINDIRECTEXTPROC MultiDrawMeshTasksIndirectEXT;
        /* 1719 */ PFNGLMULTIDRAWMESHTASKSINDIRECTCOUNTEXTPROC MultiDrawMeshTasksIndirectCountEXT;
        /* 1720 */ PFNGLMULTIDRAWARRAYSEXTPROC MultiDrawArraysEXT;
        /* 1721 */ PFNGLMULTIDRAWELEMENTSEXTPROC MultiDrawElementsEXT;
        /* 1722 */ PFNGLMULTIDRAWARRAYSINDIRECTEXTPROC MultiDrawArraysIndirectEXT;
        /* 1723 */ PFNGLMULTIDRAWELEMENTSINDIRECTEXTPROC MultiDrawElementsIndirectEXT;
        /* 1724 */ PFNGLSAMPLEMASKEXTPROC SampleMaskEXT;
        /* 1725 */ PFNGLSAMPLEPATTERNEXTPROC SamplePatternEXT;
        /* 1726 */ PFNGLFRAMEBUFFERTEXTURE2DMULTISAMPLEEXTPROC FramebufferTexture2DMultisampleEXT;
        /* 1727 */ PFNGLREADBUFFERINDEXEDEXTPROC ReadBufferIndexedEXT;
        /* 1728 */ PFNGLDRAWBUFFERSINDEXEDEXTPROC DrawBuffersIndexedEXT;
        /* 1729 */ PFNGLGETINTEGERI_VEXTPROC GetIntegeri_vEXT;
        /* 1730 */ PFNGLCOLORTABLEEXTPROC ColorTableEXT;
        /* 1731 */ PFNGLGETCOLORTABLEEXTPROC GetColorTableEXT;
        /* 1732 */ PFNGLGETCOLORTABLEPARAMETERIVEXTPROC GetColorTableParameterivEXT;
        /* 1733 */ PFNGLGETCOLORTABLEPARAMETERFVEXTPROC GetColorTableParameterfvEXT;
        /* 1734 */ PFNGLPIXELTRANSFORMPARAMETERIEXTPROC PixelTransformParameteriEXT;
        /* 1735 */ PFNGLPIXELTRANSFORMPARAMETERFEXTPROC PixelTransformParameterfEXT;
        /* 1736 */ PFNGLPIXELTRANSFORMPARAMETERIVEXTPROC PixelTransformParameterivEXT;
        /* 1737 */ PFNGLPIXELTRANSFORMPARAMETERFVEXTPROC PixelTransformParameterfvEXT;
        /* 1738 */ PFNGLGETPIXELTRANSFORMPARAMETERIVEXTPROC GetPixelTransformParameterivEXT;
        /* 1739 */ PFNGLGETPIXELTRANSFORMPARAMETERFVEXTPROC GetPixelTransformParameterfvEXT;
        /* 1740 */ PFNGLPOINTPARAMETERFEXTPROC PointParameterfEXT;
        /* 1741 */ PFNGLPOINTPARAMETERFVEXTPROC PointParameterfvEXT;
        /* 1742 */ PFNGLPOLYGONOFFSETEXTPROC PolygonOffsetEXT;
        /* 1743 */ PFNGLPOLYGONOFFSETCLAMPEXTPROC PolygonOffsetClampEXT;
        /* 1744 */ PFNGLPRIMITIVEBOUNDINGBOXEXTPROC PrimitiveBoundingBoxEXT;
        /* 1745 */ PFNGLPROVOKINGVERTEXEXTPROC ProvokingVertexEXT;
        /* 1746 */ PFNGLRASTERSAMPLESEXTPROC RasterSamplesEXT;
        /* 1747 */ PFNGLGETGRAPHICSRESETSTATUSEXTPROC GetGraphicsResetStatusEXT;
        /* 1748 */ PFNGLREADNPIXELSEXTPROC ReadnPixelsEXT;
        /* 1749 */ PFNGLGETNUNIFORMFVEXTPROC GetnUniformfvEXT;
        /* 1750 */ PFNGLGETNUNIFORMIVEXTPROC GetnUniformivEXT;
        /* 1751 */ PFNGLGENSEMAPHORESEXTPROC GenSemaphoresEXT;
        /* 1752 */ PFNGLDELETESEMAPHORESEXTPROC DeleteSemaphoresEXT;
        /* 1753 */ PFNGLISSEMAPHOREEXTPROC IsSemaphoreEXT;
        /* 1754 */ PFNGLSEMAPHOREPARAMETERUI64VEXTPROC SemaphoreParameterui64vEXT;
        /* 1755 */ PFNGLGETSEMAPHOREPARAMETERUI64VEXTPROC GetSemaphoreParameterui64vEXT;
        /* 1756 */ PFNGLWAITSEMAPHOREEXTPROC WaitSemaphoreEXT;
        /* 1757 */ PFNGLSIGNALSEMAPHOREEXTPROC SignalSemaphoreEXT;
        /* 1758 */ PFNGLIMPORTSEMAPHOREFDEXTPROC ImportSemaphoreFdEXT;
        /* 1759 */ PFNGLIMPORTSEMAPHOREWIN32HANDLEEXTPROC ImportSemaphoreWin32HandleEXT;
        /* 1760 */ PFNGLIMPORTSEMAPHOREWIN32NAMEEXTPROC ImportSemaphoreWin32NameEXT;
        /* 1761 */ PFNGLSECONDARYCOLOR3BEXTPROC SecondaryColor3bEXT;
        /* 1762 */ PFNGLSECONDARYCOLOR3BVEXTPROC SecondaryColor3bvEXT;
        /* 1763 */ PFNGLSECONDARYCOLOR3DEXTPROC SecondaryColor3dEXT;
        /* 1764 */ PFNGLSECONDARYCOLOR3DVEXTPROC SecondaryColor3dvEXT;
        /* 1765 */ PFNGLSECONDARYCOLOR3FEXTPROC SecondaryColor3fEXT;
        /* 1766 */ PFNGLSECONDARYCOLOR3FVEXTPROC SecondaryColor3fvEXT;
        /* 1767 */ PFNGLSECONDARYCOLOR3IEXTPROC SecondaryColor3iEXT;
        /* 1768 */ PFNGLSECONDARYCOLOR3IVEXTPROC SecondaryColor3ivEXT;
        /* 1769 */ PFNGLSECONDARYCOLOR3SEXTPROC SecondaryColor3sEXT;
        /* 1770 */ PFNGLSECONDARYCOLOR3SVEXTPROC SecondaryColor3svEXT;
        /* 1771 */ PFNGLSECONDARYCOLOR3UBEXTPROC SecondaryColor3ubEXT;
        /* 1772 */ PFNGLSECONDARYCOLOR3UBVEXTPROC SecondaryColor3ubvEXT;
        /* 1773 */ PFNGLSECONDARYCOLOR3UIEXTPROC SecondaryColor3uiEXT;
        /* 1774 */ PFNGLSECONDARYCOLOR3UIVEXTPROC SecondaryColor3uivEXT;
        /* 1775 */ PFNGLSECONDARYCOLOR3USEXTPROC SecondaryColor3usEXT;
        /* 1776 */ PFNGLSECONDARYCOLOR3USVEXTPROC SecondaryColor3usvEXT;
        /* 1777 */ PFNGLSECONDARYCOLORPOINTEREXTPROC SecondaryColorPointerEXT;
        /* 1778 */ PFNGLUSESHADERPROGRAMEXTPROC UseShaderProgramEXT;
        /* 1779 */ PFNGLACTIVEPROGRAMEXTPROC ActiveProgramEXT;
        /* 1780 */ PFNGLCREATESHADERPROGRAMEXTPROC CreateShaderProgramEXT;
        /* 1781 */ PFNGLACTIVESHADERPROGRAMEXTPROC ActiveShaderProgramEXT;
        /* 1782 */ PFNGLBINDPROGRAMPIPELINEEXTPROC BindProgramPipelineEXT;
        /* 1783 */ PFNGLCREATESHADERPROGRAMVEXTPROC CreateShaderProgramvEXT;
        /* 1784 */ PFNGLDELETEPROGRAMPIPELINESEXTPROC DeleteProgramPipelinesEXT;
        /* 1785 */ PFNGLGENPROGRAMPIPELINESEXTPROC GenProgramPipelinesEXT;
        /* 1786 */ PFNGLGETPROGRAMPIPELINEINFOLOGEXTPROC GetProgramPipelineInfoLogEXT;
        /* 1787 */ PFNGLGETPROGRAMPIPELINEIVEXTPROC GetProgramPipelineivEXT;
        /* 1788 */ PFNGLISPROGRAMPIPELINEEXTPROC IsProgramPipelineEXT;
        /* 1789 */ PFNGLUSEPROGRAMSTAGESEXTPROC UseProgramStagesEXT;
        /* 1790 */ PFNGLVALIDATEPROGRAMPIPELINEEXTPROC ValidateProgramPipelineEXT;
        /* 1791 */ PFNGLFRAMEBUFFERFETCHBARRIEREXTPROC FramebufferFetchBarrierEXT;
        /* 1792 */ PFNGLBINDIMAGETEXTUREEXTPROC BindImageTextureEXT;
        /* 1793 */ PFNGLMEMORYBARRIEREXTPROC MemoryBarrierEXT;
        /* 1794 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGESIZEEXTPROC FramebufferPixelLocalStorageSizeEXT;
        /* 1795 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGESIZEEXTPROC GetFramebufferPixelLocalStorageSizeEXT;
        /* 1796 */ PFNGLCLEARPIXELLOCALSTORAGEUIEXTPROC ClearPixelLocalStorageuiEXT;
        /* 1797 */ PFNGLTEXPAGECOMMITMENTEXTPROC TexPageCommitmentEXT;
        /* 1798 */ PFNGLSTENCILCLEARTAGEXTPROC StencilClearTagEXT;
        /* 1799 */ PFNGLACTIVESTENCILFACEEXTPROC ActiveStencilFaceEXT;
        /* 1800 */ PFNGLTEXSUBIMAGE1DEXTPROC TexSubImage1DEXT;
        /* 1801 */ PFNGLTEXSUBIMAGE2DEXTPROC TexSubImage2DEXT;
        /* 1802 */ PFNGLPATCHPARAMETERIEXTPROC PatchParameteriEXT;
        /* 1803 */ PFNGLTEXIMAGE3DEXTPROC TexImage3DEXT;
        /* 1804 */ PFNGLTEXSUBIMAGE3DEXTPROC TexSubImage3DEXT;
        /* 1805 */ PFNGLFRAMEBUFFERTEXTURELAYEREXTPROC FramebufferTextureLayerEXT;
        /* 1806 */ PFNGLTEXPARAMETERIIVEXTPROC TexParameterIivEXT;
        /* 1807 */ PFNGLTEXPARAMETERIUIVEXTPROC TexParameterIuivEXT;
        /* 1808 */ PFNGLGETTEXPARAMETERIIVEXTPROC GetTexParameterIivEXT;
        /* 1809 */ PFNGLGETTEXPARAMETERIUIVEXTPROC GetTexParameterIuivEXT;
        /* 1810 */ PFNGLSAMPLERPARAMETERIIVEXTPROC SamplerParameterIivEXT;
        /* 1811 */ PFNGLSAMPLERPARAMETERIUIVEXTPROC SamplerParameterIuivEXT;
        /* 1812 */ PFNGLGETSAMPLERPARAMETERIIVEXTPROC GetSamplerParameterIivEXT;
        /* 1813 */ PFNGLGETSAMPLERPARAMETERIUIVEXTPROC GetSamplerParameterIuivEXT;
        /* 1814 */ PFNGLTEXBUFFEREXTPROC TexBufferEXT;
        /* 1815 */ PFNGLTEXBUFFERRANGEEXTPROC TexBufferRangeEXT;
        /* 1816 */ PFNGLCLEARCOLORIIEXTPROC ClearColorIiEXT;
        /* 1817 */ PFNGLCLEARCOLORIUIEXTPROC ClearColorIuiEXT;
        /* 1818 */ PFNGLARETEXTURESRESIDENTEXTPROC AreTexturesResidentEXT;
        /* 1819 */ PFNGLBINDTEXTUREEXTPROC BindTextureEXT;
        /* 1820 */ PFNGLDELETETEXTURESEXTPROC DeleteTexturesEXT;
        /* 1821 */ PFNGLGENTEXTURESEXTPROC GenTexturesEXT;
        /* 1822 */ PFNGLISTEXTUREEXTPROC IsTextureEXT;
        /* 1823 */ PFNGLPRIORITIZETEXTURESEXTPROC PrioritizeTexturesEXT;
        /* 1824 */ PFNGLTEXTURENORMALEXTPROC TextureNormalEXT;
        /* 1825 */ PFNGLTEXSTORAGE1DEXTPROC TexStorage1DEXT;
        /* 1826 */ PFNGLTEXSTORAGE2DEXTPROC TexStorage2DEXT;
        /* 1827 */ PFNGLTEXSTORAGE3DEXTPROC TexStorage3DEXT;
        /* 1828 */ PFNGLTEXSTORAGEATTRIBS2DEXTPROC TexStorageAttribs2DEXT;
        /* 1829 */ PFNGLTEXSTORAGEATTRIBS3DEXTPROC TexStorageAttribs3DEXT;
        /* 1830 */ PFNGLTEXTUREVIEWEXTPROC TextureViewEXT;
        /* 1831 */ PFNGLCREATESEMAPHORESNVPROC CreateSemaphoresNV;
        /* 1832 */ PFNGLSEMAPHOREPARAMETERIVNVPROC SemaphoreParameterivNV;
        /* 1833 */ PFNGLGETSEMAPHOREPARAMETERIVNVPROC GetSemaphoreParameterivNV;
        /* 1834 */ PFNGLBEGINTRANSFORMFEEDBACKEXTPROC BeginTransformFeedbackEXT;
        /* 1835 */ PFNGLENDTRANSFORMFEEDBACKEXTPROC EndTransformFeedbackEXT;
        /* 1836 */ PFNGLBINDBUFFERRANGEEXTPROC BindBufferRangeEXT;
        /* 1837 */ PFNGLBINDBUFFEROFFSETEXTPROC BindBufferOffsetEXT;
        /* 1838 */ PFNGLBINDBUFFERBASEEXTPROC BindBufferBaseEXT;
        /* 1839 */ PFNGLTRANSFORMFEEDBACKVARYINGSEXTPROC TransformFeedbackVaryingsEXT;
        /* 1840 */ PFNGLGETTRANSFORMFEEDBACKVARYINGEXTPROC GetTransformFeedbackVaryingEXT;
        /* 1841 */ PFNGLARRAYELEMENTEXTPROC ArrayElementEXT;
        /* 1842 */ PFNGLCOLORPOINTEREXTPROC ColorPointerEXT;
        /* 1843 */ PFNGLDRAWARRAYSEXTPROC DrawArraysEXT;
        /* 1844 */ PFNGLEDGEFLAGPOINTEREXTPROC EdgeFlagPointerEXT;
        /* 1845 */ PFNGLGETPOINTERVEXTPROC GetPointervEXT;
        /* 1846 */ PFNGLINDEXPOINTEREXTPROC IndexPointerEXT;
        /* 1847 */ PFNGLNORMALPOINTEREXTPROC NormalPointerEXT;
        /* 1848 */ PFNGLTEXCOORDPOINTEREXTPROC TexCoordPointerEXT;
        /* 1849 */ PFNGLVERTEXPOINTEREXTPROC VertexPointerEXT;
        /* 1850 */ PFNGLVERTEXATTRIBL1DEXTPROC VertexAttribL1dEXT;
        /* 1851 */ PFNGLVERTEXATTRIBL2DEXTPROC VertexAttribL2dEXT;
        /* 1852 */ PFNGLVERTEXATTRIBL3DEXTPROC VertexAttribL3dEXT;
        /* 1853 */ PFNGLVERTEXATTRIBL4DEXTPROC VertexAttribL4dEXT;
        /* 1854 */ PFNGLVERTEXATTRIBL1DVEXTPROC VertexAttribL1dvEXT;
        /* 1855 */ PFNGLVERTEXATTRIBL2DVEXTPROC VertexAttribL2dvEXT;
        /* 1856 */ PFNGLVERTEXATTRIBL3DVEXTPROC VertexAttribL3dvEXT;
        /* 1857 */ PFNGLVERTEXATTRIBL4DVEXTPROC VertexAttribL4dvEXT;
        /* 1858 */ PFNGLVERTEXATTRIBLPOINTEREXTPROC VertexAttribLPointerEXT;
        /* 1859 */ PFNGLGETVERTEXATTRIBLDVEXTPROC GetVertexAttribLdvEXT;
        /* 1860 */ PFNGLBEGINVERTEXSHADEREXTPROC BeginVertexShaderEXT;
        /* 1861 */ PFNGLENDVERTEXSHADEREXTPROC EndVertexShaderEXT;
        /* 1862 */ PFNGLBINDVERTEXSHADEREXTPROC BindVertexShaderEXT;
        /* 1863 */ PFNGLGENVERTEXSHADERSEXTPROC GenVertexShadersEXT;
        /* 1864 */ PFNGLDELETEVERTEXSHADEREXTPROC DeleteVertexShaderEXT;
        /* 1865 */ PFNGLSHADEROP1EXTPROC ShaderOp1EXT;
        /* 1866 */ PFNGLSHADEROP2EXTPROC ShaderOp2EXT;
        /* 1867 */ PFNGLSHADEROP3EXTPROC ShaderOp3EXT;
        /* 1868 */ PFNGLSWIZZLEEXTPROC SwizzleEXT;
        /* 1869 */ PFNGLWRITEMASKEXTPROC WriteMaskEXT;
        /* 1870 */ PFNGLINSERTCOMPONENTEXTPROC InsertComponentEXT;
        /* 1871 */ PFNGLEXTRACTCOMPONENTEXTPROC ExtractComponentEXT;
        /* 1872 */ PFNGLGENSYMBOLSEXTPROC GenSymbolsEXT;
        /* 1873 */ PFNGLSETINVARIANTEXTPROC SetInvariantEXT;
        /* 1874 */ PFNGLSETLOCALCONSTANTEXTPROC SetLocalConstantEXT;
        /* 1875 */ PFNGLVARIANTBVEXTPROC VariantbvEXT;
        /* 1876 */ PFNGLVARIANTSVEXTPROC VariantsvEXT;
        /* 1877 */ PFNGLVARIANTIVEXTPROC VariantivEXT;
        /* 1878 */ PFNGLVARIANTFVEXTPROC VariantfvEXT;
        /* 1879 */ PFNGLVARIANTDVEXTPROC VariantdvEXT;
        /* 1880 */ PFNGLVARIANTUBVEXTPROC VariantubvEXT;
        /* 1881 */ PFNGLVARIANTUSVEXTPROC VariantusvEXT;
        /* 1882 */ PFNGLVARIANTUIVEXTPROC VariantuivEXT;
        /* 1883 */ PFNGLVARIANTPOINTEREXTPROC VariantPointerEXT;
        /* 1884 */ PFNGLENABLEVARIANTCLIENTSTATEEXTPROC EnableVariantClientStateEXT;
        /* 1885 */ PFNGLDISABLEVARIANTCLIENTSTATEEXTPROC DisableVariantClientStateEXT;
        /* 1886 */ PFNGLBINDLIGHTPARAMETEREXTPROC BindLightParameterEXT;
        /* 1887 */ PFNGLBINDMATERIALPARAMETEREXTPROC BindMaterialParameterEXT;
        /* 1888 */ PFNGLBINDTEXGENPARAMETEREXTPROC BindTexGenParameterEXT;
        /* 1889 */ PFNGLBINDTEXTUREUNITPARAMETEREXTPROC BindTextureUnitParameterEXT;
        /* 1890 */ PFNGLBINDPARAMETEREXTPROC BindParameterEXT;
        /* 1891 */ PFNGLISVARIANTENABLEDEXTPROC IsVariantEnabledEXT;
        /* 1892 */ PFNGLGETVARIANTBOOLEANVEXTPROC GetVariantBooleanvEXT;
        /* 1893 */ PFNGLGETVARIANTINTEGERVEXTPROC GetVariantIntegervEXT;
        /* 1894 */ PFNGLGETVARIANTFLOATVEXTPROC GetVariantFloatvEXT;
        /* 1895 */ PFNGLGETVARIANTPOINTERVEXTPROC GetVariantPointervEXT;
        /* 1896 */ PFNGLGETINVARIANTBOOLEANVEXTPROC GetInvariantBooleanvEXT;
        /* 1897 */ PFNGLGETINVARIANTINTEGERVEXTPROC GetInvariantIntegervEXT;
        /* 1898 */ PFNGLGETINVARIANTFLOATVEXTPROC GetInvariantFloatvEXT;
        /* 1899 */ PFNGLGETLOCALCONSTANTBOOLEANVEXTPROC GetLocalConstantBooleanvEXT;
        /* 1900 */ PFNGLGETLOCALCONSTANTINTEGERVEXTPROC GetLocalConstantIntegervEXT;
        /* 1901 */ PFNGLGETLOCALCONSTANTFLOATVEXTPROC GetLocalConstantFloatvEXT;
        /* 1902 */ PFNGLVERTEXWEIGHTFEXTPROC VertexWeightfEXT;
        /* 1903 */ PFNGLVERTEXWEIGHTFVEXTPROC VertexWeightfvEXT;
        /* 1904 */ PFNGLVERTEXWEIGHTPOINTEREXTPROC VertexWeightPointerEXT;
        /* 1905 */ PFNGLACQUIREKEYEDMUTEXWIN32EXTPROC AcquireKeyedMutexWin32EXT;
        /* 1906 */ PFNGLRELEASEKEYEDMUTEXWIN32EXTPROC ReleaseKeyedMutexWin32EXT;
        /* 1907 */ PFNGLWINDOWRECTANGLESEXTPROC WindowRectanglesEXT;
        /* 1908 */ PFNGLIMPORTSYNCEXTPROC ImportSyncEXT;
        /* 1909 */ PFNGLFRAMETERMINATORGREMEDYPROC FrameTerminatorGREMEDY;
        /* 1910 */ PFNGLSTRINGMARKERGREMEDYPROC StringMarkerGREMEDY;
        /* 1911 */ PFNGLIMAGETRANSFORMPARAMETERIHPPROC ImageTransformParameteriHP;
        /* 1912 */ PFNGLIMAGETRANSFORMPARAMETERFHPPROC ImageTransformParameterfHP;
        /* 1913 */ PFNGLIMAGETRANSFORMPARAMETERIVHPPROC ImageTransformParameterivHP;
        /* 1914 */ PFNGLIMAGETRANSFORMPARAMETERFVHPPROC ImageTransformParameterfvHP;
        /* 1915 */ PFNGLGETIMAGETRANSFORMPARAMETERIVHPPROC GetImageTransformParameterivHP;
        /* 1916 */ PFNGLGETIMAGETRANSFORMPARAMETERFVHPPROC GetImageTransformParameterfvHP;
        /* 1917 */ PFNGLMULTIMODEDRAWARRAYSIBMPROC MultiModeDrawArraysIBM;
        /* 1918 */ PFNGLMULTIMODEDRAWELEMENTSIBMPROC MultiModeDrawElementsIBM;
        /* 1919 */ PFNGLFLUSHSTATICDATAIBMPROC FlushStaticDataIBM;
        /* 1920 */ PFNGLCOLORPOINTERLISTIBMPROC ColorPointerListIBM;
        /* 1921 */ PFNGLSECONDARYCOLORPOINTERLISTIBMPROC SecondaryColorPointerListIBM;
        /* 1922 */ PFNGLEDGEFLAGPOINTERLISTIBMPROC EdgeFlagPointerListIBM;
        /* 1923 */ PFNGLFOGCOORDPOINTERLISTIBMPROC FogCoordPointerListIBM;
        /* 1924 */ PFNGLINDEXPOINTERLISTIBMPROC IndexPointerListIBM;
        /* 1925 */ PFNGLNORMALPOINTERLISTIBMPROC NormalPointerListIBM;
        /* 1926 */ PFNGLTEXCOORDPOINTERLISTIBMPROC TexCoordPointerListIBM;
        /* 1927 */ PFNGLVERTEXPOINTERLISTIBMPROC VertexPointerListIBM;
        /* 1928 */ PFNGLGETTEXTUREHANDLEIMGPROC GetTextureHandleIMG;
        /* 1929 */ PFNGLGETTEXTURESAMPLERHANDLEIMGPROC GetTextureSamplerHandleIMG;
        /* 1930 */ PFNGLUNIFORMHANDLEUI64IMGPROC UniformHandleui64IMG;
        /* 1931 */ PFNGLUNIFORMHANDLEUI64VIMGPROC UniformHandleui64vIMG;
        /* 1932 */ PFNGLPROGRAMUNIFORMHANDLEUI64IMGPROC ProgramUniformHandleui64IMG;
        /* 1933 */ PFNGLPROGRAMUNIFORMHANDLEUI64VIMGPROC ProgramUniformHandleui64vIMG;
        /* 1934 */ PFNGLFRAMEBUFFERTEXTURE2DDOWNSAMPLEIMGPROC FramebufferTexture2DDownsampleIMG;
        /* 1935 */ PFNGLFRAMEBUFFERTEXTURELAYERDOWNSAMPLEIMGPROC FramebufferTextureLayerDownsampleIMG;
        /* 1936 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEIMGPROC RenderbufferStorageMultisampleIMG;
        /* 1937 */ PFNGLFRAMEBUFFERTEXTURE2DMULTISAMPLEIMGPROC FramebufferTexture2DMultisampleIMG;
        /* 1938 */ PFNGLBLENDFUNCSEPARATEINGRPROC BlendFuncSeparateINGR;
        /* 1939 */ PFNGLAPPLYFRAMEBUFFERATTACHMENTCMAAINTELPROC ApplyFramebufferAttachmentCMAAINTEL;
        /* 1940 */ PFNGLSYNCTEXTUREINTELPROC SyncTextureINTEL;
        /* 1941 */ PFNGLUNMAPTEXTURE2DINTELPROC UnmapTexture2DINTEL;
        /* 1942 */ PFNGLMAPTEXTURE2DINTELPROC MapTexture2DINTEL;
        /* 1943 */ PFNGLVERTEXPOINTERVINTELPROC VertexPointervINTEL;
        /* 1944 */ PFNGLNORMALPOINTERVINTELPROC NormalPointervINTEL;
        /* 1945 */ PFNGLCOLORPOINTERVINTELPROC ColorPointervINTEL;
        /* 1946 */ PFNGLTEXCOORDPOINTERVINTELPROC TexCoordPointervINTEL;
        /* 1947 */ PFNGLBEGINPERFQUERYINTELPROC BeginPerfQueryINTEL;
        /* 1948 */ PFNGLCREATEPERFQUERYINTELPROC CreatePerfQueryINTEL;
        /* 1949 */ PFNGLDELETEPERFQUERYINTELPROC DeletePerfQueryINTEL;
        /* 1950 */ PFNGLENDPERFQUERYINTELPROC EndPerfQueryINTEL;
        /* 1951 */ PFNGLGETFIRSTPERFQUERYIDINTELPROC GetFirstPerfQueryIdINTEL;
        /* 1952 */ PFNGLGETNEXTPERFQUERYIDINTELPROC GetNextPerfQueryIdINTEL;
        /* 1953 */ PFNGLGETPERFCOUNTERINFOINTELPROC GetPerfCounterInfoINTEL;
        /* 1954 */ PFNGLGETPERFQUERYDATAINTELPROC GetPerfQueryDataINTEL;
        /* 1955 */ PFNGLGETPERFQUERYIDBYNAMEINTELPROC GetPerfQueryIdByNameINTEL;
        /* 1956 */ PFNGLGETPERFQUERYINFOINTELPROC GetPerfQueryInfoINTEL;
        /* 1957 */ PFNGLBLENDBARRIERKHRPROC BlendBarrierKHR;
        /* 1958 */ PFNGLGETPOINTERVPROC GetPointerv;
        /* 1959 */ PFNGLDEBUGMESSAGECONTROLKHRPROC DebugMessageControlKHR;
        /* 1960 */ PFNGLDEBUGMESSAGEINSERTKHRPROC DebugMessageInsertKHR;
        /* 1961 */ PFNGLDEBUGMESSAGECALLBACKKHRPROC DebugMessageCallbackKHR;
        /* 1962 */ PFNGLGETDEBUGMESSAGELOGKHRPROC GetDebugMessageLogKHR;
        /* 1963 */ PFNGLPUSHDEBUGGROUPKHRPROC PushDebugGroupKHR;
        /* 1964 */ PFNGLPOPDEBUGGROUPKHRPROC PopDebugGroupKHR;
        /* 1965 */ PFNGLOBJECTLABELKHRPROC ObjectLabelKHR;
        /* 1966 */ PFNGLGETOBJECTLABELKHRPROC GetObjectLabelKHR;
        /* 1967 */ PFNGLOBJECTPTRLABELKHRPROC ObjectPtrLabelKHR;
        /* 1968 */ PFNGLGETOBJECTPTRLABELKHRPROC GetObjectPtrLabelKHR;
        /* 1969 */ PFNGLGETPOINTERVKHRPROC GetPointervKHR;
        /* 1970 */ PFNGLGETGRAPHICSRESETSTATUSKHRPROC GetGraphicsResetStatusKHR;
        /* 1971 */ PFNGLREADNPIXELSKHRPROC ReadnPixelsKHR;
        /* 1972 */ PFNGLGETNUNIFORMFVKHRPROC GetnUniformfvKHR;
        /* 1973 */ PFNGLGETNUNIFORMIVKHRPROC GetnUniformivKHR;
        /* 1974 */ PFNGLGETNUNIFORMUIVKHRPROC GetnUniformuivKHR;
        /* 1975 */ PFNGLMAXSHADERCOMPILERTHREADSKHRPROC MaxShaderCompilerThreadsKHR;
        /* 1976 */ PFNGLFRAMEBUFFERPARAMETERIMESAPROC FramebufferParameteriMESA;
        /* 1977 */ PFNGLGETFRAMEBUFFERPARAMETERIVMESAPROC GetFramebufferParameterivMESA;
        /* 1978 */ PFNGLADDCLIENTPOINTERRANGEMESAPROC AddClientPointerRangeMESA;
        /* 1979 */ PFNGLRELEASECLIENTPOINTERRANGEMESAPROC ReleaseClientPointerRangeMESA;
        /* 1980 */ PFNGLRESIZEBUFFERSMESAPROC ResizeBuffersMESA;
        /* 1981 */ PFNGLWINDOWPOS2DMESAPROC WindowPos2dMESA;
        /* 1982 */ PFNGLWINDOWPOS2DVMESAPROC WindowPos2dvMESA;
        /* 1983 */ PFNGLWINDOWPOS2FMESAPROC WindowPos2fMESA;
        /* 1984 */ PFNGLWINDOWPOS2FVMESAPROC WindowPos2fvMESA;
        /* 1985 */ PFNGLWINDOWPOS2IMESAPROC WindowPos2iMESA;
        /* 1986 */ PFNGLWINDOWPOS2IVMESAPROC WindowPos2ivMESA;
        /* 1987 */ PFNGLWINDOWPOS2SMESAPROC WindowPos2sMESA;
        /* 1988 */ PFNGLWINDOWPOS2SVMESAPROC WindowPos2svMESA;
        /* 1989 */ PFNGLWINDOWPOS3DMESAPROC WindowPos3dMESA;
        /* 1990 */ PFNGLWINDOWPOS3DVMESAPROC WindowPos3dvMESA;
        /* 1991 */ PFNGLWINDOWPOS3FMESAPROC WindowPos3fMESA;
        /* 1992 */ PFNGLWINDOWPOS3FVMESAPROC WindowPos3fvMESA;
        /* 1993 */ PFNGLWINDOWPOS3IMESAPROC WindowPos3iMESA;
        /* 1994 */ PFNGLWINDOWPOS3IVMESAPROC WindowPos3ivMESA;
        /* 1995 */ PFNGLWINDOWPOS3SMESAPROC WindowPos3sMESA;
        /* 1996 */ PFNGLWINDOWPOS3SVMESAPROC WindowPos3svMESA;
        /* 1997 */ PFNGLWINDOWPOS4DMESAPROC WindowPos4dMESA;
        /* 1998 */ PFNGLWINDOWPOS4DVMESAPROC WindowPos4dvMESA;
        /* 1999 */ PFNGLWINDOWPOS4FMESAPROC WindowPos4fMESA;
        /* 2000 */ PFNGLWINDOWPOS4FVMESAPROC WindowPos4fvMESA;
        /* 2001 */ PFNGLWINDOWPOS4IMESAPROC WindowPos4iMESA;
        /* 2002 */ PFNGLWINDOWPOS4IVMESAPROC WindowPos4ivMESA;
        /* 2003 */ PFNGLWINDOWPOS4SMESAPROC WindowPos4sMESA;
        /* 2004 */ PFNGLWINDOWPOS4SVMESAPROC WindowPos4svMESA;
        /* 2005 */ PFNGLBEGINCONDITIONALRENDERNVXPROC BeginConditionalRenderNVX;
        /* 2006 */ PFNGLENDCONDITIONALRENDERNVXPROC EndConditionalRenderNVX;
        /* 2007 */ PFNGLLGPUNAMEDBUFFERSUBDATANVXPROC LGPUNamedBufferSubDataNVX;
        /* 2008 */ PFNGLLGPUCOPYIMAGESUBDATANVXPROC LGPUCopyImageSubDataNVX;
        /* 2009 */ PFNGLLGPUINTERLOCKNVXPROC LGPUInterlockNVX;
        /* 2010 */ PFNGLALPHATOCOVERAGEDITHERCONTROLNVPROC AlphaToCoverageDitherControlNV;
        /* 2011 */ PFNGLMULTIDRAWARRAYSINDIRECTBINDLESSNVPROC MultiDrawArraysIndirectBindlessNV;
        /* 2012 */ PFNGLMULTIDRAWELEMENTSINDIRECTBINDLESSNVPROC MultiDrawElementsIndirectBindlessNV;
        /* 2013 */ PFNGLMULTIDRAWARRAYSINDIRECTBINDLESSCOUNTNVPROC MultiDrawArraysIndirectBindlessCountNV;
        /* 2014 */ PFNGLMULTIDRAWELEMENTSINDIRECTBINDLESSCOUNTNVPROC MultiDrawElementsIndirectBindlessCountNV;
        /* 2015 */ PFNGLGETTEXTUREHANDLENVPROC GetTextureHandleNV;
        /* 2016 */ PFNGLGETTEXTURESAMPLERHANDLENVPROC GetTextureSamplerHandleNV;
        /* 2017 */ PFNGLMAKETEXTUREHANDLERESIDENTNVPROC MakeTextureHandleResidentNV;
        /* 2018 */ PFNGLMAKETEXTUREHANDLENONRESIDENTNVPROC MakeTextureHandleNonResidentNV;
        /* 2019 */ PFNGLGETIMAGEHANDLENVPROC GetImageHandleNV;
        /* 2020 */ PFNGLMAKEIMAGEHANDLERESIDENTNVPROC MakeImageHandleResidentNV;
        /* 2021 */ PFNGLMAKEIMAGEHANDLENONRESIDENTNVPROC MakeImageHandleNonResidentNV;
        /* 2022 */ PFNGLUNIFORMHANDLEUI64NVPROC UniformHandleui64NV;
        /* 2023 */ PFNGLUNIFORMHANDLEUI64VNVPROC UniformHandleui64vNV;
        /* 2024 */ PFNGLPROGRAMUNIFORMHANDLEUI64NVPROC ProgramUniformHandleui64NV;
        /* 2025 */ PFNGLPROGRAMUNIFORMHANDLEUI64VNVPROC ProgramUniformHandleui64vNV;
        /* 2026 */ PFNGLISTEXTUREHANDLERESIDENTNVPROC IsTextureHandleResidentNV;
        /* 2027 */ PFNGLISIMAGEHANDLERESIDENTNVPROC IsImageHandleResidentNV;
        /* 2028 */ PFNGLBLENDPARAMETERINVPROC BlendParameteriNV;
        /* 2029 */ PFNGLBLENDBARRIERNVPROC BlendBarrierNV;
        /* 2030 */ PFNGLVIEWPORTPOSITIONWSCALENVPROC ViewportPositionWScaleNV;
        /* 2031 */ PFNGLCREATESTATESNVPROC CreateStatesNV;
        /* 2032 */ PFNGLDELETESTATESNVPROC DeleteStatesNV;
        /* 2033 */ PFNGLISSTATENVPROC IsStateNV;
        /* 2034 */ PFNGLSTATECAPTURENVPROC StateCaptureNV;
        /* 2035 */ PFNGLGETCOMMANDHEADERNVPROC GetCommandHeaderNV;
        /* 2036 */ PFNGLGETSTAGEINDEXNVPROC GetStageIndexNV;
        /* 2037 */ PFNGLDRAWCOMMANDSNVPROC DrawCommandsNV;
        /* 2038 */ PFNGLDRAWCOMMANDSADDRESSNVPROC DrawCommandsAddressNV;
        /* 2039 */ PFNGLDRAWCOMMANDSSTATESNVPROC DrawCommandsStatesNV;
        /* 2040 */ PFNGLDRAWCOMMANDSSTATESADDRESSNVPROC DrawCommandsStatesAddressNV;
        /* 2041 */ PFNGLCREATECOMMANDLISTSNVPROC CreateCommandListsNV;
        /* 2042 */ PFNGLDELETECOMMANDLISTSNVPROC DeleteCommandListsNV;
        /* 2043 */ PFNGLISCOMMANDLISTNVPROC IsCommandListNV;
        /* 2044 */ PFNGLLISTDRAWCOMMANDSSTATESCLIENTNVPROC ListDrawCommandsStatesClientNV;
        /* 2045 */ PFNGLCOMMANDLISTSEGMENTSNVPROC CommandListSegmentsNV;
        /* 2046 */ PFNGLCOMPILECOMMANDLISTNVPROC CompileCommandListNV;
        /* 2047 */ PFNGLCALLCOMMANDLISTNVPROC CallCommandListNV;
        /* 2048 */ PFNGLBEGINCONDITIONALRENDERNVPROC BeginConditionalRenderNV;
        /* 2049 */ PFNGLENDCONDITIONALRENDERNVPROC EndConditionalRenderNV;
        /* 2050 */ PFNGLSUBPIXELPRECISIONBIASNVPROC SubpixelPrecisionBiasNV;
        /* 2051 */ PFNGLCONSERVATIVERASTERPARAMETERFNVPROC ConservativeRasterParameterfNV;
        /* 2052 */ PFNGLCONSERVATIVERASTERPARAMETERINVPROC ConservativeRasterParameteriNV;
        /* 2053 */ PFNGLCOPYBUFFERSUBDATANVPROC CopyBufferSubDataNV;
        /* 2054 */ PFNGLCOPYIMAGESUBDATANVPROC CopyImageSubDataNV;
        /* 2055 */ PFNGLCOVERAGEMASKNVPROC CoverageMaskNV;
        /* 2056 */ PFNGLCOVERAGEOPERATIONNVPROC CoverageOperationNV;
        /* 2057 */ PFNGLDEPTHRANGEDNVPROC DepthRangedNV;
        /* 2058 */ PFNGLCLEARDEPTHDNVPROC ClearDepthdNV;
        /* 2059 */ PFNGLDEPTHBOUNDSDNVPROC DepthBoundsdNV;
        /* 2060 */ PFNGLDRAWBUFFERSNVPROC DrawBuffersNV;
        /* 2061 */ PFNGLDRAWARRAYSINSTANCEDNVPROC DrawArraysInstancedNV;
        /* 2062 */ PFNGLDRAWELEMENTSINSTANCEDNVPROC DrawElementsInstancedNV;
        /* 2063 */ PFNGLDRAWTEXTURENVPROC DrawTextureNV;
        /* 2064 */ PFNGLDRAWVKIMAGENVPROC DrawVkImageNV;
        /* 2065 */ PFNGLGETVKPROCADDRNVPROC GetVkProcAddrNV;
        /* 2066 */ PFNGLWAITVKSEMAPHORENVPROC WaitVkSemaphoreNV;
        /* 2067 */ PFNGLSIGNALVKSEMAPHORENVPROC SignalVkSemaphoreNV;
        /* 2068 */ PFNGLSIGNALVKFENCENVPROC SignalVkFenceNV;
        /* 2069 */ PFNGLMAPCONTROLPOINTSNVPROC MapControlPointsNV;
        /* 2070 */ PFNGLMAPPARAMETERIVNVPROC MapParameterivNV;
        /* 2071 */ PFNGLMAPPARAMETERFVNVPROC MapParameterfvNV;
        /* 2072 */ PFNGLGETMAPCONTROLPOINTSNVPROC GetMapControlPointsNV;
        /* 2073 */ PFNGLGETMAPPARAMETERIVNVPROC GetMapParameterivNV;
        /* 2074 */ PFNGLGETMAPPARAMETERFVNVPROC GetMapParameterfvNV;
        /* 2075 */ PFNGLGETMAPATTRIBPARAMETERIVNVPROC GetMapAttribParameterivNV;
        /* 2076 */ PFNGLGETMAPATTRIBPARAMETERFVNVPROC GetMapAttribParameterfvNV;
        /* 2077 */ PFNGLEVALMAPSNVPROC EvalMapsNV;
        /* 2078 */ PFNGLGETMULTISAMPLEFVNVPROC GetMultisamplefvNV;
        /* 2079 */ PFNGLSAMPLEMASKINDEXEDNVPROC SampleMaskIndexedNV;
        /* 2080 */ PFNGLTEXRENDERBUFFERNVPROC TexRenderbufferNV;
        /* 2081 */ PFNGLDELETEFENCESNVPROC DeleteFencesNV;
        /* 2082 */ PFNGLGENFENCESNVPROC GenFencesNV;
        /* 2083 */ PFNGLISFENCENVPROC IsFenceNV;
        /* 2084 */ PFNGLTESTFENCENVPROC TestFenceNV;
        /* 2085 */ PFNGLGETFENCEIVNVPROC GetFenceivNV;
        /* 2086 */ PFNGLFINISHFENCENVPROC FinishFenceNV;
        /* 2087 */ PFNGLSETFENCENVPROC SetFenceNV;
        /* 2088 */ PFNGLFRAGMENTCOVERAGECOLORNVPROC FragmentCoverageColorNV;
        /* 2089 */ PFNGLPROGRAMNAMEDPARAMETER4FNVPROC ProgramNamedParameter4fNV;
        /* 2090 */ PFNGLPROGRAMNAMEDPARAMETER4FVNVPROC ProgramNamedParameter4fvNV;
        /* 2091 */ PFNGLPROGRAMNAMEDPARAMETER4DNVPROC ProgramNamedParameter4dNV;
        /* 2092 */ PFNGLPROGRAMNAMEDPARAMETER4DVNVPROC ProgramNamedParameter4dvNV;
        /* 2093 */ PFNGLGETPROGRAMNAMEDPARAMETERFVNVPROC GetProgramNamedParameterfvNV;
        /* 2094 */ PFNGLGETPROGRAMNAMEDPARAMETERDVNVPROC GetProgramNamedParameterdvNV;
        /* 2095 */ PFNGLBLITFRAMEBUFFERNVPROC BlitFramebufferNV;
        /* 2096 */ PFNGLCOVERAGEMODULATIONTABLENVPROC CoverageModulationTableNV;
        /* 2097 */ PFNGLGETCOVERAGEMODULATIONTABLENVPROC GetCoverageModulationTableNV;
        /* 2098 */ PFNGLCOVERAGEMODULATIONNVPROC CoverageModulationNV;
        /* 2099 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLENVPROC RenderbufferStorageMultisampleNV;
        /* 2100 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLECOVERAGENVPROC RenderbufferStorageMultisampleCoverageNV;
        /* 2101 */ PFNGLPROGRAMVERTEXLIMITNVPROC ProgramVertexLimitNV;
        /* 2102 */ PFNGLFRAMEBUFFERTEXTUREFACEEXTPROC FramebufferTextureFaceEXT;
        /* 2103 */ PFNGLPROGRAMLOCALPARAMETERI4INVPROC ProgramLocalParameterI4iNV;
        /* 2104 */ PFNGLPROGRAMLOCALPARAMETERI4IVNVPROC ProgramLocalParameterI4ivNV;
        /* 2105 */ PFNGLPROGRAMLOCALPARAMETERSI4IVNVPROC ProgramLocalParametersI4ivNV;
        /* 2106 */ PFNGLPROGRAMLOCALPARAMETERI4UINVPROC ProgramLocalParameterI4uiNV;
        /* 2107 */ PFNGLPROGRAMLOCALPARAMETERI4UIVNVPROC ProgramLocalParameterI4uivNV;
        /* 2108 */ PFNGLPROGRAMLOCALPARAMETERSI4UIVNVPROC ProgramLocalParametersI4uivNV;
        /* 2109 */ PFNGLPROGRAMENVPARAMETERI4INVPROC ProgramEnvParameterI4iNV;
        /* 2110 */ PFNGLPROGRAMENVPARAMETERI4IVNVPROC ProgramEnvParameterI4ivNV;
        /* 2111 */ PFNGLPROGRAMENVPARAMETERSI4IVNVPROC ProgramEnvParametersI4ivNV;
        /* 2112 */ PFNGLPROGRAMENVPARAMETERI4UINVPROC ProgramEnvParameterI4uiNV;
        /* 2113 */ PFNGLPROGRAMENVPARAMETERI4UIVNVPROC ProgramEnvParameterI4uivNV;
        /* 2114 */ PFNGLPROGRAMENVPARAMETERSI4UIVNVPROC ProgramEnvParametersI4uivNV;
        /* 2115 */ PFNGLGETPROGRAMLOCALPARAMETERIIVNVPROC GetProgramLocalParameterIivNV;
        /* 2116 */ PFNGLGETPROGRAMLOCALPARAMETERIUIVNVPROC GetProgramLocalParameterIuivNV;
        /* 2117 */ PFNGLGETPROGRAMENVPARAMETERIIVNVPROC GetProgramEnvParameterIivNV;
        /* 2118 */ PFNGLGETPROGRAMENVPARAMETERIUIVNVPROC GetProgramEnvParameterIuivNV;
        /* 2119 */ PFNGLPROGRAMSUBROUTINEPARAMETERSUIVNVPROC ProgramSubroutineParametersuivNV;
        /* 2120 */ PFNGLGETPROGRAMSUBROUTINEPARAMETERUIVNVPROC GetProgramSubroutineParameteruivNV;
        /* 2121 */ PFNGLVERTEX2HNVPROC Vertex2hNV;
        /* 2122 */ PFNGLVERTEX2HVNVPROC Vertex2hvNV;
        /* 2123 */ PFNGLVERTEX3HNVPROC Vertex3hNV;
        /* 2124 */ PFNGLVERTEX3HVNVPROC Vertex3hvNV;
        /* 2125 */ PFNGLVERTEX4HNVPROC Vertex4hNV;
        /* 2126 */ PFNGLVERTEX4HVNVPROC Vertex4hvNV;
        /* 2127 */ PFNGLNORMAL3HNVPROC Normal3hNV;
        /* 2128 */ PFNGLNORMAL3HVNVPROC Normal3hvNV;
        /* 2129 */ PFNGLCOLOR3HNVPROC Color3hNV;
        /* 2130 */ PFNGLCOLOR3HVNVPROC Color3hvNV;
        /* 2131 */ PFNGLCOLOR4HNVPROC Color4hNV;
        /* 2132 */ PFNGLCOLOR4HVNVPROC Color4hvNV;
        /* 2133 */ PFNGLTEXCOORD1HNVPROC TexCoord1hNV;
        /* 2134 */ PFNGLTEXCOORD1HVNVPROC TexCoord1hvNV;
        /* 2135 */ PFNGLTEXCOORD2HNVPROC TexCoord2hNV;
        /* 2136 */ PFNGLTEXCOORD2HVNVPROC TexCoord2hvNV;
        /* 2137 */ PFNGLTEXCOORD3HNVPROC TexCoord3hNV;
        /* 2138 */ PFNGLTEXCOORD3HVNVPROC TexCoord3hvNV;
        /* 2139 */ PFNGLTEXCOORD4HNVPROC TexCoord4hNV;
        /* 2140 */ PFNGLTEXCOORD4HVNVPROC TexCoord4hvNV;
        /* 2141 */ PFNGLMULTITEXCOORD1HNVPROC MultiTexCoord1hNV;
        /* 2142 */ PFNGLMULTITEXCOORD1HVNVPROC MultiTexCoord1hvNV;
        /* 2143 */ PFNGLMULTITEXCOORD2HNVPROC MultiTexCoord2hNV;
        /* 2144 */ PFNGLMULTITEXCOORD2HVNVPROC MultiTexCoord2hvNV;
        /* 2145 */ PFNGLMULTITEXCOORD3HNVPROC MultiTexCoord3hNV;
        /* 2146 */ PFNGLMULTITEXCOORD3HVNVPROC MultiTexCoord3hvNV;
        /* 2147 */ PFNGLMULTITEXCOORD4HNVPROC MultiTexCoord4hNV;
        /* 2148 */ PFNGLMULTITEXCOORD4HVNVPROC MultiTexCoord4hvNV;
        /* 2149 */ PFNGLVERTEXATTRIB1HNVPROC VertexAttrib1hNV;
        /* 2150 */ PFNGLVERTEXATTRIB1HVNVPROC VertexAttrib1hvNV;
        /* 2151 */ PFNGLVERTEXATTRIB2HNVPROC VertexAttrib2hNV;
        /* 2152 */ PFNGLVERTEXATTRIB2HVNVPROC VertexAttrib2hvNV;
        /* 2153 */ PFNGLVERTEXATTRIB3HNVPROC VertexAttrib3hNV;
        /* 2154 */ PFNGLVERTEXATTRIB3HVNVPROC VertexAttrib3hvNV;
        /* 2155 */ PFNGLVERTEXATTRIB4HNVPROC VertexAttrib4hNV;
        /* 2156 */ PFNGLVERTEXATTRIB4HVNVPROC VertexAttrib4hvNV;
        /* 2157 */ PFNGLVERTEXATTRIBS1HVNVPROC VertexAttribs1hvNV;
        /* 2158 */ PFNGLVERTEXATTRIBS2HVNVPROC VertexAttribs2hvNV;
        /* 2159 */ PFNGLVERTEXATTRIBS3HVNVPROC VertexAttribs3hvNV;
        /* 2160 */ PFNGLVERTEXATTRIBS4HVNVPROC VertexAttribs4hvNV;
        /* 2161 */ PFNGLFOGCOORDHNVPROC FogCoordhNV;
        /* 2162 */ PFNGLFOGCOORDHVNVPROC FogCoordhvNV;
        /* 2163 */ PFNGLSECONDARYCOLOR3HNVPROC SecondaryColor3hNV;
        /* 2164 */ PFNGLSECONDARYCOLOR3HVNVPROC SecondaryColor3hvNV;
        /* 2165 */ PFNGLVERTEXWEIGHTHNVPROC VertexWeighthNV;
        /* 2166 */ PFNGLVERTEXWEIGHTHVNVPROC VertexWeighthvNV;
        /* 2167 */ PFNGLVERTEXATTRIBDIVISORNVPROC VertexAttribDivisorNV;
        /* 2168 */ PFNGLGETINTERNALFORMATSAMPLEIVNVPROC GetInternalformatSampleivNV;
        /* 2169 */ PFNGLRENDERGPUMASKNVPROC RenderGpuMaskNV;
        /* 2170 */ PFNGLMULTICASTBUFFERSUBDATANVPROC MulticastBufferSubDataNV;
        /* 2171 */ PFNGLMULTICASTCOPYBUFFERSUBDATANVPROC MulticastCopyBufferSubDataNV;
        /* 2172 */ PFNGLMULTICASTCOPYIMAGESUBDATANVPROC MulticastCopyImageSubDataNV;
        /* 2173 */ PFNGLMULTICASTBLITFRAMEBUFFERNVPROC MulticastBlitFramebufferNV;
        /* 2174 */ PFNGLMULTICASTFRAMEBUFFERSAMPLELOCATIONSFVNVPROC MulticastFramebufferSampleLocationsfvNV;
        /* 2175 */ PFNGLMULTICASTBARRIERNVPROC MulticastBarrierNV;
        /* 2176 */ PFNGLMULTICASTWAITSYNCNVPROC MulticastWaitSyncNV;
        /* 2177 */ PFNGLMULTICASTGETQUERYOBJECTIVNVPROC MulticastGetQueryObjectivNV;
        /* 2178 */ PFNGLMULTICASTGETQUERYOBJECTUIVNVPROC MulticastGetQueryObjectuivNV;
        /* 2179 */ PFNGLMULTICASTGETQUERYOBJECTI64VNVPROC MulticastGetQueryObjecti64vNV;
        /* 2180 */ PFNGLMULTICASTGETQUERYOBJECTUI64VNVPROC MulticastGetQueryObjectui64vNV;
        /* 2181 */ PFNGLUPLOADGPUMASKNVXPROC UploadGpuMaskNVX;
        /* 2182 */ PFNGLMULTICASTVIEWPORTARRAYVNVXPROC MulticastViewportArrayvNVX;
        /* 2183 */ PFNGLMULTICASTVIEWPORTPOSITIONWSCALENVXPROC MulticastViewportPositionWScaleNVX;
        /* 2184 */ PFNGLMULTICASTSCISSORARRAYVNVXPROC MulticastScissorArrayvNVX;
        /* 2185 */ PFNGLASYNCCOPYBUFFERSUBDATANVXPROC AsyncCopyBufferSubDataNVX;
        /* 2186 */ PFNGLASYNCCOPYIMAGESUBDATANVXPROC AsyncCopyImageSubDataNVX;
        /* 2187 */ PFNGLCREATEPROGRESSFENCENVXPROC CreateProgressFenceNVX;
        /* 2188 */ PFNGLSIGNALSEMAPHOREUI64NVXPROC SignalSemaphoreui64NVX;
        /* 2189 */ PFNGLWAITSEMAPHOREUI64NVXPROC WaitSemaphoreui64NVX;
        /* 2190 */ PFNGLCLIENTWAITSEMAPHOREUI64NVXPROC ClientWaitSemaphoreui64NVX;
        /* 2191 */ PFNGLGETMEMORYOBJECTDETACHEDRESOURCESUIVNVPROC GetMemoryObjectDetachedResourcesuivNV;
        /* 2192 */ PFNGLRESETMEMORYOBJECTPARAMETERNVPROC ResetMemoryObjectParameterNV;
        /* 2193 */ PFNGLTEXATTACHMEMORYNVPROC TexAttachMemoryNV;
        /* 2194 */ PFNGLBUFFERATTACHMEMORYNVPROC BufferAttachMemoryNV;
        /* 2195 */ PFNGLTEXTUREATTACHMEMORYNVPROC TextureAttachMemoryNV;
        /* 2196 */ PFNGLNAMEDBUFFERATTACHMEMORYNVPROC NamedBufferAttachMemoryNV;
        /* 2197 */ PFNGLBUFFERPAGECOMMITMENTMEMNVPROC BufferPageCommitmentMemNV;
        /* 2198 */ PFNGLTEXPAGECOMMITMENTMEMNVPROC TexPageCommitmentMemNV;
        /* 2199 */ PFNGLNAMEDBUFFERPAGECOMMITMENTMEMNVPROC NamedBufferPageCommitmentMemNV;
        /* 2200 */ PFNGLTEXTUREPAGECOMMITMENTMEMNVPROC TexturePageCommitmentMemNV;
        /* 2201 */ PFNGLDRAWMESHTASKSNVPROC DrawMeshTasksNV;
        /* 2202 */ PFNGLDRAWMESHTASKSINDIRECTNVPROC DrawMeshTasksIndirectNV;
        /* 2203 */ PFNGLMULTIDRAWMESHTASKSINDIRECTNVPROC MultiDrawMeshTasksIndirectNV;
        /* 2204 */ PFNGLMULTIDRAWMESHTASKSINDIRECTCOUNTNVPROC MultiDrawMeshTasksIndirectCountNV;
        /* 2205 */ PFNGLUNIFORMMATRIX2X3FVNVPROC UniformMatrix2x3fvNV;
        /* 2206 */ PFNGLUNIFORMMATRIX3X2FVNVPROC UniformMatrix3x2fvNV;
        /* 2207 */ PFNGLUNIFORMMATRIX2X4FVNVPROC UniformMatrix2x4fvNV;
        /* 2208 */ PFNGLUNIFORMMATRIX4X2FVNVPROC UniformMatrix4x2fvNV;
        /* 2209 */ PFNGLUNIFORMMATRIX3X4FVNVPROC UniformMatrix3x4fvNV;
        /* 2210 */ PFNGLUNIFORMMATRIX4X3FVNVPROC UniformMatrix4x3fvNV;
        /* 2211 */ PFNGLGENOCCLUSIONQUERIESNVPROC GenOcclusionQueriesNV;
        /* 2212 */ PFNGLDELETEOCCLUSIONQUERIESNVPROC DeleteOcclusionQueriesNV;
        /* 2213 */ PFNGLISOCCLUSIONQUERYNVPROC IsOcclusionQueryNV;
        /* 2214 */ PFNGLBEGINOCCLUSIONQUERYNVPROC BeginOcclusionQueryNV;
        /* 2215 */ PFNGLENDOCCLUSIONQUERYNVPROC EndOcclusionQueryNV;
        /* 2216 */ PFNGLGETOCCLUSIONQUERYIVNVPROC GetOcclusionQueryivNV;
        /* 2217 */ PFNGLGETOCCLUSIONQUERYUIVNVPROC GetOcclusionQueryuivNV;
        /* 2218 */ PFNGLPROGRAMBUFFERPARAMETERSFVNVPROC ProgramBufferParametersfvNV;
        /* 2219 */ PFNGLPROGRAMBUFFERPARAMETERSIIVNVPROC ProgramBufferParametersIivNV;
        /* 2220 */ PFNGLPROGRAMBUFFERPARAMETERSIUIVNVPROC ProgramBufferParametersIuivNV;
        /* 2221 */ PFNGLGENPATHSNVPROC GenPathsNV;
        /* 2222 */ PFNGLDELETEPATHSNVPROC DeletePathsNV;
        /* 2223 */ PFNGLISPATHNVPROC IsPathNV;
        /* 2224 */ PFNGLPATHCOMMANDSNVPROC PathCommandsNV;
        /* 2225 */ PFNGLPATHCOORDSNVPROC PathCoordsNV;
        /* 2226 */ PFNGLPATHSUBCOMMANDSNVPROC PathSubCommandsNV;
        /* 2227 */ PFNGLPATHSUBCOORDSNVPROC PathSubCoordsNV;
        /* 2228 */ PFNGLPATHSTRINGNVPROC PathStringNV;
        /* 2229 */ PFNGLPATHGLYPHSNVPROC PathGlyphsNV;
        /* 2230 */ PFNGLPATHGLYPHRANGENVPROC PathGlyphRangeNV;
        /* 2231 */ PFNGLWEIGHTPATHSNVPROC WeightPathsNV;
        /* 2232 */ PFNGLCOPYPATHNVPROC CopyPathNV;
        /* 2233 */ PFNGLINTERPOLATEPATHSNVPROC InterpolatePathsNV;
        /* 2234 */ PFNGLTRANSFORMPATHNVPROC TransformPathNV;
        /* 2235 */ PFNGLPATHPARAMETERIVNVPROC PathParameterivNV;
        /* 2236 */ PFNGLPATHPARAMETERINVPROC PathParameteriNV;
        /* 2237 */ PFNGLPATHPARAMETERFVNVPROC PathParameterfvNV;
        /* 2238 */ PFNGLPATHPARAMETERFNVPROC PathParameterfNV;
        /* 2239 */ PFNGLPATHDASHARRAYNVPROC PathDashArrayNV;
        /* 2240 */ PFNGLPATHSTENCILFUNCNVPROC PathStencilFuncNV;
        /* 2241 */ PFNGLPATHSTENCILDEPTHOFFSETNVPROC PathStencilDepthOffsetNV;
        /* 2242 */ PFNGLSTENCILFILLPATHNVPROC StencilFillPathNV;
        /* 2243 */ PFNGLSTENCILSTROKEPATHNVPROC StencilStrokePathNV;
        /* 2244 */ PFNGLSTENCILFILLPATHINSTANCEDNVPROC StencilFillPathInstancedNV;
        /* 2245 */ PFNGLSTENCILSTROKEPATHINSTANCEDNVPROC StencilStrokePathInstancedNV;
        /* 2246 */ PFNGLPATHCOVERDEPTHFUNCNVPROC PathCoverDepthFuncNV;
        /* 2247 */ PFNGLCOVERFILLPATHNVPROC CoverFillPathNV;
        /* 2248 */ PFNGLCOVERSTROKEPATHNVPROC CoverStrokePathNV;
        /* 2249 */ PFNGLCOVERFILLPATHINSTANCEDNVPROC CoverFillPathInstancedNV;
        /* 2250 */ PFNGLCOVERSTROKEPATHINSTANCEDNVPROC CoverStrokePathInstancedNV;
        /* 2251 */ PFNGLGETPATHPARAMETERIVNVPROC GetPathParameterivNV;
        /* 2252 */ PFNGLGETPATHPARAMETERFVNVPROC GetPathParameterfvNV;
        /* 2253 */ PFNGLGETPATHCOMMANDSNVPROC GetPathCommandsNV;
        /* 2254 */ PFNGLGETPATHCOORDSNVPROC GetPathCoordsNV;
        /* 2255 */ PFNGLGETPATHDASHARRAYNVPROC GetPathDashArrayNV;
        /* 2256 */ PFNGLGETPATHMETRICSNVPROC GetPathMetricsNV;
        /* 2257 */ PFNGLGETPATHMETRICRANGENVPROC GetPathMetricRangeNV;
        /* 2258 */ PFNGLGETPATHSPACINGNVPROC GetPathSpacingNV;
        /* 2259 */ PFNGLISPOINTINFILLPATHNVPROC IsPointInFillPathNV;
        /* 2260 */ PFNGLISPOINTINSTROKEPATHNVPROC IsPointInStrokePathNV;
        /* 2261 */ PFNGLGETPATHLENGTHNVPROC GetPathLengthNV;
        /* 2262 */ PFNGLPOINTALONGPATHNVPROC PointAlongPathNV;
        /* 2263 */ PFNGLMATRIXLOAD3X2FNVPROC MatrixLoad3x2fNV;
        /* 2264 */ PFNGLMATRIXLOAD3X3FNVPROC MatrixLoad3x3fNV;
        /* 2265 */ PFNGLMATRIXLOADTRANSPOSE3X3FNVPROC MatrixLoadTranspose3x3fNV;
        /* 2266 */ PFNGLMATRIXMULT3X2FNVPROC MatrixMult3x2fNV;
        /* 2267 */ PFNGLMATRIXMULT3X3FNVPROC MatrixMult3x3fNV;
        /* 2268 */ PFNGLMATRIXMULTTRANSPOSE3X3FNVPROC MatrixMultTranspose3x3fNV;
        /* 2269 */ PFNGLSTENCILTHENCOVERFILLPATHNVPROC StencilThenCoverFillPathNV;
        /* 2270 */ PFNGLSTENCILTHENCOVERSTROKEPATHNVPROC StencilThenCoverStrokePathNV;
        /* 2271 */ PFNGLSTENCILTHENCOVERFILLPATHINSTANCEDNVPROC StencilThenCoverFillPathInstancedNV;
        /* 2272 */ PFNGLSTENCILTHENCOVERSTROKEPATHINSTANCEDNVPROC StencilThenCoverStrokePathInstancedNV;
        /* 2273 */ PFNGLPATHGLYPHINDEXRANGENVPROC PathGlyphIndexRangeNV;
        /* 2274 */ PFNGLPATHGLYPHINDEXARRAYNVPROC PathGlyphIndexArrayNV;
        /* 2275 */ PFNGLPATHMEMORYGLYPHINDEXARRAYNVPROC PathMemoryGlyphIndexArrayNV;
        /* 2276 */ PFNGLPROGRAMPATHFRAGMENTINPUTGENNVPROC ProgramPathFragmentInputGenNV;
        /* 2277 */ PFNGLGETPROGRAMRESOURCEFVNVPROC GetProgramResourcefvNV;
        /* 2278 */ PFNGLPATHCOLORGENNVPROC PathColorGenNV;
        /* 2279 */ PFNGLPATHTEXGENNVPROC PathTexGenNV;
        /* 2280 */ PFNGLPATHFOGGENNVPROC PathFogGenNV;
        /* 2281 */ PFNGLGETPATHCOLORGENIVNVPROC GetPathColorGenivNV;
        /* 2282 */ PFNGLGETPATHCOLORGENFVNVPROC GetPathColorGenfvNV;
        /* 2283 */ PFNGLGETPATHTEXGENIVNVPROC GetPathTexGenivNV;
        /* 2284 */ PFNGLGETPATHTEXGENFVNVPROC GetPathTexGenfvNV;
        /* 2285 */ PFNGLPIXELDATARANGENVPROC PixelDataRangeNV;
        /* 2286 */ PFNGLFLUSHPIXELDATARANGENVPROC FlushPixelDataRangeNV;
        /* 2287 */ PFNGLPOINTPARAMETERINVPROC PointParameteriNV;
        /* 2288 */ PFNGLPOINTPARAMETERIVNVPROC PointParameterivNV;
        /* 2289 */ PFNGLPOLYGONMODENVPROC PolygonModeNV;
        /* 2290 */ PFNGLPRESENTFRAMEKEYEDNVPROC PresentFrameKeyedNV;
        /* 2291 */ PFNGLPRESENTFRAMEDUALFILLNVPROC PresentFrameDualFillNV;
        /* 2292 */ PFNGLGETVIDEOIVNVPROC GetVideoivNV;
        /* 2293 */ PFNGLGETVIDEOUIVNVPROC GetVideouivNV;
        /* 2294 */ PFNGLGETVIDEOI64VNVPROC GetVideoi64vNV;
        /* 2295 */ PFNGLGETVIDEOUI64VNVPROC GetVideoui64vNV;
        /* 2296 */ PFNGLPRIMITIVERESTARTNVPROC PrimitiveRestartNV;
        /* 2297 */ PFNGLPRIMITIVERESTARTINDEXNVPROC PrimitiveRestartIndexNV;
        /* 2298 */ PFNGLQUERYRESOURCENVPROC QueryResourceNV;
        /* 2299 */ PFNGLGENQUERYRESOURCETAGNVPROC GenQueryResourceTagNV;
        /* 2300 */ PFNGLDELETEQUERYRESOURCETAGNVPROC DeleteQueryResourceTagNV;
        /* 2301 */ PFNGLQUERYRESOURCETAGNVPROC QueryResourceTagNV;
        /* 2302 */ PFNGLREADBUFFERNVPROC ReadBufferNV;
        /* 2303 */ PFNGLCOMBINERPARAMETERFVNVPROC CombinerParameterfvNV;
        /* 2304 */ PFNGLCOMBINERPARAMETERFNVPROC CombinerParameterfNV;
        /* 2305 */ PFNGLCOMBINERPARAMETERIVNVPROC CombinerParameterivNV;
        /* 2306 */ PFNGLCOMBINERPARAMETERINVPROC CombinerParameteriNV;
        /* 2307 */ PFNGLCOMBINERINPUTNVPROC CombinerInputNV;
        /* 2308 */ PFNGLCOMBINEROUTPUTNVPROC CombinerOutputNV;
        /* 2309 */ PFNGLFINALCOMBINERINPUTNVPROC FinalCombinerInputNV;
        /* 2310 */ PFNGLGETCOMBINERINPUTPARAMETERFVNVPROC GetCombinerInputParameterfvNV;
        /* 2311 */ PFNGLGETCOMBINERINPUTPARAMETERIVNVPROC GetCombinerInputParameterivNV;
        /* 2312 */ PFNGLGETCOMBINEROUTPUTPARAMETERFVNVPROC GetCombinerOutputParameterfvNV;
        /* 2313 */ PFNGLGETCOMBINEROUTPUTPARAMETERIVNVPROC GetCombinerOutputParameterivNV;
        /* 2314 */ PFNGLGETFINALCOMBINERINPUTPARAMETERFVNVPROC GetFinalCombinerInputParameterfvNV;
        /* 2315 */ PFNGLGETFINALCOMBINERINPUTPARAMETERIVNVPROC GetFinalCombinerInputParameterivNV;
        /* 2316 */ PFNGLCOMBINERSTAGEPARAMETERFVNVPROC CombinerStageParameterfvNV;
        /* 2317 */ PFNGLGETCOMBINERSTAGEPARAMETERFVNVPROC GetCombinerStageParameterfvNV;
        /* 2318 */ PFNGLFRAMEBUFFERSAMPLELOCATIONSFVNVPROC FramebufferSampleLocationsfvNV;
        /* 2319 */ PFNGLNAMEDFRAMEBUFFERSAMPLELOCATIONSFVNVPROC NamedFramebufferSampleLocationsfvNV;
        /* 2320 */ PFNGLRESOLVEDEPTHVALUESNVPROC ResolveDepthValuesNV;
        /* 2321 */ PFNGLSCISSOREXCLUSIVENVPROC ScissorExclusiveNV;
        /* 2322 */ PFNGLSCISSOREXCLUSIVEARRAYVNVPROC ScissorExclusiveArrayvNV;
        /* 2323 */ PFNGLMAKEBUFFERRESIDENTNVPROC MakeBufferResidentNV;
        /* 2324 */ PFNGLMAKEBUFFERNONRESIDENTNVPROC MakeBufferNonResidentNV;
        /* 2325 */ PFNGLISBUFFERRESIDENTNVPROC IsBufferResidentNV;
        /* 2326 */ PFNGLMAKENAMEDBUFFERRESIDENTNVPROC MakeNamedBufferResidentNV;
        /* 2327 */ PFNGLMAKENAMEDBUFFERNONRESIDENTNVPROC MakeNamedBufferNonResidentNV;
        /* 2328 */ PFNGLISNAMEDBUFFERRESIDENTNVPROC IsNamedBufferResidentNV;
        /* 2329 */ PFNGLGETBUFFERPARAMETERUI64VNVPROC GetBufferParameterui64vNV;
        /* 2330 */ PFNGLGETNAMEDBUFFERPARAMETERUI64VNVPROC GetNamedBufferParameterui64vNV;
        /* 2331 */ PFNGLGETINTEGERUI64VNVPROC GetIntegerui64vNV;
        /* 2332 */ PFNGLUNIFORMUI64NVPROC Uniformui64NV;
        /* 2333 */ PFNGLUNIFORMUI64VNVPROC Uniformui64vNV;
        /* 2334 */ PFNGLPROGRAMUNIFORMUI64NVPROC ProgramUniformui64NV;
        /* 2335 */ PFNGLPROGRAMUNIFORMUI64VNVPROC ProgramUniformui64vNV;
        /* 2336 */ PFNGLBINDSHADINGRATEIMAGENVPROC BindShadingRateImageNV;
        /* 2337 */ PFNGLGETSHADINGRATEIMAGEPALETTENVPROC GetShadingRateImagePaletteNV;
        /* 2338 */ PFNGLGETSHADINGRATESAMPLELOCATIONIVNVPROC GetShadingRateSampleLocationivNV;
        /* 2339 */ PFNGLSHADINGRATEIMAGEBARRIERNVPROC ShadingRateImageBarrierNV;
        /* 2340 */ PFNGLSHADINGRATEIMAGEPALETTENVPROC ShadingRateImagePaletteNV;
        /* 2341 */ PFNGLSHADINGRATESAMPLEORDERNVPROC ShadingRateSampleOrderNV;
        /* 2342 */ PFNGLSHADINGRATESAMPLEORDERCUSTOMNVPROC ShadingRateSampleOrderCustomNV;
        /* 2343 */ PFNGLTEXTUREBARRIERNVPROC TextureBarrierNV;
        /* 2344 */ PFNGLTEXIMAGE2DMULTISAMPLECOVERAGENVPROC TexImage2DMultisampleCoverageNV;
        /* 2345 */ PFNGLTEXIMAGE3DMULTISAMPLECOVERAGENVPROC TexImage3DMultisampleCoverageNV;
        /* 2346 */ PFNGLTEXTUREIMAGE2DMULTISAMPLENVPROC TextureImage2DMultisampleNV;
        /* 2347 */ PFNGLTEXTUREIMAGE3DMULTISAMPLENVPROC TextureImage3DMultisampleNV;
        /* 2348 */ PFNGLTEXTUREIMAGE2DMULTISAMPLECOVERAGENVPROC TextureImage2DMultisampleCoverageNV;
        /* 2349 */ PFNGLTEXTUREIMAGE3DMULTISAMPLECOVERAGENVPROC TextureImage3DMultisampleCoverageNV;
        /* 2350 */ PFNGLBEGINTRANSFORMFEEDBACKNVPROC BeginTransformFeedbackNV;
        /* 2351 */ PFNGLENDTRANSFORMFEEDBACKNVPROC EndTransformFeedbackNV;
        /* 2352 */ PFNGLTRANSFORMFEEDBACKATTRIBSNVPROC TransformFeedbackAttribsNV;
        /* 2353 */ PFNGLBINDBUFFERRANGENVPROC BindBufferRangeNV;
        /* 2354 */ PFNGLBINDBUFFEROFFSETNVPROC BindBufferOffsetNV;
        /* 2355 */ PFNGLBINDBUFFERBASENVPROC BindBufferBaseNV;
        /* 2356 */ PFNGLTRANSFORMFEEDBACKVARYINGSNVPROC TransformFeedbackVaryingsNV;
        /* 2357 */ PFNGLACTIVEVARYINGNVPROC ActiveVaryingNV;
        /* 2358 */ PFNGLGETVARYINGLOCATIONNVPROC GetVaryingLocationNV;
        /* 2359 */ PFNGLGETACTIVEVARYINGNVPROC GetActiveVaryingNV;
        /* 2360 */ PFNGLGETTRANSFORMFEEDBACKVARYINGNVPROC GetTransformFeedbackVaryingNV;
        /* 2361 */ PFNGLTRANSFORMFEEDBACKSTREAMATTRIBSNVPROC TransformFeedbackStreamAttribsNV;
        /* 2362 */ PFNGLBINDTRANSFORMFEEDBACKNVPROC BindTransformFeedbackNV;
        /* 2363 */ PFNGLDELETETRANSFORMFEEDBACKSNVPROC DeleteTransformFeedbacksNV;
        /* 2364 */ PFNGLGENTRANSFORMFEEDBACKSNVPROC GenTransformFeedbacksNV;
        /* 2365 */ PFNGLISTRANSFORMFEEDBACKNVPROC IsTransformFeedbackNV;
        /* 2366 */ PFNGLPAUSETRANSFORMFEEDBACKNVPROC PauseTransformFeedbackNV;
        /* 2367 */ PFNGLRESUMETRANSFORMFEEDBACKNVPROC ResumeTransformFeedbackNV;
        /* 2368 */ PFNGLDRAWTRANSFORMFEEDBACKNVPROC DrawTransformFeedbackNV;
        /* 2369 */ PFNGLVDPAUINITNVPROC VDPAUInitNV;
        /* 2370 */ PFNGLVDPAUFININVPROC VDPAUFiniNV;
        /* 2371 */ PFNGLVDPAUREGISTERVIDEOSURFACENVPROC VDPAURegisterVideoSurfaceNV;
        /* 2372 */ PFNGLVDPAUREGISTEROUTPUTSURFACENVPROC VDPAURegisterOutputSurfaceNV;
        /* 2373 */ PFNGLVDPAUISSURFACENVPROC VDPAUIsSurfaceNV;
        /* 2374 */ PFNGLVDPAUUNREGISTERSURFACENVPROC VDPAUUnregisterSurfaceNV;
        /* 2375 */ PFNGLVDPAUGETSURFACEIVNVPROC VDPAUGetSurfaceivNV;
        /* 2376 */ PFNGLVDPAUSURFACEACCESSNVPROC VDPAUSurfaceAccessNV;
        /* 2377 */ PFNGLVDPAUMAPSURFACESNVPROC VDPAUMapSurfacesNV;
        /* 2378 */ PFNGLVDPAUUNMAPSURFACESNVPROC VDPAUUnmapSurfacesNV;
        /* 2379 */ PFNGLVDPAUREGISTERVIDEOSURFACEWITHPICTURESTRUCTURENVPROC VDPAURegisterVideoSurfaceWithPictureStructureNV;
        /* 2380 */ PFNGLFLUSHVERTEXARRAYRANGENVPROC FlushVertexArrayRangeNV;
        /* 2381 */ PFNGLVERTEXARRAYRANGENVPROC VertexArrayRangeNV;
        /* 2382 */ PFNGLVERTEXATTRIBL1I64NVPROC VertexAttribL1i64NV;
        /* 2383 */ PFNGLVERTEXATTRIBL2I64NVPROC VertexAttribL2i64NV;
        /* 2384 */ PFNGLVERTEXATTRIBL3I64NVPROC VertexAttribL3i64NV;
        /* 2385 */ PFNGLVERTEXATTRIBL4I64NVPROC VertexAttribL4i64NV;
        /* 2386 */ PFNGLVERTEXATTRIBL1I64VNVPROC VertexAttribL1i64vNV;
        /* 2387 */ PFNGLVERTEXATTRIBL2I64VNVPROC VertexAttribL2i64vNV;
        /* 2388 */ PFNGLVERTEXATTRIBL3I64VNVPROC VertexAttribL3i64vNV;
        /* 2389 */ PFNGLVERTEXATTRIBL4I64VNVPROC VertexAttribL4i64vNV;
        /* 2390 */ PFNGLVERTEXATTRIBL1UI64NVPROC VertexAttribL1ui64NV;
        /* 2391 */ PFNGLVERTEXATTRIBL2UI64NVPROC VertexAttribL2ui64NV;
        /* 2392 */ PFNGLVERTEXATTRIBL3UI64NVPROC VertexAttribL3ui64NV;
        /* 2393 */ PFNGLVERTEXATTRIBL4UI64NVPROC VertexAttribL4ui64NV;
        /* 2394 */ PFNGLVERTEXATTRIBL1UI64VNVPROC VertexAttribL1ui64vNV;
        /* 2395 */ PFNGLVERTEXATTRIBL2UI64VNVPROC VertexAttribL2ui64vNV;
        /* 2396 */ PFNGLVERTEXATTRIBL3UI64VNVPROC VertexAttribL3ui64vNV;
        /* 2397 */ PFNGLVERTEXATTRIBL4UI64VNVPROC VertexAttribL4ui64vNV;
        /* 2398 */ PFNGLGETVERTEXATTRIBLI64VNVPROC GetVertexAttribLi64vNV;
        /* 2399 */ PFNGLGETVERTEXATTRIBLUI64VNVPROC GetVertexAttribLui64vNV;
        /* 2400 */ PFNGLVERTEXATTRIBLFORMATNVPROC VertexAttribLFormatNV;
        /* 2401 */ PFNGLBUFFERADDRESSRANGENVPROC BufferAddressRangeNV;
        /* 2402 */ PFNGLVERTEXFORMATNVPROC VertexFormatNV;
        /* 2403 */ PFNGLNORMALFORMATNVPROC NormalFormatNV;
        /* 2404 */ PFNGLCOLORFORMATNVPROC ColorFormatNV;
        /* 2405 */ PFNGLINDEXFORMATNVPROC IndexFormatNV;
        /* 2406 */ PFNGLTEXCOORDFORMATNVPROC TexCoordFormatNV;
        /* 2407 */ PFNGLEDGEFLAGFORMATNVPROC EdgeFlagFormatNV;
        /* 2408 */ PFNGLSECONDARYCOLORFORMATNVPROC SecondaryColorFormatNV;
        /* 2409 */ PFNGLFOGCOORDFORMATNVPROC FogCoordFormatNV;
        /* 2410 */ PFNGLVERTEXATTRIBFORMATNVPROC VertexAttribFormatNV;
        /* 2411 */ PFNGLVERTEXATTRIBIFORMATNVPROC VertexAttribIFormatNV;
        /* 2412 */ PFNGLGETINTEGERUI64I_VNVPROC GetIntegerui64i_vNV;
        /* 2413 */ PFNGLAREPROGRAMSRESIDENTNVPROC AreProgramsResidentNV;
        /* 2414 */ PFNGLBINDPROGRAMNVPROC BindProgramNV;
        /* 2415 */ PFNGLDELETEPROGRAMSNVPROC DeleteProgramsNV;
        /* 2416 */ PFNGLEXECUTEPROGRAMNVPROC ExecuteProgramNV;
        /* 2417 */ PFNGLGENPROGRAMSNVPROC GenProgramsNV;
        /* 2418 */ PFNGLGETPROGRAMPARAMETERDVNVPROC GetProgramParameterdvNV;
        /* 2419 */ PFNGLGETPROGRAMPARAMETERFVNVPROC GetProgramParameterfvNV;
        /* 2420 */ PFNGLGETPROGRAMIVNVPROC GetProgramivNV;
        /* 2421 */ PFNGLGETPROGRAMSTRINGNVPROC GetProgramStringNV;
        /* 2422 */ PFNGLGETTRACKMATRIXIVNVPROC GetTrackMatrixivNV;
        /* 2423 */ PFNGLGETVERTEXATTRIBDVNVPROC GetVertexAttribdvNV;
        /* 2424 */ PFNGLGETVERTEXATTRIBFVNVPROC GetVertexAttribfvNV;
        /* 2425 */ PFNGLGETVERTEXATTRIBIVNVPROC GetVertexAttribivNV;
        /* 2426 */ PFNGLGETVERTEXATTRIBPOINTERVNVPROC GetVertexAttribPointervNV;
        /* 2427 */ PFNGLISPROGRAMNVPROC IsProgramNV;
        /* 2428 */ PFNGLLOADPROGRAMNVPROC LoadProgramNV;
        /* 2429 */ PFNGLPROGRAMPARAMETER4DNVPROC ProgramParameter4dNV;
        /* 2430 */ PFNGLPROGRAMPARAMETER4DVNVPROC ProgramParameter4dvNV;
        /* 2431 */ PFNGLPROGRAMPARAMETER4FNVPROC ProgramParameter4fNV;
        /* 2432 */ PFNGLPROGRAMPARAMETER4FVNVPROC ProgramParameter4fvNV;
        /* 2433 */ PFNGLPROGRAMPARAMETERS4DVNVPROC ProgramParameters4dvNV;
        /* 2434 */ PFNGLPROGRAMPARAMETERS4FVNVPROC ProgramParameters4fvNV;
        /* 2435 */ PFNGLREQUESTRESIDENTPROGRAMSNVPROC RequestResidentProgramsNV;
        /* 2436 */ PFNGLTRACKMATRIXNVPROC TrackMatrixNV;
        /* 2437 */ PFNGLVERTEXATTRIBPOINTERNVPROC VertexAttribPointerNV;
        /* 2438 */ PFNGLVERTEXATTRIB1DNVPROC VertexAttrib1dNV;
        /* 2439 */ PFNGLVERTEXATTRIB1DVNVPROC VertexAttrib1dvNV;
        /* 2440 */ PFNGLVERTEXATTRIB1FNVPROC VertexAttrib1fNV;
        /* 2441 */ PFNGLVERTEXATTRIB1FVNVPROC VertexAttrib1fvNV;
        /* 2442 */ PFNGLVERTEXATTRIB1SNVPROC VertexAttrib1sNV;
        /* 2443 */ PFNGLVERTEXATTRIB1SVNVPROC VertexAttrib1svNV;
        /* 2444 */ PFNGLVERTEXATTRIB2DNVPROC VertexAttrib2dNV;
        /* 2445 */ PFNGLVERTEXATTRIB2DVNVPROC VertexAttrib2dvNV;
        /* 2446 */ PFNGLVERTEXATTRIB2FNVPROC VertexAttrib2fNV;
        /* 2447 */ PFNGLVERTEXATTRIB2FVNVPROC VertexAttrib2fvNV;
        /* 2448 */ PFNGLVERTEXATTRIB2SNVPROC VertexAttrib2sNV;
        /* 2449 */ PFNGLVERTEXATTRIB2SVNVPROC VertexAttrib2svNV;
        /* 2450 */ PFNGLVERTEXATTRIB3DNVPROC VertexAttrib3dNV;
        /* 2451 */ PFNGLVERTEXATTRIB3DVNVPROC VertexAttrib3dvNV;
        /* 2452 */ PFNGLVERTEXATTRIB3FNVPROC VertexAttrib3fNV;
        /* 2453 */ PFNGLVERTEXATTRIB3FVNVPROC VertexAttrib3fvNV;
        /* 2454 */ PFNGLVERTEXATTRIB3SNVPROC VertexAttrib3sNV;
        /* 2455 */ PFNGLVERTEXATTRIB3SVNVPROC VertexAttrib3svNV;
        /* 2456 */ PFNGLVERTEXATTRIB4DNVPROC VertexAttrib4dNV;
        /* 2457 */ PFNGLVERTEXATTRIB4DVNVPROC VertexAttrib4dvNV;
        /* 2458 */ PFNGLVERTEXATTRIB4FNVPROC VertexAttrib4fNV;
        /* 2459 */ PFNGLVERTEXATTRIB4FVNVPROC VertexAttrib4fvNV;
        /* 2460 */ PFNGLVERTEXATTRIB4SNVPROC VertexAttrib4sNV;
        /* 2461 */ PFNGLVERTEXATTRIB4SVNVPROC VertexAttrib4svNV;
        /* 2462 */ PFNGLVERTEXATTRIB4UBNVPROC VertexAttrib4ubNV;
        /* 2463 */ PFNGLVERTEXATTRIB4UBVNVPROC VertexAttrib4ubvNV;
        /* 2464 */ PFNGLVERTEXATTRIBS1DVNVPROC VertexAttribs1dvNV;
        /* 2465 */ PFNGLVERTEXATTRIBS1FVNVPROC VertexAttribs1fvNV;
        /* 2466 */ PFNGLVERTEXATTRIBS1SVNVPROC VertexAttribs1svNV;
        /* 2467 */ PFNGLVERTEXATTRIBS2DVNVPROC VertexAttribs2dvNV;
        /* 2468 */ PFNGLVERTEXATTRIBS2FVNVPROC VertexAttribs2fvNV;
        /* 2469 */ PFNGLVERTEXATTRIBS2SVNVPROC VertexAttribs2svNV;
        /* 2470 */ PFNGLVERTEXATTRIBS3DVNVPROC VertexAttribs3dvNV;
        /* 2471 */ PFNGLVERTEXATTRIBS3FVNVPROC VertexAttribs3fvNV;
        /* 2472 */ PFNGLVERTEXATTRIBS3SVNVPROC VertexAttribs3svNV;
        /* 2473 */ PFNGLVERTEXATTRIBS4DVNVPROC VertexAttribs4dvNV;
        /* 2474 */ PFNGLVERTEXATTRIBS4FVNVPROC VertexAttribs4fvNV;
        /* 2475 */ PFNGLVERTEXATTRIBS4SVNVPROC VertexAttribs4svNV;
        /* 2476 */ PFNGLVERTEXATTRIBS4UBVNVPROC VertexAttribs4ubvNV;
        /* 2477 */ PFNGLBEGINVIDEOCAPTURENVPROC BeginVideoCaptureNV;
        /* 2478 */ PFNGLBINDVIDEOCAPTURESTREAMBUFFERNVPROC BindVideoCaptureStreamBufferNV;
        /* 2479 */ PFNGLBINDVIDEOCAPTURESTREAMTEXTURENVPROC BindVideoCaptureStreamTextureNV;
        /* 2480 */ PFNGLENDVIDEOCAPTURENVPROC EndVideoCaptureNV;
        /* 2481 */ PFNGLGETVIDEOCAPTUREIVNVPROC GetVideoCaptureivNV;
        /* 2482 */ PFNGLGETVIDEOCAPTURESTREAMIVNVPROC GetVideoCaptureStreamivNV;
        /* 2483 */ PFNGLGETVIDEOCAPTURESTREAMFVNVPROC GetVideoCaptureStreamfvNV;
        /* 2484 */ PFNGLGETVIDEOCAPTURESTREAMDVNVPROC GetVideoCaptureStreamdvNV;
        /* 2485 */ PFNGLVIDEOCAPTURENVPROC VideoCaptureNV;
        /* 2486 */ PFNGLVIDEOCAPTURESTREAMPARAMETERIVNVPROC VideoCaptureStreamParameterivNV;
        /* 2487 */ PFNGLVIDEOCAPTURESTREAMPARAMETERFVNVPROC VideoCaptureStreamParameterfvNV;
        /* 2488 */ PFNGLVIDEOCAPTURESTREAMPARAMETERDVNVPROC VideoCaptureStreamParameterdvNV;
        /* 2489 */ PFNGLVIEWPORTARRAYVNVPROC ViewportArrayvNV;
        /* 2490 */ PFNGLVIEWPORTINDEXEDFNVPROC ViewportIndexedfNV;
        /* 2491 */ PFNGLVIEWPORTINDEXEDFVNVPROC ViewportIndexedfvNV;
        /* 2492 */ PFNGLSCISSORARRAYVNVPROC ScissorArrayvNV;
        /* 2493 */ PFNGLSCISSORINDEXEDNVPROC ScissorIndexedNV;
        /* 2494 */ PFNGLSCISSORINDEXEDVNVPROC ScissorIndexedvNV;
        /* 2495 */ PFNGLDEPTHRANGEARRAYFVNVPROC DepthRangeArrayfvNV;
        /* 2496 */ PFNGLDEPTHRANGEINDEXEDFNVPROC DepthRangeIndexedfNV;
        /* 2497 */ PFNGLGETFLOATI_VNVPROC GetFloati_vNV;
        /* 2498 */ PFNGLENABLEINVPROC EnableiNV;
        /* 2499 */ PFNGLDISABLEINVPROC DisableiNV;
        /* 2500 */ PFNGLISENABLEDINVPROC IsEnablediNV;
        /* 2501 */ PFNGLVIEWPORTSWIZZLENVPROC ViewportSwizzleNV;
        /* 2502 */ PFNGLEGLIMAGETARGETTEXTURE2DOESPROC EGLImageTargetTexture2DOES;
        /* 2503 */ PFNGLEGLIMAGETARGETRENDERBUFFERSTORAGEOESPROC EGLImageTargetRenderbufferStorageOES;
        /* 2504 */ PFNGLMULTITEXCOORD1BOESPROC MultiTexCoord1bOES;
        /* 2505 */ PFNGLMULTITEXCOORD1BVOESPROC MultiTexCoord1bvOES;
        /* 2506 */ PFNGLMULTITEXCOORD2BOESPROC MultiTexCoord2bOES;
        /* 2507 */ PFNGLMULTITEXCOORD2BVOESPROC MultiTexCoord2bvOES;
        /* 2508 */ PFNGLMULTITEXCOORD3BOESPROC MultiTexCoord3bOES;
        /* 2509 */ PFNGLMULTITEXCOORD3BVOESPROC MultiTexCoord3bvOES;
        /* 2510 */ PFNGLMULTITEXCOORD4BOESPROC MultiTexCoord4bOES;
        /* 2511 */ PFNGLMULTITEXCOORD4BVOESPROC MultiTexCoord4bvOES;
        /* 2512 */ PFNGLTEXCOORD1BOESPROC TexCoord1bOES;
        /* 2513 */ PFNGLTEXCOORD1BVOESPROC TexCoord1bvOES;
        /* 2514 */ PFNGLTEXCOORD2BOESPROC TexCoord2bOES;
        /* 2515 */ PFNGLTEXCOORD2BVOESPROC TexCoord2bvOES;
        /* 2516 */ PFNGLTEXCOORD3BOESPROC TexCoord3bOES;
        /* 2517 */ PFNGLTEXCOORD3BVOESPROC TexCoord3bvOES;
        /* 2518 */ PFNGLTEXCOORD4BOESPROC TexCoord4bOES;
        /* 2519 */ PFNGLTEXCOORD4BVOESPROC TexCoord4bvOES;
        /* 2520 */ PFNGLVERTEX2BOESPROC Vertex2bOES;
        /* 2521 */ PFNGLVERTEX2BVOESPROC Vertex2bvOES;
        /* 2522 */ PFNGLVERTEX3BOESPROC Vertex3bOES;
        /* 2523 */ PFNGLVERTEX3BVOESPROC Vertex3bvOES;
        /* 2524 */ PFNGLVERTEX4BOESPROC Vertex4bOES;
        /* 2525 */ PFNGLVERTEX4BVOESPROC Vertex4bvOES;
        /* 2526 */ PFNGLCOPYIMAGESUBDATAOESPROC CopyImageSubDataOES;
        /* 2527 */ PFNGLENABLEIOESPROC EnableiOES;
        /* 2528 */ PFNGLDISABLEIOESPROC DisableiOES;
        /* 2529 */ PFNGLBLENDEQUATIONIOESPROC BlendEquationiOES;
        /* 2530 */ PFNGLBLENDEQUATIONSEPARATEIOESPROC BlendEquationSeparateiOES;
        /* 2531 */ PFNGLBLENDFUNCIOESPROC BlendFunciOES;
        /* 2532 */ PFNGLBLENDFUNCSEPARATEIOESPROC BlendFuncSeparateiOES;
        /* 2533 */ PFNGLCOLORMASKIOESPROC ColorMaskiOES;
        /* 2534 */ PFNGLISENABLEDIOESPROC IsEnablediOES;
        /* 2535 */ PFNGLDRAWELEMENTSBASEVERTEXOESPROC DrawElementsBaseVertexOES;
        /* 2536 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXOESPROC DrawRangeElementsBaseVertexOES;
        /* 2537 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXOESPROC DrawElementsInstancedBaseVertexOES;
        /* 2538 */ PFNGLALPHAFUNCXOESPROC AlphaFuncxOES;
        /* 2539 */ PFNGLCLEARCOLORXOESPROC ClearColorxOES;
        /* 2540 */ PFNGLCLEARDEPTHXOESPROC ClearDepthxOES;
        /* 2541 */ PFNGLCLIPPLANEXOESPROC ClipPlanexOES;
        /* 2542 */ PFNGLCOLOR4XOESPROC Color4xOES;
        /* 2543 */ PFNGLDEPTHRANGEXOESPROC DepthRangexOES;
        /* 2544 */ PFNGLFOGXOESPROC FogxOES;
        /* 2545 */ PFNGLFOGXVOESPROC FogxvOES;
        /* 2546 */ PFNGLFRUSTUMXOESPROC FrustumxOES;
        /* 2547 */ PFNGLGETCLIPPLANEXOESPROC GetClipPlanexOES;
        /* 2548 */ PFNGLGETFIXEDVOESPROC GetFixedvOES;
        /* 2549 */ PFNGLGETTEXENVXVOESPROC GetTexEnvxvOES;
        /* 2550 */ PFNGLGETTEXPARAMETERXVOESPROC GetTexParameterxvOES;
        /* 2551 */ PFNGLLIGHTMODELXOESPROC LightModelxOES;
        /* 2552 */ PFNGLLIGHTMODELXVOESPROC LightModelxvOES;
        /* 2553 */ PFNGLLIGHTXOESPROC LightxOES;
        /* 2554 */ PFNGLLIGHTXVOESPROC LightxvOES;
        /* 2555 */ PFNGLLINEWIDTHXOESPROC LineWidthxOES;
        /* 2556 */ PFNGLLOADMATRIXXOESPROC LoadMatrixxOES;
        /* 2557 */ PFNGLMATERIALXOESPROC MaterialxOES;
        /* 2558 */ PFNGLMATERIALXVOESPROC MaterialxvOES;
        /* 2559 */ PFNGLMULTMATRIXXOESPROC MultMatrixxOES;
        /* 2560 */ PFNGLMULTITEXCOORD4XOESPROC MultiTexCoord4xOES;
        /* 2561 */ PFNGLNORMAL3XOESPROC Normal3xOES;
        /* 2562 */ PFNGLORTHOXOESPROC OrthoxOES;
        /* 2563 */ PFNGLPOINTPARAMETERXVOESPROC PointParameterxvOES;
        /* 2564 */ PFNGLPOINTSIZEXOESPROC PointSizexOES;
        /* 2565 */ PFNGLPOLYGONOFFSETXOESPROC PolygonOffsetxOES;
        /* 2566 */ PFNGLROTATEXOESPROC RotatexOES;
        /* 2567 */ PFNGLSCALEXOESPROC ScalexOES;
        /* 2568 */ PFNGLTEXENVXOESPROC TexEnvxOES;
        /* 2569 */ PFNGLTEXENVXVOESPROC TexEnvxvOES;
        /* 2570 */ PFNGLTEXPARAMETERXOESPROC TexParameterxOES;
        /* 2571 */ PFNGLTEXPARAMETERXVOESPROC TexParameterxvOES;
        /* 2572 */ PFNGLTRANSLATEXOESPROC TranslatexOES;
        /* 2573 */ PFNGLACCUMXOESPROC AccumxOES;
        /* 2574 */ PFNGLBITMAPXOESPROC BitmapxOES;
        /* 2575 */ PFNGLBLENDCOLORXOESPROC BlendColorxOES;
        /* 2576 */ PFNGLCLEARACCUMXOESPROC ClearAccumxOES;
        /* 2577 */ PFNGLCOLOR3XOESPROC Color3xOES;
        /* 2578 */ PFNGLCOLOR3XVOESPROC Color3xvOES;
        /* 2579 */ PFNGLCOLOR4XVOESPROC Color4xvOES;
        /* 2580 */ PFNGLCONVOLUTIONPARAMETERXOESPROC ConvolutionParameterxOES;
        /* 2581 */ PFNGLCONVOLUTIONPARAMETERXVOESPROC ConvolutionParameterxvOES;
        /* 2582 */ PFNGLEVALCOORD1XOESPROC EvalCoord1xOES;
        /* 2583 */ PFNGLEVALCOORD1XVOESPROC EvalCoord1xvOES;
        /* 2584 */ PFNGLEVALCOORD2XOESPROC EvalCoord2xOES;
        /* 2585 */ PFNGLEVALCOORD2XVOESPROC EvalCoord2xvOES;
        /* 2586 */ PFNGLFEEDBACKBUFFERXOESPROC FeedbackBufferxOES;
        /* 2587 */ PFNGLGETCONVOLUTIONPARAMETERXVOESPROC GetConvolutionParameterxvOES;
        /* 2588 */ PFNGLGETHISTOGRAMPARAMETERXVOESPROC GetHistogramParameterxvOES;
        /* 2589 */ PFNGLGETLIGHTXOESPROC GetLightxOES;
        /* 2590 */ PFNGLGETMAPXVOESPROC GetMapxvOES;
        /* 2591 */ PFNGLGETMATERIALXOESPROC GetMaterialxOES;
        /* 2592 */ PFNGLGETPIXELMAPXVPROC GetPixelMapxv;
        /* 2593 */ PFNGLGETTEXGENXVOESPROC GetTexGenxvOES;
        /* 2594 */ PFNGLGETTEXLEVELPARAMETERXVOESPROC GetTexLevelParameterxvOES;
        /* 2595 */ PFNGLINDEXXOESPROC IndexxOES;
        /* 2596 */ PFNGLINDEXXVOESPROC IndexxvOES;
        /* 2597 */ PFNGLLOADTRANSPOSEMATRIXXOESPROC LoadTransposeMatrixxOES;
        /* 2598 */ PFNGLMAP1XOESPROC Map1xOES;
        /* 2599 */ PFNGLMAP2XOESPROC Map2xOES;
        /* 2600 */ PFNGLMAPGRID1XOESPROC MapGrid1xOES;
        /* 2601 */ PFNGLMAPGRID2XOESPROC MapGrid2xOES;
        /* 2602 */ PFNGLMULTTRANSPOSEMATRIXXOESPROC MultTransposeMatrixxOES;
        /* 2603 */ PFNGLMULTITEXCOORD1XOESPROC MultiTexCoord1xOES;
        /* 2604 */ PFNGLMULTITEXCOORD1XVOESPROC MultiTexCoord1xvOES;
        /* 2605 */ PFNGLMULTITEXCOORD2XOESPROC MultiTexCoord2xOES;
        /* 2606 */ PFNGLMULTITEXCOORD2XVOESPROC MultiTexCoord2xvOES;
        /* 2607 */ PFNGLMULTITEXCOORD3XOESPROC MultiTexCoord3xOES;
        /* 2608 */ PFNGLMULTITEXCOORD3XVOESPROC MultiTexCoord3xvOES;
        /* 2609 */ PFNGLMULTITEXCOORD4XVOESPROC MultiTexCoord4xvOES;
        /* 2610 */ PFNGLNORMAL3XVOESPROC Normal3xvOES;
        /* 2611 */ PFNGLPASSTHROUGHXOESPROC PassThroughxOES;
        /* 2612 */ PFNGLPIXELMAPXPROC PixelMapx;
        /* 2613 */ PFNGLPIXELSTOREXPROC PixelStorex;
        /* 2614 */ PFNGLPIXELTRANSFERXOESPROC PixelTransferxOES;
        /* 2615 */ PFNGLPIXELZOOMXOESPROC PixelZoomxOES;
        /* 2616 */ PFNGLPRIORITIZETEXTURESXOESPROC PrioritizeTexturesxOES;
        /* 2617 */ PFNGLRASTERPOS2XOESPROC RasterPos2xOES;
        /* 2618 */ PFNGLRASTERPOS2XVOESPROC RasterPos2xvOES;
        /* 2619 */ PFNGLRASTERPOS3XOESPROC RasterPos3xOES;
        /* 2620 */ PFNGLRASTERPOS3XVOESPROC RasterPos3xvOES;
        /* 2621 */ PFNGLRASTERPOS4XOESPROC RasterPos4xOES;
        /* 2622 */ PFNGLRASTERPOS4XVOESPROC RasterPos4xvOES;
        /* 2623 */ PFNGLRECTXOESPROC RectxOES;
        /* 2624 */ PFNGLRECTXVOESPROC RectxvOES;
        /* 2625 */ PFNGLTEXCOORD1XOESPROC TexCoord1xOES;
        /* 2626 */ PFNGLTEXCOORD1XVOESPROC TexCoord1xvOES;
        /* 2627 */ PFNGLTEXCOORD2XOESPROC TexCoord2xOES;
        /* 2628 */ PFNGLTEXCOORD2XVOESPROC TexCoord2xvOES;
        /* 2629 */ PFNGLTEXCOORD3XOESPROC TexCoord3xOES;
        /* 2630 */ PFNGLTEXCOORD3XVOESPROC TexCoord3xvOES;
        /* 2631 */ PFNGLTEXCOORD4XOESPROC TexCoord4xOES;
        /* 2632 */ PFNGLTEXCOORD4XVOESPROC TexCoord4xvOES;
        /* 2633 */ PFNGLTEXGENXOESPROC TexGenxOES;
        /* 2634 */ PFNGLTEXGENXVOESPROC TexGenxvOES;
        /* 2635 */ PFNGLVERTEX2XOESPROC Vertex2xOES;
        /* 2636 */ PFNGLVERTEX2XVOESPROC Vertex2xvOES;
        /* 2637 */ PFNGLVERTEX3XOESPROC Vertex3xOES;
        /* 2638 */ PFNGLVERTEX3XVOESPROC Vertex3xvOES;
        /* 2639 */ PFNGLVERTEX4XOESPROC Vertex4xOES;
        /* 2640 */ PFNGLVERTEX4XVOESPROC Vertex4xvOES;
        /* 2641 */ PFNGLFRAMEBUFFERTEXTUREOESPROC FramebufferTextureOES;
        /* 2642 */ PFNGLGETPROGRAMBINARYOESPROC GetProgramBinaryOES;
        /* 2643 */ PFNGLPROGRAMBINARYOESPROC ProgramBinaryOES;
        /* 2644 */ PFNGLMAPBUFFEROESPROC MapBufferOES;
        /* 2645 */ PFNGLUNMAPBUFFEROESPROC UnmapBufferOES;
        /* 2646 */ PFNGLGETBUFFERPOINTERVOESPROC GetBufferPointervOES;
        /* 2647 */ PFNGLPRIMITIVEBOUNDINGBOXOESPROC PrimitiveBoundingBoxOES;
        /* 2648 */ PFNGLQUERYMATRIXXOESPROC QueryMatrixxOES;
        /* 2649 */ PFNGLMINSAMPLESHADINGOESPROC MinSampleShadingOES;
        /* 2650 */ PFNGLCLEARDEPTHFOESPROC ClearDepthfOES;
        /* 2651 */ PFNGLCLIPPLANEFOESPROC ClipPlanefOES;
        /* 2652 */ PFNGLDEPTHRANGEFOESPROC DepthRangefOES;
        /* 2653 */ PFNGLFRUSTUMFOESPROC FrustumfOES;
        /* 2654 */ PFNGLGETCLIPPLANEFOESPROC GetClipPlanefOES;
        /* 2655 */ PFNGLORTHOFOESPROC OrthofOES;
        /* 2656 */ PFNGLPATCHPARAMETERIOESPROC PatchParameteriOES;
        /* 2657 */ PFNGLTEXIMAGE3DOESPROC TexImage3DOES;
        /* 2658 */ PFNGLTEXSUBIMAGE3DOESPROC TexSubImage3DOES;
        /* 2659 */ PFNGLCOPYTEXSUBIMAGE3DOESPROC CopyTexSubImage3DOES;
        /* 2660 */ PFNGLCOMPRESSEDTEXIMAGE3DOESPROC CompressedTexImage3DOES;
        /* 2661 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DOESPROC CompressedTexSubImage3DOES;
        /* 2662 */ PFNGLFRAMEBUFFERTEXTURE3DOESPROC FramebufferTexture3DOES;
        /* 2663 */ PFNGLTEXPARAMETERIIVOESPROC TexParameterIivOES;
        /* 2664 */ PFNGLTEXPARAMETERIUIVOESPROC TexParameterIuivOES;
        /* 2665 */ PFNGLGETTEXPARAMETERIIVOESPROC GetTexParameterIivOES;
        /* 2666 */ PFNGLGETTEXPARAMETERIUIVOESPROC GetTexParameterIuivOES;
        /* 2667 */ PFNGLSAMPLERPARAMETERIIVOESPROC SamplerParameterIivOES;
        /* 2668 */ PFNGLSAMPLERPARAMETERIUIVOESPROC SamplerParameterIuivOES;
        /* 2669 */ PFNGLGETSAMPLERPARAMETERIIVOESPROC GetSamplerParameterIivOES;
        /* 2670 */ PFNGLGETSAMPLERPARAMETERIUIVOESPROC GetSamplerParameterIuivOES;
        /* 2671 */ PFNGLTEXBUFFEROESPROC TexBufferOES;
        /* 2672 */ PFNGLTEXBUFFERRANGEOESPROC TexBufferRangeOES;
        /* 2673 */ PFNGLTEXSTORAGE3DMULTISAMPLEOESPROC TexStorage3DMultisampleOES;
        /* 2674 */ PFNGLTEXTUREVIEWOESPROC TextureViewOES;
        /* 2675 */ PFNGLBINDVERTEXARRAYOESPROC BindVertexArrayOES;
        /* 2676 */ PFNGLDELETEVERTEXARRAYSOESPROC DeleteVertexArraysOES;
        /* 2677 */ PFNGLGENVERTEXARRAYSOESPROC GenVertexArraysOES;
        /* 2678 */ PFNGLISVERTEXARRAYOESPROC IsVertexArrayOES;
        /* 2679 */ PFNGLVIEWPORTARRAYVOESPROC ViewportArrayvOES;
        /* 2680 */ PFNGLVIEWPORTINDEXEDFOESPROC ViewportIndexedfOES;
        /* 2681 */ PFNGLVIEWPORTINDEXEDFVOESPROC ViewportIndexedfvOES;
        /* 2682 */ PFNGLSCISSORARRAYVOESPROC ScissorArrayvOES;
        /* 2683 */ PFNGLSCISSORINDEXEDOESPROC ScissorIndexedOES;
        /* 2684 */ PFNGLSCISSORINDEXEDVOESPROC ScissorIndexedvOES;
        /* 2685 */ PFNGLDEPTHRANGEARRAYFVOESPROC DepthRangeArrayfvOES;
        /* 2686 */ PFNGLDEPTHRANGEINDEXEDFOESPROC DepthRangeIndexedfOES;
        /* 2687 */ PFNGLGETFLOATI_VOESPROC GetFloati_vOES;
        /* 2688 */ PFNGLFRAMEBUFFERTEXTUREMULTIVIEWOVRPROC FramebufferTextureMultiviewOVR;
        /* 2689 */ PFNGLNAMEDFRAMEBUFFERTEXTUREMULTIVIEWOVRPROC NamedFramebufferTextureMultiviewOVR;
        /* 2690 */ PFNGLFRAMEBUFFERTEXTUREMULTISAMPLEMULTIVIEWOVRPROC FramebufferTextureMultisampleMultiviewOVR;
        /* 2691 */ PFNGLHINTPGIPROC HintPGI;
        /* 2692 */ PFNGLALPHAFUNCQCOMPROC AlphaFuncQCOM;
        /* 2693 */ PFNGLGETDRIVERCONTROLSQCOMPROC GetDriverControlsQCOM;
        /* 2694 */ PFNGLGETDRIVERCONTROLSTRINGQCOMPROC GetDriverControlStringQCOM;
        /* 2695 */ PFNGLENABLEDRIVERCONTROLQCOMPROC EnableDriverControlQCOM;
        /* 2696 */ PFNGLDISABLEDRIVERCONTROLQCOMPROC DisableDriverControlQCOM;
        /* 2697 */ PFNGLEXTGETTEXTURESQCOMPROC ExtGetTexturesQCOM;
        /* 2698 */ PFNGLEXTGETBUFFERSQCOMPROC ExtGetBuffersQCOM;
        /* 2699 */ PFNGLEXTGETRENDERBUFFERSQCOMPROC ExtGetRenderbuffersQCOM;
        /* 2700 */ PFNGLEXTGETFRAMEBUFFERSQCOMPROC ExtGetFramebuffersQCOM;
        /* 2701 */ PFNGLEXTGETTEXLEVELPARAMETERIVQCOMPROC ExtGetTexLevelParameterivQCOM;
        /* 2702 */ PFNGLEXTTEXOBJECTSTATEOVERRIDEIQCOMPROC ExtTexObjectStateOverrideiQCOM;
        /* 2703 */ PFNGLEXTGETTEXSUBIMAGEQCOMPROC ExtGetTexSubImageQCOM;
        /* 2704 */ PFNGLEXTGETBUFFERPOINTERVQCOMPROC ExtGetBufferPointervQCOM;
        /* 2705 */ PFNGLEXTGETSHADERSQCOMPROC ExtGetShadersQCOM;
        /* 2706 */ PFNGLEXTGETPROGRAMSQCOMPROC ExtGetProgramsQCOM;
        /* 2707 */ PFNGLEXTISPROGRAMBINARYQCOMPROC ExtIsProgramBinaryQCOM;
        /* 2708 */ PFNGLEXTGETPROGRAMBINARYSOURCEQCOMPROC ExtGetProgramBinarySourceQCOM;
        /* 2709 */ PFNGLFRAMEBUFFERFOVEATIONCONFIGQCOMPROC FramebufferFoveationConfigQCOM;
        /* 2710 */ PFNGLFRAMEBUFFERFOVEATIONPARAMETERSQCOMPROC FramebufferFoveationParametersQCOM;
        /* 2711 */ PFNGLTEXESTIMATEMOTIONQCOMPROC TexEstimateMotionQCOM;
        /* 2712 */ PFNGLTEXESTIMATEMOTIONREGIONSQCOMPROC TexEstimateMotionRegionsQCOM;
        /* 2713 */ PFNGLEXTRAPOLATETEX2DQCOMPROC ExtrapolateTex2DQCOM;
        /* 2714 */ PFNGLTEXTUREFOVEATIONPARAMETERSQCOMPROC TextureFoveationParametersQCOM;
        /* 2715 */ PFNGLFRAMEBUFFERFETCHBARRIERQCOMPROC FramebufferFetchBarrierQCOM;
        /* 2716 */ PFNGLSHADINGRATEQCOMPROC ShadingRateQCOM;
        /* 2717 */ PFNGLSTARTTILINGQCOMPROC StartTilingQCOM;
        /* 2718 */ PFNGLENDTILINGQCOMPROC EndTilingQCOM;
        /* 2719 */ PFNGLDETAILTEXFUNCSGISPROC DetailTexFuncSGIS;
        /* 2720 */ PFNGLGETDETAILTEXFUNCSGISPROC GetDetailTexFuncSGIS;
        /* 2721 */ PFNGLFOGFUNCSGISPROC FogFuncSGIS;
        /* 2722 */ PFNGLGETFOGFUNCSGISPROC GetFogFuncSGIS;
        /* 2723 */ PFNGLSAMPLEMASKSGISPROC SampleMaskSGIS;
        /* 2724 */ PFNGLSAMPLEPATTERNSGISPROC SamplePatternSGIS;
        /* 2725 */ PFNGLPIXELTEXGENPARAMETERISGISPROC PixelTexGenParameteriSGIS;
        /* 2726 */ PFNGLPIXELTEXGENPARAMETERIVSGISPROC PixelTexGenParameterivSGIS;
        /* 2727 */ PFNGLPIXELTEXGENPARAMETERFSGISPROC PixelTexGenParameterfSGIS;
        /* 2728 */ PFNGLPIXELTEXGENPARAMETERFVSGISPROC PixelTexGenParameterfvSGIS;
        /* 2729 */ PFNGLGETPIXELTEXGENPARAMETERIVSGISPROC GetPixelTexGenParameterivSGIS;
        /* 2730 */ PFNGLGETPIXELTEXGENPARAMETERFVSGISPROC GetPixelTexGenParameterfvSGIS;
        /* 2731 */ PFNGLPOINTPARAMETERFSGISPROC PointParameterfSGIS;
        /* 2732 */ PFNGLPOINTPARAMETERFVSGISPROC PointParameterfvSGIS;
        /* 2733 */ PFNGLSHARPENTEXFUNCSGISPROC SharpenTexFuncSGIS;
        /* 2734 */ PFNGLGETSHARPENTEXFUNCSGISPROC GetSharpenTexFuncSGIS;
        /* 2735 */ PFNGLTEXIMAGE4DSGISPROC TexImage4DSGIS;
        /* 2736 */ PFNGLTEXSUBIMAGE4DSGISPROC TexSubImage4DSGIS;
        /* 2737 */ PFNGLTEXTURECOLORMASKSGISPROC TextureColorMaskSGIS;
        /* 2738 */ PFNGLGETTEXFILTERFUNCSGISPROC GetTexFilterFuncSGIS;
        /* 2739 */ PFNGLTEXFILTERFUNCSGISPROC TexFilterFuncSGIS;
        /* 2740 */ PFNGLASYNCMARKERSGIXPROC AsyncMarkerSGIX;
        /* 2741 */ PFNGLFINISHASYNCSGIXPROC FinishAsyncSGIX;
        /* 2742 */ PFNGLPOLLASYNCSGIXPROC PollAsyncSGIX;
        /* 2743 */ PFNGLGENASYNCMARKERSSGIXPROC GenAsyncMarkersSGIX;
        /* 2744 */ PFNGLDELETEASYNCMARKERSSGIXPROC DeleteAsyncMarkersSGIX;
        /* 2745 */ PFNGLISASYNCMARKERSGIXPROC IsAsyncMarkerSGIX;
        /* 2746 */ PFNGLFLUSHRASTERSGIXPROC FlushRasterSGIX;
        /* 2747 */ PFNGLFRAGMENTCOLORMATERIALSGIXPROC FragmentColorMaterialSGIX;
        /* 2748 */ PFNGLFRAGMENTLIGHTFSGIXPROC FragmentLightfSGIX;
        /* 2749 */ PFNGLFRAGMENTLIGHTFVSGIXPROC FragmentLightfvSGIX;
        /* 2750 */ PFNGLFRAGMENTLIGHTISGIXPROC FragmentLightiSGIX;
        /* 2751 */ PFNGLFRAGMENTLIGHTIVSGIXPROC FragmentLightivSGIX;
        /* 2752 */ PFNGLFRAGMENTLIGHTMODELFSGIXPROC FragmentLightModelfSGIX;
        /* 2753 */ PFNGLFRAGMENTLIGHTMODELFVSGIXPROC FragmentLightModelfvSGIX;
        /* 2754 */ PFNGLFRAGMENTLIGHTMODELISGIXPROC FragmentLightModeliSGIX;
        /* 2755 */ PFNGLFRAGMENTLIGHTMODELIVSGIXPROC FragmentLightModelivSGIX;
        /* 2756 */ PFNGLFRAGMENTMATERIALFSGIXPROC FragmentMaterialfSGIX;
        /* 2757 */ PFNGLFRAGMENTMATERIALFVSGIXPROC FragmentMaterialfvSGIX;
        /* 2758 */ PFNGLFRAGMENTMATERIALISGIXPROC FragmentMaterialiSGIX;
        /* 2759 */ PFNGLFRAGMENTMATERIALIVSGIXPROC FragmentMaterialivSGIX;
        /* 2760 */ PFNGLGETFRAGMENTLIGHTFVSGIXPROC GetFragmentLightfvSGIX;
        /* 2761 */ PFNGLGETFRAGMENTLIGHTIVSGIXPROC GetFragmentLightivSGIX;
        /* 2762 */ PFNGLGETFRAGMENTMATERIALFVSGIXPROC GetFragmentMaterialfvSGIX;
        /* 2763 */ PFNGLGETFRAGMENTMATERIALIVSGIXPROC GetFragmentMaterialivSGIX;
        /* 2764 */ PFNGLLIGHTENVISGIXPROC LightEnviSGIX;
        /* 2765 */ PFNGLFRAMEZOOMSGIXPROC FrameZoomSGIX;
        /* 2766 */ PFNGLIGLOOINTERFACESGIXPROC IglooInterfaceSGIX;
        /* 2767 */ PFNGLGETINSTRUMENTSSGIXPROC GetInstrumentsSGIX;
        /* 2768 */ PFNGLINSTRUMENTSBUFFERSGIXPROC InstrumentsBufferSGIX;
        /* 2769 */ PFNGLPOLLINSTRUMENTSSGIXPROC PollInstrumentsSGIX;
        /* 2770 */ PFNGLREADINSTRUMENTSSGIXPROC ReadInstrumentsSGIX;
        /* 2771 */ PFNGLSTARTINSTRUMENTSSGIXPROC StartInstrumentsSGIX;
        /* 2772 */ PFNGLSTOPINSTRUMENTSSGIXPROC StopInstrumentsSGIX;
        /* 2773 */ PFNGLGETLISTPARAMETERFVSGIXPROC GetListParameterfvSGIX;
        /* 2774 */ PFNGLGETLISTPARAMETERIVSGIXPROC GetListParameterivSGIX;
        /* 2775 */ PFNGLLISTPARAMETERFSGIXPROC ListParameterfSGIX;
        /* 2776 */ PFNGLLISTPARAMETERFVSGIXPROC ListParameterfvSGIX;
        /* 2777 */ PFNGLLISTPARAMETERISGIXPROC ListParameteriSGIX;
        /* 2778 */ PFNGLLISTPARAMETERIVSGIXPROC ListParameterivSGIX;
        /* 2779 */ PFNGLPIXELTEXGENSGIXPROC PixelTexGenSGIX;
        /* 2780 */ PFNGLDEFORMATIONMAP3DSGIXPROC DeformationMap3dSGIX;
        /* 2781 */ PFNGLDEFORMATIONMAP3FSGIXPROC DeformationMap3fSGIX;
        /* 2782 */ PFNGLDEFORMSGIXPROC DeformSGIX;
        /* 2783 */ PFNGLLOADIDENTITYDEFORMATIONMAPSGIXPROC LoadIdentityDeformationMapSGIX;
        /* 2784 */ PFNGLREFERENCEPLANESGIXPROC ReferencePlaneSGIX;
        /* 2785 */ PFNGLSPRITEPARAMETERFSGIXPROC SpriteParameterfSGIX;
        /* 2786 */ PFNGLSPRITEPARAMETERFVSGIXPROC SpriteParameterfvSGIX;
        /* 2787 */ PFNGLSPRITEPARAMETERISGIXPROC SpriteParameteriSGIX;
        /* 2788 */ PFNGLSPRITEPARAMETERIVSGIXPROC SpriteParameterivSGIX;
        /* 2789 */ PFNGLTAGSAMPLEBUFFERSGIXPROC TagSampleBufferSGIX;
        /* 2790 */ PFNGLCOLORTABLESGIPROC ColorTableSGI;
        /* 2791 */ PFNGLCOLORTABLEPARAMETERFVSGIPROC ColorTableParameterfvSGI;
        /* 2792 */ PFNGLCOLORTABLEPARAMETERIVSGIPROC ColorTableParameterivSGI;
        /* 2793 */ PFNGLCOPYCOLORTABLESGIPROC CopyColorTableSGI;
        /* 2794 */ PFNGLGETCOLORTABLESGIPROC GetColorTableSGI;
        /* 2795 */ PFNGLGETCOLORTABLEPARAMETERFVSGIPROC GetColorTableParameterfvSGI;
        /* 2796 */ PFNGLGETCOLORTABLEPARAMETERIVSGIPROC GetColorTableParameterivSGI;
        /* 2797 */ PFNGLFINISHTEXTURESUNXPROC FinishTextureSUNX;
        /* 2798 */ PFNGLGLOBALALPHAFACTORBSUNPROC GlobalAlphaFactorbSUN;
        /* 2799 */ PFNGLGLOBALALPHAFACTORSSUNPROC GlobalAlphaFactorsSUN;
        /* 2800 */ PFNGLGLOBALALPHAFACTORISUNPROC GlobalAlphaFactoriSUN;
        /* 2801 */ PFNGLGLOBALALPHAFACTORFSUNPROC GlobalAlphaFactorfSUN;
        /* 2802 */ PFNGLGLOBALALPHAFACTORDSUNPROC GlobalAlphaFactordSUN;
        /* 2803 */ PFNGLGLOBALALPHAFACTORUBSUNPROC GlobalAlphaFactorubSUN;
        /* 2804 */ PFNGLGLOBALALPHAFACTORUSSUNPROC GlobalAlphaFactorusSUN;
        /* 2805 */ PFNGLGLOBALALPHAFACTORUISUNPROC GlobalAlphaFactoruiSUN;
        /* 2806 */ PFNGLDRAWMESHARRAYSSUNPROC DrawMeshArraysSUN;
        /* 2807 */ PFNGLREPLACEMENTCODEUISUNPROC ReplacementCodeuiSUN;
        /* 2808 */ PFNGLREPLACEMENTCODEUSSUNPROC ReplacementCodeusSUN;
        /* 2809 */ PFNGLREPLACEMENTCODEUBSUNPROC ReplacementCodeubSUN;
        /* 2810 */ PFNGLREPLACEMENTCODEUIVSUNPROC ReplacementCodeuivSUN;
        /* 2811 */ PFNGLREPLACEMENTCODEUSVSUNPROC ReplacementCodeusvSUN;
        /* 2812 */ PFNGLREPLACEMENTCODEUBVSUNPROC ReplacementCodeubvSUN;
        /* 2813 */ PFNGLREPLACEMENTCODEPOINTERSUNPROC ReplacementCodePointerSUN;
        /* 2814 */ PFNGLCOLOR4UBVERTEX2FSUNPROC Color4ubVertex2fSUN;
        /* 2815 */ PFNGLCOLOR4UBVERTEX2FVSUNPROC Color4ubVertex2fvSUN;
        /* 2816 */ PFNGLCOLOR4UBVERTEX3FSUNPROC Color4ubVertex3fSUN;
        /* 2817 */ PFNGLCOLOR4UBVERTEX3FVSUNPROC Color4ubVertex3fvSUN;
        /* 2818 */ PFNGLCOLOR3FVERTEX3FSUNPROC Color3fVertex3fSUN;
        /* 2819 */ PFNGLCOLOR3FVERTEX3FVSUNPROC Color3fVertex3fvSUN;
        /* 2820 */ PFNGLNORMAL3FVERTEX3FSUNPROC Normal3fVertex3fSUN;
        /* 2821 */ PFNGLNORMAL3FVERTEX3FVSUNPROC Normal3fVertex3fvSUN;
        /* 2822 */ PFNGLCOLOR4FNORMAL3FVERTEX3FSUNPROC Color4fNormal3fVertex3fSUN;
        /* 2823 */ PFNGLCOLOR4FNORMAL3FVERTEX3FVSUNPROC Color4fNormal3fVertex3fvSUN;
        /* 2824 */ PFNGLTEXCOORD2FVERTEX3FSUNPROC TexCoord2fVertex3fSUN;
        /* 2825 */ PFNGLTEXCOORD2FVERTEX3FVSUNPROC TexCoord2fVertex3fvSUN;
        /* 2826 */ PFNGLTEXCOORD4FVERTEX4FSUNPROC TexCoord4fVertex4fSUN;
        /* 2827 */ PFNGLTEXCOORD4FVERTEX4FVSUNPROC TexCoord4fVertex4fvSUN;
        /* 2828 */ PFNGLTEXCOORD2FCOLOR4UBVERTEX3FSUNPROC TexCoord2fColor4ubVertex3fSUN;
        /* 2829 */ PFNGLTEXCOORD2FCOLOR4UBVERTEX3FVSUNPROC TexCoord2fColor4ubVertex3fvSUN;
        /* 2830 */ PFNGLTEXCOORD2FCOLOR3FVERTEX3FSUNPROC TexCoord2fColor3fVertex3fSUN;
        /* 2831 */ PFNGLTEXCOORD2FCOLOR3FVERTEX3FVSUNPROC TexCoord2fColor3fVertex3fvSUN;
        /* 2832 */ PFNGLTEXCOORD2FNORMAL3FVERTEX3FSUNPROC TexCoord2fNormal3fVertex3fSUN;
        /* 2833 */ PFNGLTEXCOORD2FNORMAL3FVERTEX3FVSUNPROC TexCoord2fNormal3fVertex3fvSUN;
        /* 2834 */ PFNGLTEXCOORD2FCOLOR4FNORMAL3FVERTEX3FSUNPROC TexCoord2fColor4fNormal3fVertex3fSUN;
        /* 2835 */ PFNGLTEXCOORD2FCOLOR4FNORMAL3FVERTEX3FVSUNPROC TexCoord2fColor4fNormal3fVertex3fvSUN;
        /* 2836 */ PFNGLTEXCOORD4FCOLOR4FNORMAL3FVERTEX4FSUNPROC TexCoord4fColor4fNormal3fVertex4fSUN;
        /* 2837 */ PFNGLTEXCOORD4FCOLOR4FNORMAL3FVERTEX4FVSUNPROC TexCoord4fColor4fNormal3fVertex4fvSUN;
        /* 2838 */ PFNGLREPLACEMENTCODEUIVERTEX3FSUNPROC ReplacementCodeuiVertex3fSUN;
        /* 2839 */ PFNGLREPLACEMENTCODEUIVERTEX3FVSUNPROC ReplacementCodeuiVertex3fvSUN;
        /* 2840 */ PFNGLREPLACEMENTCODEUICOLOR4UBVERTEX3FSUNPROC ReplacementCodeuiColor4ubVertex3fSUN;
        /* 2841 */ PFNGLREPLACEMENTCODEUICOLOR4UBVERTEX3FVSUNPROC ReplacementCodeuiColor4ubVertex3fvSUN;
        /* 2842 */ PFNGLREPLACEMENTCODEUICOLOR3FVERTEX3FSUNPROC ReplacementCodeuiColor3fVertex3fSUN;
        /* 2843 */ PFNGLREPLACEMENTCODEUICOLOR3FVERTEX3FVSUNPROC ReplacementCodeuiColor3fVertex3fvSUN;
        /* 2844 */ PFNGLREPLACEMENTCODEUINORMAL3FVERTEX3FSUNPROC ReplacementCodeuiNormal3fVertex3fSUN;
        /* 2845 */ PFNGLREPLACEMENTCODEUINORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiNormal3fVertex3fvSUN;
        /* 2846 */ PFNGLREPLACEMENTCODEUICOLOR4FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiColor4fNormal3fVertex3fSUN;
        /* 2847 */ PFNGLREPLACEMENTCODEUICOLOR4FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiColor4fNormal3fVertex3fvSUN;
        /* 2848 */ PFNGLREPLACEMENTCODEUITEXCOORD2FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fVertex3fSUN;
        /* 2849 */ PFNGLREPLACEMENTCODEUITEXCOORD2FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fVertex3fvSUN;
        /* 2850 */ PFNGLREPLACEMENTCODEUITEXCOORD2FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fNormal3fVertex3fSUN;
        /* 2851 */ PFNGLREPLACEMENTCODEUITEXCOORD2FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fNormal3fVertex3fvSUN;
        /* 2852 */ PFNGLREPLACEMENTCODEUITEXCOORD2FCOLOR4FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fColor4fNormal3fVertex3fSUN;
        /* 2853 */ PFNGLREPLACEMENTCODEUITEXCOORD2FCOLOR4FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fColor4fNormal3fVertex3fvSUN;
        /* 2854 */ PFNGLBINDUNIFORMLOCATIONCHROMIUMPROC BindUniformLocationCHROMIUM;
        /* 2855 */ PFNGLCOVERAGEMODULATIONCHROMIUMPROC CoverageModulationCHROMIUM;
        /* 2856 */ PFNGLCOPYTEXTURECHROMIUMPROC CopyTextureCHROMIUM;
        /* 2857 */ PFNGLCOPYSUBTEXTURECHROMIUMPROC CopySubTextureCHROMIUM;
        /* 2858 */ PFNGLCOMPRESSEDCOPYTEXTURECHROMIUMPROC CompressedCopyTextureCHROMIUM;
        /* 2859 */ PFNGLREQUESTEXTENSIONANGLEPROC RequestExtensionANGLE;
        /* 2860 */ PFNGLACQUIRETEXTURESANGLEPROC AcquireTexturesANGLE;
        /* 2861 */ PFNGLRELEASETEXTURESANGLEPROC ReleaseTexturesANGLE;
        /* 2862 */ PFNGLGETBOOLEANVROBUSTANGLEPROC GetBooleanvRobustANGLE;
        /* 2863 */ PFNGLGETBUFFERPARAMETERIVROBUSTANGLEPROC GetBufferParameterivRobustANGLE;
        /* 2864 */ PFNGLGETBUFFERPARAMETERI64VROBUSTANGLEPROC GetBufferParameteri64vRobustANGLE;
        /* 2865 */ PFNGLGETFLOATVROBUSTANGLEPROC GetFloatvRobustANGLE;
        /* 2866 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVROBUSTANGLEPROC GetFramebufferAttachmentParameterivRobustANGLE;
        /* 2867 */ PFNGLGETINTEGERVROBUSTANGLEPROC GetIntegervRobustANGLE;
        /* 2868 */ PFNGLGETPROGRAMIVROBUSTANGLEPROC GetProgramivRobustANGLE;
        /* 2869 */ PFNGLGETRENDERBUFFERPARAMETERIVROBUSTANGLEPROC GetRenderbufferParameterivRobustANGLE;
        /* 2870 */ PFNGLGETSHADERIVROBUSTANGLEPROC GetShaderivRobustANGLE;
        /* 2871 */ PFNGLGETTEXPARAMETERFVROBUSTANGLEPROC GetTexParameterfvRobustANGLE;
        /* 2872 */ PFNGLGETTEXPARAMETERIVROBUSTANGLEPROC GetTexParameterivRobustANGLE;
        /* 2873 */ PFNGLGETUNIFORMFVROBUSTANGLEPROC GetUniformfvRobustANGLE;
        /* 2874 */ PFNGLGETUNIFORMIVROBUSTANGLEPROC GetUniformivRobustANGLE;
        /* 2875 */ PFNGLGETVERTEXATTRIBFVROBUSTANGLEPROC GetVertexAttribfvRobustANGLE;
        /* 2876 */ PFNGLGETVERTEXATTRIBIVROBUSTANGLEPROC GetVertexAttribivRobustANGLE;
        /* 2877 */ PFNGLGETVERTEXATTRIBPOINTERVROBUSTANGLEPROC GetVertexAttribPointervRobustANGLE;
        /* 2878 */ PFNGLREADPIXELSROBUSTANGLEPROC ReadPixelsRobustANGLE;
        /* 2879 */ PFNGLTEXIMAGE2DROBUSTANGLEPROC TexImage2DRobustANGLE;
        /* 2880 */ PFNGLTEXPARAMETERFVROBUSTANGLEPROC TexParameterfvRobustANGLE;
        /* 2881 */ PFNGLTEXPARAMETERIVROBUSTANGLEPROC TexParameterivRobustANGLE;
        /* 2882 */ PFNGLTEXSUBIMAGE2DROBUSTANGLEPROC TexSubImage2DRobustANGLE;
        /* 2883 */ PFNGLTEXIMAGE3DROBUSTANGLEPROC TexImage3DRobustANGLE;
        /* 2884 */ PFNGLTEXSUBIMAGE3DROBUSTANGLEPROC TexSubImage3DRobustANGLE;
        /* 2885 */ PFNGLGETQUERYIVROBUSTANGLEPROC GetQueryivRobustANGLE;
        /* 2886 */ PFNGLGETQUERYOBJECTUIVROBUSTANGLEPROC GetQueryObjectuivRobustANGLE;
        /* 2887 */ PFNGLGETBUFFERPOINTERVROBUSTANGLEPROC GetBufferPointervRobustANGLE;
        /* 2888 */ PFNGLGETINTEGERI_VROBUSTANGLEPROC GetIntegeri_vRobustANGLE;
        /* 2889 */ PFNGLGETINTERNALFORMATIVROBUSTANGLEPROC GetInternalformativRobustANGLE;
        /* 2890 */ PFNGLGETVERTEXATTRIBIIVROBUSTANGLEPROC GetVertexAttribIivRobustANGLE;
        /* 2891 */ PFNGLGETVERTEXATTRIBIUIVROBUSTANGLEPROC GetVertexAttribIuivRobustANGLE;
        /* 2892 */ PFNGLGETUNIFORMUIVROBUSTANGLEPROC GetUniformuivRobustANGLE;
        /* 2893 */ PFNGLGETACTIVEUNIFORMBLOCKIVROBUSTANGLEPROC GetActiveUniformBlockivRobustANGLE;
        /* 2894 */ PFNGLGETINTEGER64VROBUSTANGLEPROC GetInteger64vRobustANGLE;
        /* 2895 */ PFNGLGETINTEGER64I_VROBUSTANGLEPROC GetInteger64i_vRobustANGLE;
        /* 2896 */ PFNGLSAMPLERPARAMETERIVROBUSTANGLEPROC SamplerParameterivRobustANGLE;
        /* 2897 */ PFNGLSAMPLERPARAMETERFVROBUSTANGLEPROC SamplerParameterfvRobustANGLE;
        /* 2898 */ PFNGLGETSAMPLERPARAMETERIVROBUSTANGLEPROC GetSamplerParameterivRobustANGLE;
        /* 2899 */ PFNGLGETSAMPLERPARAMETERFVROBUSTANGLEPROC GetSamplerParameterfvRobustANGLE;
        /* 2900 */ PFNGLGETMULTISAMPLEFVROBUSTANGLEPROC GetMultisamplefvRobustANGLE;
        /* 2901 */ PFNGLGETTEXLEVELPARAMETERIVROBUSTANGLEPROC GetTexLevelParameterivRobustANGLE;
        /* 2902 */ PFNGLGETTEXLEVELPARAMETERFVROBUSTANGLEPROC GetTexLevelParameterfvRobustANGLE;
        /* 2903 */ PFNGLGETQUERYOBJECTIVROBUSTANGLEPROC GetQueryObjectivRobustANGLE;
        /* 2904 */ PFNGLGETQUERYOBJECTI64VROBUSTANGLEPROC GetQueryObjecti64vRobustANGLE;
        /* 2905 */ PFNGLGETQUERYOBJECTUI64VROBUSTANGLEPROC GetQueryObjectui64vRobustANGLE;
        /* 2906 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVROBUSTANGLEPROC GetFramebufferPixelLocalStorageParameterfvRobustANGLE;
        /* 2907 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVROBUSTANGLEPROC GetFramebufferPixelLocalStorageParameterivRobustANGLE;
        /* 2908 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERUIVROBUSTANGLEPROC GetFramebufferPixelLocalStorageParameteruivRobustANGLE;
        /* 2909 */ PFNGLCOPYTEXTURE3DANGLEPROC CopyTexture3DANGLE;
        /* 2910 */ PFNGLCOPYSUBTEXTURE3DANGLEPROC CopySubTexture3DANGLE;
        /* 2911 */ PFNGLTEXSTORAGE2DMULTISAMPLEANGLEPROC TexStorage2DMultisampleANGLE;
        /* 2912 */ PFNGLGETMULTISAMPLEFVANGLEPROC GetMultisamplefvANGLE;
        /* 2913 */ PFNGLSAMPLEMASKIANGLEPROC SampleMaskiANGLE;
        /* 2914 */ PFNGLMULTIDRAWARRAYSANGLEPROC MultiDrawArraysANGLE;
        /* 2915 */ PFNGLMULTIDRAWARRAYSINSTANCEDANGLEPROC MultiDrawArraysInstancedANGLE;
        /* 2916 */ PFNGLMULTIDRAWELEMENTSANGLEPROC MultiDrawElementsANGLE;
        /* 2917 */ PFNGLMULTIDRAWELEMENTSINSTANCEDANGLEPROC MultiDrawElementsInstancedANGLE;
        /* 2918 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEANGLEPROC DrawArraysInstancedBaseInstanceANGLE;
        /* 2919 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEANGLEPROC DrawElementsInstancedBaseVertexBaseInstanceANGLE;
        /* 2920 */ PFNGLMULTIDRAWARRAYSINSTANCEDBASEINSTANCEANGLEPROC MultiDrawArraysInstancedBaseInstanceANGLE;
        /* 2921 */ PFNGLMULTIDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEANGLEPROC MultiDrawElementsInstancedBaseVertexBaseInstanceANGLE;
        /* 2922 */ PFNGLPOLYGONMODEANGLEPROC PolygonModeANGLE;
        /* 2923 */ PFNGLPROVOKINGVERTEXANGLEPROC ProvokingVertexANGLE;
        /* 2924 */ PFNGLLOSECONTEXTCHROMIUMPROC LoseContextCHROMIUM;
        /* 2925 */ PFNGLTEXIMAGE2DEXTERNALANGLEPROC TexImage2DExternalANGLE;
        /* 2926 */ PFNGLINVALIDATETEXTUREANGLEPROC InvalidateTextureANGLE;
        /* 2927 */ PFNGLGETTEXIMAGEANGLEPROC GetTexImageANGLE;
        /* 2928 */ PFNGLGETCOMPRESSEDTEXIMAGEANGLEPROC GetCompressedTexImageANGLE;
        /* 2929 */ PFNGLGETRENDERBUFFERIMAGEANGLEPROC GetRenderbufferImageANGLE;
        /* 2930 */ PFNGLGETTEXLEVELPARAMETERFVANGLEPROC GetTexLevelParameterfvANGLE;
        /* 2931 */ PFNGLGETTEXLEVELPARAMETERIVANGLEPROC GetTexLevelParameterivANGLE;
        /* 2932 */ PFNGLTEXSTORAGEMEMFLAGS2DANGLEPROC TexStorageMemFlags2DANGLE;
        /* 2933 */ PFNGLTEXSTORAGEMEMFLAGS2DMULTISAMPLEANGLEPROC TexStorageMemFlags2DMultisampleANGLE;
        /* 2934 */ PFNGLTEXSTORAGEMEMFLAGS3DANGLEPROC TexStorageMemFlags3DANGLE;
        /* 2935 */ PFNGLTEXSTORAGEMEMFLAGS3DMULTISAMPLEANGLEPROC TexStorageMemFlags3DMultisampleANGLE;
        /* 2936 */ PFNGLIMPORTMEMORYZIRCONHANDLEANGLEPROC ImportMemoryZirconHandleANGLE;
        /* 2937 */ PFNGLIMPORTSEMAPHOREZIRCONHANDLEANGLEPROC ImportSemaphoreZirconHandleANGLE;
        /* 2938 */ PFNGLFRAMEBUFFERMEMORYLESSPIXELLOCALSTORAGEANGLEPROC FramebufferMemorylessPixelLocalStorageANGLE;
        /* 2939 */ PFNGLFRAMEBUFFERTEXTUREPIXELLOCALSTORAGEANGLEPROC FramebufferTexturePixelLocalStorageANGLE;
        /* 2940 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEFVANGLEPROC FramebufferPixelLocalClearValuefvANGLE;
        /* 2941 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEIVANGLEPROC FramebufferPixelLocalClearValueivANGLE;
        /* 2942 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEUIVANGLEPROC FramebufferPixelLocalClearValueuivANGLE;
        /* 2943 */ PFNGLBEGINPIXELLOCALSTORAGEANGLEPROC BeginPixelLocalStorageANGLE;
        /* 2944 */ PFNGLENDPIXELLOCALSTORAGEANGLEPROC EndPixelLocalStorageANGLE;
        /* 2945 */ PFNGLENDPIXELLOCALSTORAGEIMPLICITANGLEPROC EndPixelLocalStorageImplicitANGLE;
        /* 2946 */ PFNGLPIXELLOCALSTORAGEBARRIERANGLEPROC PixelLocalStorageBarrierANGLE;
        /* 2947 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGEINTERRUPTANGLEPROC FramebufferPixelLocalStorageInterruptANGLE;
        /* 2948 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGERESTOREANGLEPROC FramebufferPixelLocalStorageRestoreANGLE;
        /* 2949 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVANGLEPROC GetFramebufferPixelLocalStorageParameterfvANGLE;
        /* 2950 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVANGLEPROC GetFramebufferPixelLocalStorageParameterivANGLE;
        /* 2951 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERUIVANGLEPROC GetFramebufferPixelLocalStorageParameteruivANGLE;
        /* 2952 */ PFNGLLOGICOPANGLEPROC LogicOpANGLE;
        /* 2953 */ PFNGLBLOBCACHECALLBACKSANGLEPROC BlobCacheCallbacksANGLE;
        /* 2954 */ PFNGLGETPOINTERVANGLEPROC GetPointervANGLE;
        };
    };
    /* Built-in loader library handle.  Set by gloamLoaderLoad*Context when it
       opens the platform library.  Pre-populate before calling that function
       to supply your own handle (dlopen is then skipped); zero it before
       calling gloamLoaderUnload*Context to prevent it closing a handle you
       still own.  Present on all context types so user code can use a single
       field name regardless of API. */
    void *gloam_loader_handle;


} GloamGLContext;

/* Global context instance — a value, not a pointer, so the compiler knows
   its address is fixed and does not re-load it on every access. */
extern GloamGLContext gloam_gl_context;

/* ---- Feature presence macros --------------------------------------------
   Test whether a versioned feature was detected at load time. */
#define GLOAM_GL_VERSION_1_0 (gloam_gl_context.VERSION_1_0)
