/* Generated by gloam. DO NOT EDIT. */

#ifndef GLOAM_GLX_H
#define GLOAM_GLX_H

#ifdef GLX_H
  #error GLX (glx.h) header already included (API: glx), remove previous include!
#endif
#define GLX_H 1

#ifdef __linux

#include <X11/X.h>
#include <X11/Xlib.h>
#include <X11/Xutil.h>

#include <gloam/gl.h>

#include <stddef.h>
#include <stdint.h>


#ifdef __cplusplus
extern "C" {
#endif

/* Calling convention */
#ifndef APIENTRY
#  if defined(_WIN32)
#    define APIENTRY __stdcall
#  else
#    define APIENTRY
#  endif
#endif
#ifndef APIENTRYP
#  define APIENTRYP APIENTRY *
#endif
#ifndef GLAPI
#  define GLAPI extern
#endif

/* Calling convention for GL callback function pointers (e.g. debug callbacks,
   blob cache functions).  Piggybacks on APIENTRY if already defined so that
   code which defines APIENTRY before including this header gets consistent
   behaviour.  Guard against redefinition so multiple gloam headers included
   in the same translation unit don't conflict. */
#ifndef GLOAM_API_PTR
#  ifdef APIENTRY
#    define GLOAM_API_PTR APIENTRY
#  elif defined(_WIN32)
#    define GLOAM_API_PTR __stdcall
#  else
#    define GLOAM_API_PTR
#  endif
#endif
#ifndef GLAPIENTRY
#  define GLAPIENTRY GLOAM_API_PTR
#endif
/* ---- Constants ----------------------------------------------------------- */
#define GLX_EXTENSION_NAME "GLX" /* This is modest abuse of the enum tag mechanism, maybe a string tag? */
#define GLX_VENDOR 0x1
#define GLX_VERSION 0x2
#define GLX_EXTENSIONS 0x3

#define GLX_HEIGHT_SGIX 0x801E /* PbufferSGIX attribute */
#define GLX_EVENT_MASK_SGIX 0x801F /* PbufferSGIX attribute */
#define GLX_DAMAGED_SGIX 0x8020 /* BufferClobberSGIX event_type value */
#define GLX_SAVED_SGIX 0x8021 /* BufferClobberSGIX event_type value */
#define GLX_WINDOW_SGIX 0x8022 /* BufferClobberSGIX draw_type value */
#define GLX_PBUFFER_SGIX 0x8023 /* BufferClobberSGIX draw_type value */
#define GLX_BLENDED_RGBA_SGIS 0x8025 /* TRANSPARENT_TYPE_EXT attribute value */
#define GLX_MULTISAMPLE_SUB_RECT_WIDTH_SGIS 0x8026 /* Visual attribute (shared_multisample) */
#define GLX_MULTISAMPLE_SUB_RECT_HEIGHT_SGIS 0x8027 /* Visual attribute (shared_multisample) */
#define GLX_VISUAL_SELECT_GROUP_SGIX 0x8028 /* Visual attribute (visual_select_group) */
#define GLX_HYPERPIPE_ID_SGIX 0x8030
#define GLX_PBUFFER_HEIGHT 0x8040 /* CreateGLXPbuffer attribute */
#define GLX_PBUFFER_WIDTH 0x8041 /* CreateGLXPbuffer attribute */
#define GLX_SAMPLE_BUFFERS_3DFX 0x8050
#define GLX_SAMPLES_3DFX 0x8051
#define GLX_SWAP_METHOD_OML 0x8060
#define GLX_SWAP_EXCHANGE_OML 0x8061
#define GLX_SWAP_COPY_OML 0x8062
#define GLX_SWAP_UNDEFINED_OML 0x8063
#define GLX_EXCHANGE_COMPLETE_INTEL 0x8180
#define GLX_COPY_COMPLETE_INTEL 0x8181
#define GLX_FLIP_COMPLETE_INTEL 0x8182
#define GLX_RENDERER_VENDOR_ID_MESA 0x8183
#define GLX_RENDERER_DEVICE_ID_MESA 0x8184
#define GLX_RENDERER_VERSION_MESA 0x8185
#define GLX_RENDERER_ACCELERATED_MESA 0x8186
#define GLX_RENDERER_VIDEO_MEMORY_MESA 0x8187
#define GLX_RENDERER_UNIFIED_MEMORY_ARCHITECTURE_MESA 0x8188
#define GLX_RENDERER_PREFERRED_PROFILE_MESA 0x8189
#define GLX_RENDERER_OPENGL_CORE_PROFILE_VERSION_MESA 0x818A
#define GLX_RENDERER_OPENGL_COMPATIBILITY_PROFILE_VERSION_MESA 0x818B
#define GLX_RENDERER_OPENGL_ES_PROFILE_VERSION_MESA 0x818C
#define GLX_RENDERER_OPENGL_ES2_PROFILE_VERSION_MESA 0x818D
#define GLX_LOSE_CONTEXT_ON_RESET_ARB 0x8252
#define GLX_CONTEXT_RESET_NOTIFICATION_STRATEGY_ARB 0x8256
#define GLX_NO_RESET_NOTIFICATION_ARB 0x8261
#define GLX_CONTEXT_PROFILE_MASK_ARB 0x9126 /* Value shared with GL */
#define GLX_SAMPLE_BUFFERS 100000
#define GLX_SAMPLE_BUFFERS_ARB 100000
#define GLX_SAMPLE_BUFFERS_SGIS 100000
#define GLX_SAMPLES 100001
#define GLX_SAMPLES_ARB 100001
#define GLX_SAMPLES_SGIS 100001
#define GLX_COVERAGE_SAMPLES_NV 100001


/* ---- Types ----------------------------------------------------------------
   Emitted in topological dependency order. */

#if defined(__ENVIRONMENT_MAC_OS_X_VERSION_MIN_REQUIRED__) \
&& (__ENVIRONMENT_MAC_OS_X_VERSION_MIN_REQUIRED__ > 1060)
typedef long GLintptr;
#else
typedef ptrdiff_t GLintptr;
#endif

#if defined(__ENVIRONMENT_MAC_OS_X_VERSION_MIN_REQUIRED__) \
&& (__ENVIRONMENT_MAC_OS_X_VERSION_MIN_REQUIRED__ > 1060)
typedef long GLsizeiptr;
#else
typedef ptrdiff_t GLsizeiptr;
#endif

typedef struct __GLXFBConfigRec *GLXFBConfig;

typedef struct __GLXcontextRec *GLXContext;

typedef void (APIENTRY *__GLXextFuncPtr)(void);

typedef unsigned int GLXVideoDeviceNV;

typedef struct __GLXFBConfigRec *GLXFBConfigSGIX;

typedef struct {
    char    pipeName[80]; /* Should be [GLX_HYPERPIPE_PIPE_NAME_LENGTH_SGIX] */
    int     networkId;
} GLXHyperpipeNetworkSGIX;

typedef struct {
    char    pipeName[80]; /* Should be [GLX_HYPERPIPE_PIPE_NAME_LENGTH_SGIX] */
    int     channel;
    unsigned int participationType;
    int     timeSlice;
} GLXHyperpipeConfigSGIX;

typedef struct {
    char pipeName[80]; /* Should be [GLX_HYPERPIPE_PIPE_NAME_LENGTH_SGIX] */
    int srcXOrigin, srcYOrigin, srcWidth, srcHeight;
    int destXOrigin, destYOrigin, destWidth, destHeight;
} GLXPipeRect;

typedef struct {
    char pipeName[80]; /* Should be [GLX_HYPERPIPE_PIPE_NAME_LENGTH_SGIX] */
    int XOrigin, YOrigin, maxHeight, maxWidth;
} GLXPipeRectLimits;

typedef XID GLXFBConfigID;

typedef XID GLXContextID;

typedef XID GLXPixmap;

typedef XID GLXDrawable;

typedef XID GLXWindow;

typedef XID GLXPbuffer;

typedef XID GLXVideoCaptureDeviceNV;

typedef XID GLXVideoSourceSGIX;

typedef XID GLXFBConfigIDSGIX;

typedef XID GLXPbufferSGIX;

typedef struct {
    int event_type;             /* GLX_DAMAGED or GLX_SAVED */
    int draw_type;              /* GLX_WINDOW or GLX_PBUFFER */
    unsigned long serial;       /* # of last request processed by server */
    Bool send_event;            /* true if this came for SendEvent request */
    Display *display;           /* display the event was read from */
    GLXDrawable drawable;       /* XID of Drawable */
    unsigned int buffer_mask;   /* mask indicating which buffers are affected */
    unsigned int aux_buffer;    /* which aux buffer was affected */
    int x, y;
    int width, height;
    int count;                  /* if nonzero, at least this many more */
} GLXPbufferClobberEvent;

typedef struct {
    int type;
    unsigned long serial;
    Bool send_event;
    Display *display;
    int extension;
    int evtype;
    GLXDrawable window;
    Bool stereo_tree;
} GLXStereoNotifyEventEXT;

typedef struct {
    int type;
    unsigned long serial;   /* # of last request processed by server */
    Bool send_event;        /* true if this came for SendEvent request */
    Display *display;       /* display the event was read from */
    GLXDrawable drawable;   /* i.d. of Drawable */
    int event_type;         /* GLX_DAMAGED_SGIX or GLX_SAVED_SGIX */
    int draw_type;          /* GLX_WINDOW_SGIX or GLX_PBUFFER_SGIX */
    unsigned int mask;      /* mask indicating which buffers are affected*/
    int x, y;
    int width, height;
    int count;              /* if nonzero, at least this many more */
} GLXBufferClobberEventSGIX;

typedef struct {
    int type;
    unsigned long serial;       /* # of last request processed by server */
    Bool send_event;            /* true if this came from a SendEvent request */
    Display *display;           /* Display the event was read from */
    GLXDrawable drawable;       /* drawable on which event was requested in event mask */
    int event_type;
    int64_t ust;
    int64_t msc;
    int64_t sbc;
} GLXBufferSwapComplete;

typedef union __GLXEvent {
    GLXPbufferClobberEvent glxpbufferclobber;
    GLXBufferSwapComplete glxbufferswapcomplete;
    long pad[24];
} GLXEvent;


/* ---- PFN typedefs -------------------------------------------------------- */
typedef XVisualInfo * (APIENTRYP PFNGLXCHOOSEVISUALPROC)(Display * dpy, int screen, int * attribList);
typedef GLXContext (APIENTRYP PFNGLXCREATECONTEXTPROC)(Display * dpy, XVisualInfo * vis, GLXContext shareList, Bool direct);
typedef void (APIENTRYP PFNGLXDESTROYCONTEXTPROC)(Display * dpy, GLXContext ctx);
typedef Bool (APIENTRYP PFNGLXMAKECURRENTPROC)(Display * dpy, GLXDrawable drawable, GLXContext ctx);
typedef void (APIENTRYP PFNGLXCOPYCONTEXTPROC)(Display * dpy, GLXContext src, GLXContext dst, unsigned long mask);
typedef void (APIENTRYP PFNGLXSWAPBUFFERSPROC)(Display * dpy, GLXDrawable drawable);
typedef GLXPixmap (APIENTRYP PFNGLXCREATEGLXPIXMAPPROC)(Display * dpy, XVisualInfo * visual, Pixmap pixmap);
typedef void (APIENTRYP PFNGLXDESTROYGLXPIXMAPPROC)(Display * dpy, GLXPixmap pixmap);
typedef Bool (APIENTRYP PFNGLXQUERYEXTENSIONPROC)(Display * dpy, int * errorb, int * event);
typedef Bool (APIENTRYP PFNGLXQUERYVERSIONPROC)(Display * dpy, int * maj, int * min);
typedef Bool (APIENTRYP PFNGLXISDIRECTPROC)(Display * dpy, GLXContext ctx);
typedef int (APIENTRYP PFNGLXGETCONFIGPROC)(Display * dpy, XVisualInfo * visual, int attrib, int * value);
typedef GLXContext (APIENTRYP PFNGLXGETCURRENTCONTEXTPROC)(void);
typedef GLXDrawable (APIENTRYP PFNGLXGETCURRENTDRAWABLEPROC)(void);
typedef void (APIENTRYP PFNGLXWAITGLPROC)(void);
typedef void (APIENTRYP PFNGLXWAITXPROC)(void);
typedef void (APIENTRYP PFNGLXUSEXFONTPROC)(Font font, int first, int count, int list);
typedef const char * (APIENTRYP PFNGLXQUERYEXTENSIONSSTRINGPROC)(Display * dpy, int screen);
typedef const char * (APIENTRYP PFNGLXQUERYSERVERSTRINGPROC)(Display * dpy, int screen, int name);
typedef const char * (APIENTRYP PFNGLXGETCLIENTSTRINGPROC)(Display * dpy, int name);
typedef Display * (APIENTRYP PFNGLXGETCURRENTDISPLAYPROC)(void);
typedef GLXFBConfig * (APIENTRYP PFNGLXGETFBCONFIGSPROC)(Display * dpy, int screen, int * nelements);
typedef GLXFBConfig * (APIENTRYP PFNGLXCHOOSEFBCONFIGPROC)(Display * dpy, int screen, const int * attrib_list, int * nelements);
typedef int (APIENTRYP PFNGLXGETFBCONFIGATTRIBPROC)(Display * dpy, GLXFBConfig config, int attribute, int * value);
typedef XVisualInfo * (APIENTRYP PFNGLXGETVISUALFROMFBCONFIGPROC)(Display * dpy, GLXFBConfig config);
typedef GLXWindow (APIENTRYP PFNGLXCREATEWINDOWPROC)(Display * dpy, GLXFBConfig config, Window win, const int * attrib_list);
typedef void (APIENTRYP PFNGLXDESTROYWINDOWPROC)(Display * dpy, GLXWindow win);
typedef GLXPixmap (APIENTRYP PFNGLXCREATEPIXMAPPROC)(Display * dpy, GLXFBConfig config, Pixmap pixmap, const int * attrib_list);
typedef void (APIENTRYP PFNGLXDESTROYPIXMAPPROC)(Display * dpy, GLXPixmap pixmap);
typedef GLXPbuffer (APIENTRYP PFNGLXCREATEPBUFFERPROC)(Display * dpy, GLXFBConfig config, const int * attrib_list);
typedef void (APIENTRYP PFNGLXDESTROYPBUFFERPROC)(Display * dpy, GLXPbuffer pbuf);
typedef void (APIENTRYP PFNGLXQUERYDRAWABLEPROC)(Display * dpy, GLXDrawable draw, int attribute, unsigned int * value);
typedef GLXContext (APIENTRYP PFNGLXCREATENEWCONTEXTPROC)(Display * dpy, GLXFBConfig config, int render_type, GLXContext share_list, Bool direct);
typedef Bool (APIENTRYP PFNGLXMAKECONTEXTCURRENTPROC)(Display * dpy, GLXDrawable draw, GLXDrawable read, GLXContext ctx);
typedef GLXDrawable (APIENTRYP PFNGLXGETCURRENTREADDRAWABLEPROC)(void);
typedef int (APIENTRYP PFNGLXQUERYCONTEXTPROC)(Display * dpy, GLXContext ctx, int attribute, int * value);
typedef void (APIENTRYP PFNGLXSELECTEVENTPROC)(Display * dpy, GLXDrawable draw, unsigned long event_mask);
typedef void (APIENTRYP PFNGLXGETSELECTEDEVENTPROC)(Display * dpy, GLXDrawable draw, unsigned long * event_mask);
typedef __GLXextFuncPtr (APIENTRYP PFNGLXGETPROCADDRESSPROC)(const GLubyte * procName);
typedef unsigned int (APIENTRYP PFNGLXGETGPUIDSAMDPROC)(unsigned int maxCount, unsigned int * ids);
typedef int (APIENTRYP PFNGLXGETGPUINFOAMDPROC)(unsigned int id, int property, GLenum dataType, unsigned int size, void * data);
typedef unsigned int (APIENTRYP PFNGLXGETCONTEXTGPUIDAMDPROC)(GLXContext ctx);
typedef GLXContext (APIENTRYP PFNGLXCREATEASSOCIATEDCONTEXTAMDPROC)(unsigned int id, GLXContext share_list);
typedef GLXContext (APIENTRYP PFNGLXCREATEASSOCIATEDCONTEXTATTRIBSAMDPROC)(unsigned int id, GLXContext share_context, const int * attribList);
typedef Bool (APIENTRYP PFNGLXDELETEASSOCIATEDCONTEXTAMDPROC)(GLXContext ctx);
typedef Bool (APIENTRYP PFNGLXMAKEASSOCIATEDCONTEXTCURRENTAMDPROC)(GLXContext ctx);
typedef GLXContext (APIENTRYP PFNGLXGETCURRENTASSOCIATEDCONTEXTAMDPROC)(void);
typedef void (APIENTRYP PFNGLXBLITCONTEXTFRAMEBUFFERAMDPROC)(GLXContext dstCtx, GLint srcX0, GLint srcY0, GLint srcX1, GLint srcY1, GLint dstX0, GLint dstY0, GLint dstX1, GLint dstY1, GLbitfield mask, GLenum filter);
typedef GLXContext (APIENTRYP PFNGLXCREATECONTEXTATTRIBSARBPROC)(Display * dpy, GLXFBConfig config, GLXContext share_context, Bool direct, const int * attrib_list);
typedef __GLXextFuncPtr (APIENTRYP PFNGLXGETPROCADDRESSARBPROC)(const GLubyte * procName);
typedef Display * (APIENTRYP PFNGLXGETCURRENTDISPLAYEXTPROC)(void);
typedef int (APIENTRYP PFNGLXQUERYCONTEXTINFOEXTPROC)(Display * dpy, GLXContext context, int attribute, int * value);
typedef GLXContextID (APIENTRYP PFNGLXGETCONTEXTIDEXTPROC)(const GLXContext context);
typedef GLXContext (APIENTRYP PFNGLXIMPORTCONTEXTEXTPROC)(Display * dpy, GLXContextID contextID);
typedef void (APIENTRYP PFNGLXFREECONTEXTEXTPROC)(Display * dpy, GLXContext context);
typedef void (APIENTRYP PFNGLXSWAPINTERVALEXTPROC)(Display * dpy, GLXDrawable drawable, int interval);
typedef void (APIENTRYP PFNGLXBINDTEXIMAGEEXTPROC)(Display * dpy, GLXDrawable drawable, int buffer, const int * attrib_list);
typedef void (APIENTRYP PFNGLXRELEASETEXIMAGEEXTPROC)(Display * dpy, GLXDrawable drawable, int buffer);
typedef unsigned int (APIENTRYP PFNGLXGETAGPOFFSETMESAPROC)(const void * pointer);
typedef void (APIENTRYP PFNGLXCOPYSUBBUFFERMESAPROC)(Display * dpy, GLXDrawable drawable, int x, int y, int width, int height);
typedef GLXPixmap (APIENTRYP PFNGLXCREATEGLXPIXMAPMESAPROC)(Display * dpy, XVisualInfo * visual, Pixmap pixmap, Colormap cmap);
typedef Bool (APIENTRYP PFNGLXQUERYCURRENTRENDERERINTEGERMESAPROC)(int attribute, unsigned int * value);
typedef const char * (APIENTRYP PFNGLXQUERYCURRENTRENDERERSTRINGMESAPROC)(int attribute);
typedef Bool (APIENTRYP PFNGLXQUERYRENDERERINTEGERMESAPROC)(Display * dpy, int screen, int renderer, int attribute, unsigned int * value);
typedef const char * (APIENTRYP PFNGLXQUERYRENDERERSTRINGMESAPROC)(Display * dpy, int screen, int renderer, int attribute);
typedef Bool (APIENTRYP PFNGLXRELEASEBUFFERSMESAPROC)(Display * dpy, GLXDrawable drawable);
typedef GLboolean (APIENTRYP PFNGLXSET3DFXMODEMESAPROC)(GLint mode);
typedef int (APIENTRYP PFNGLXGETSWAPINTERVALMESAPROC)(void);
typedef int (APIENTRYP PFNGLXSWAPINTERVALMESAPROC)(unsigned int interval);
typedef void (APIENTRYP PFNGLXCOPYBUFFERSUBDATANVPROC)(Display * dpy, GLXContext readCtx, GLXContext writeCtx, GLenum readTarget, GLenum writeTarget, GLintptr readOffset, GLintptr writeOffset, GLsizeiptr size);
typedef void (APIENTRYP PFNGLXNAMEDCOPYBUFFERSUBDATANVPROC)(Display * dpy, GLXContext readCtx, GLXContext writeCtx, GLuint readBuffer, GLuint writeBuffer, GLintptr readOffset, GLintptr writeOffset, GLsizeiptr size);
typedef void (APIENTRYP PFNGLXCOPYIMAGESUBDATANVPROC)(Display * dpy, GLXContext srcCtx, GLuint srcName, GLenum srcTarget, GLint srcLevel, GLint srcX, GLint srcY, GLint srcZ, GLXContext dstCtx, GLuint dstName, GLenum dstTarget, GLint dstLevel, GLint dstX, GLint dstY, GLint dstZ, GLsizei width, GLsizei height, GLsizei depth);
typedef Bool (APIENTRYP PFNGLXDELAYBEFORESWAPNVPROC)(Display * dpy, GLXDrawable drawable, GLfloat seconds);
typedef unsigned int * (APIENTRYP PFNGLXENUMERATEVIDEODEVICESNVPROC)(Display * dpy, int screen, int * nelements);
typedef int (APIENTRYP PFNGLXBINDVIDEODEVICENVPROC)(Display * dpy, unsigned int video_slot, unsigned int video_device, const int * attrib_list);
typedef Bool (APIENTRYP PFNGLXJOINSWAPGROUPNVPROC)(Display * dpy, GLXDrawable drawable, GLuint group);
typedef Bool (APIENTRYP PFNGLXBINDSWAPBARRIERNVPROC)(Display * dpy, GLuint group, GLuint barrier);
typedef Bool (APIENTRYP PFNGLXQUERYSWAPGROUPNVPROC)(Display * dpy, GLXDrawable drawable, GLuint * group, GLuint * barrier);
typedef Bool (APIENTRYP PFNGLXQUERYMAXSWAPGROUPSNVPROC)(Display * dpy, int screen, GLuint * maxGroups, GLuint * maxBarriers);
typedef Bool (APIENTRYP PFNGLXQUERYFRAMECOUNTNVPROC)(Display * dpy, int screen, GLuint * count);
typedef Bool (APIENTRYP PFNGLXRESETFRAMECOUNTNVPROC)(Display * dpy, int screen);
typedef int (APIENTRYP PFNGLXBINDVIDEOCAPTUREDEVICENVPROC)(Display * dpy, unsigned int video_capture_slot, GLXVideoCaptureDeviceNV device);
typedef GLXVideoCaptureDeviceNV * (APIENTRYP PFNGLXENUMERATEVIDEOCAPTUREDEVICESNVPROC)(Display * dpy, int screen, int * nelements);
typedef void (APIENTRYP PFNGLXLOCKVIDEOCAPTUREDEVICENVPROC)(Display * dpy, GLXVideoCaptureDeviceNV device);
typedef int (APIENTRYP PFNGLXQUERYVIDEOCAPTUREDEVICENVPROC)(Display * dpy, GLXVideoCaptureDeviceNV device, int attribute, int * value);
typedef void (APIENTRYP PFNGLXRELEASEVIDEOCAPTUREDEVICENVPROC)(Display * dpy, GLXVideoCaptureDeviceNV device);
typedef int (APIENTRYP PFNGLXGETVIDEODEVICENVPROC)(Display * dpy, int screen, int numVideoDevices, GLXVideoDeviceNV * pVideoDevice);
typedef int (APIENTRYP PFNGLXRELEASEVIDEODEVICENVPROC)(Display * dpy, int screen, GLXVideoDeviceNV VideoDevice);
typedef int (APIENTRYP PFNGLXBINDVIDEOIMAGENVPROC)(Display * dpy, GLXVideoDeviceNV VideoDevice, GLXPbuffer pbuf, int iVideoBuffer);
typedef int (APIENTRYP PFNGLXRELEASEVIDEOIMAGENVPROC)(Display * dpy, GLXPbuffer pbuf);
typedef int (APIENTRYP PFNGLXSENDPBUFFERTOVIDEONVPROC)(Display * dpy, GLXPbuffer pbuf, int iBufferType, unsigned long * pulCounterPbuffer, GLboolean bBlock);
typedef int (APIENTRYP PFNGLXGETVIDEOINFONVPROC)(Display * dpy, int screen, GLXVideoDeviceNV VideoDevice, unsigned long * pulCounterOutputPbuffer, unsigned long * pulCounterOutputVideo);
typedef Bool (APIENTRYP PFNGLXGETSYNCVALUESOMLPROC)(Display * dpy, GLXDrawable drawable, int64_t * ust, int64_t * msc, int64_t * sbc);
typedef Bool (APIENTRYP PFNGLXGETMSCRATEOMLPROC)(Display * dpy, GLXDrawable drawable, int32_t * numerator, int32_t * denominator);
typedef int64_t (APIENTRYP PFNGLXSWAPBUFFERSMSCOMLPROC)(Display * dpy, GLXDrawable drawable, int64_t target_msc, int64_t divisor, int64_t remainder);
typedef Bool (APIENTRYP PFNGLXWAITFORMSCOMLPROC)(Display * dpy, GLXDrawable drawable, int64_t target_msc, int64_t divisor, int64_t remainder, int64_t * ust, int64_t * msc, int64_t * sbc);
typedef Bool (APIENTRYP PFNGLXWAITFORSBCOMLPROC)(Display * dpy, GLXDrawable drawable, int64_t target_sbc, int64_t * ust, int64_t * msc, int64_t * sbc);
typedef void (APIENTRYP PFNGLXCUSHIONSGIPROC)(Display * dpy, Window window, float cushion);
typedef Bool (APIENTRYP PFNGLXMAKECURRENTREADSGIPROC)(Display * dpy, GLXDrawable draw, GLXDrawable read, GLXContext ctx);
typedef GLXDrawable (APIENTRYP PFNGLXGETCURRENTREADDRAWABLESGIPROC)(void);
typedef int (APIENTRYP PFNGLXSWAPINTERVALSGIPROC)(int interval);
typedef int (APIENTRYP PFNGLXGETVIDEOSYNCSGIPROC)(unsigned int * count);
typedef int (APIENTRYP PFNGLXWAITVIDEOSYNCSGIPROC)(int divisor, int remainder, unsigned int * count);
typedef int (APIENTRYP PFNGLXGETFBCONFIGATTRIBSGIXPROC)(Display * dpy, GLXFBConfigSGIX config, int attribute, int * value);
typedef GLXFBConfigSGIX * (APIENTRYP PFNGLXCHOOSEFBCONFIGSGIXPROC)(Display * dpy, int screen, int * attrib_list, int * nelements);
typedef GLXPixmap (APIENTRYP PFNGLXCREATEGLXPIXMAPWITHCONFIGSGIXPROC)(Display * dpy, GLXFBConfigSGIX config, Pixmap pixmap);
typedef GLXContext (APIENTRYP PFNGLXCREATECONTEXTWITHCONFIGSGIXPROC)(Display * dpy, GLXFBConfigSGIX config, int render_type, GLXContext share_list, Bool direct);
typedef XVisualInfo * (APIENTRYP PFNGLXGETVISUALFROMFBCONFIGSGIXPROC)(Display * dpy, GLXFBConfigSGIX config);
typedef GLXFBConfigSGIX (APIENTRYP PFNGLXGETFBCONFIGFROMVISUALSGIXPROC)(Display * dpy, XVisualInfo * vis);
typedef GLXHyperpipeNetworkSGIX * (APIENTRYP PFNGLXQUERYHYPERPIPENETWORKSGIXPROC)(Display * dpy, int * npipes);
typedef int (APIENTRYP PFNGLXHYPERPIPECONFIGSGIXPROC)(Display * dpy, int networkId, int npipes, GLXHyperpipeConfigSGIX * cfg, int * hpId);
typedef GLXHyperpipeConfigSGIX * (APIENTRYP PFNGLXQUERYHYPERPIPECONFIGSGIXPROC)(Display * dpy, int hpId, int * npipes);
typedef int (APIENTRYP PFNGLXDESTROYHYPERPIPECONFIGSGIXPROC)(Display * dpy, int hpId);
typedef int (APIENTRYP PFNGLXBINDHYPERPIPESGIXPROC)(Display * dpy, int hpId);
typedef int (APIENTRYP PFNGLXQUERYHYPERPIPEBESTATTRIBSGIXPROC)(Display * dpy, int timeSlice, int attrib, int size, void * attribList, void * returnAttribList);
typedef int (APIENTRYP PFNGLXHYPERPIPEATTRIBSGIXPROC)(Display * dpy, int timeSlice, int attrib, int size, void * attribList);
typedef int (APIENTRYP PFNGLXQUERYHYPERPIPEATTRIBSGIXPROC)(Display * dpy, int timeSlice, int attrib, int size, void * returnAttribList);
typedef GLXPbufferSGIX (APIENTRYP PFNGLXCREATEGLXPBUFFERSGIXPROC)(Display * dpy, GLXFBConfigSGIX config, unsigned int width, unsigned int height, int * attrib_list);
typedef void (APIENTRYP PFNGLXDESTROYGLXPBUFFERSGIXPROC)(Display * dpy, GLXPbufferSGIX pbuf);
typedef void (APIENTRYP PFNGLXQUERYGLXPBUFFERSGIXPROC)(Display * dpy, GLXPbufferSGIX pbuf, int attribute, unsigned int * value);
typedef void (APIENTRYP PFNGLXSELECTEVENTSGIXPROC)(Display * dpy, GLXDrawable drawable, unsigned long mask);
typedef void (APIENTRYP PFNGLXGETSELECTEDEVENTSGIXPROC)(Display * dpy, GLXDrawable drawable, unsigned long * mask);
typedef void (APIENTRYP PFNGLXBINDSWAPBARRIERSGIXPROC)(Display * dpy, GLXDrawable drawable, int barrier);
typedef Bool (APIENTRYP PFNGLXQUERYMAXSWAPBARRIERSSGIXPROC)(Display * dpy, int screen, int * max);
typedef void (APIENTRYP PFNGLXJOINSWAPGROUPSGIXPROC)(Display * dpy, GLXDrawable drawable, GLXDrawable member);
typedef int (APIENTRYP PFNGLXBINDCHANNELTOWINDOWSGIXPROC)(Display * display, int screen, int channel, Window window);
typedef int (APIENTRYP PFNGLXCHANNELRECTSGIXPROC)(Display * display, int screen, int channel, int x, int y, int w, int h);
typedef int (APIENTRYP PFNGLXQUERYCHANNELRECTSGIXPROC)(Display * display, int screen, int channel, int * dx, int * dy, int * dw, int * dh);
typedef int (APIENTRYP PFNGLXQUERYCHANNELDELTASSGIXPROC)(Display * display, int screen, int channel, int * x, int * y, int * w, int * h);
typedef int (APIENTRYP PFNGLXCHANNELRECTSYNCSGIXPROC)(Display * display, int screen, int channel, GLenum synctype);
typedef Status (APIENTRYP PFNGLXGETTRANSPARENTINDEXSUNPROC)(Display * dpy, Window overlay, Window underlay, unsigned long * pTransparentIndex);



/* ---- Context struct ------------------------------------------------------
   Three anonymous unions give both indexed (array) and named (struct member)
   access to the same memory, at zero runtime cost.

   featArray / extArray: unsigned char flags, one per feature / extension.
   pfnArray: function pointer slots, one per command.

   Anonymous structs inside the unions are a C11 / GCC extension; they are
   universally supported on our target compilers. */
typedef struct GloamGLXContext {
    union {
        unsigned char featArray[5];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        /*    1 */ unsigned char VERSION_1_1;
        /*    2 */ unsigned char VERSION_1_2;
        /*    3 */ unsigned char VERSION_1_3;
        /*    4 */ unsigned char VERSION_1_4;
        };
    };

    union {
        unsigned char extArray[66];
        struct {
        /*    0 */ unsigned char _3DFX_multisample;
        /*    1 */ unsigned char AMD_gpu_association;
        /*    2 */ unsigned char ARB_context_flush_control;
        /*    3 */ unsigned char ARB_create_context;
        /*    4 */ unsigned char ARB_create_context_no_error;
        /*    5 */ unsigned char ARB_create_context_profile;
        /*    6 */ unsigned char ARB_create_context_robustness;
        /*    7 */ unsigned char ARB_fbconfig_float;
        /*    8 */ unsigned char ARB_framebuffer_sRGB;
        /*    9 */ unsigned char ARB_get_proc_address;
        /*   10 */ unsigned char ARB_multisample;
        /*   11 */ unsigned char ARB_robustness_application_isolation;
        /*   12 */ unsigned char ARB_robustness_share_group_isolation;
        /*   13 */ unsigned char ARB_vertex_buffer_object;
        /*   14 */ unsigned char EXT_buffer_age;
        /*   15 */ unsigned char EXT_context_priority;
        /*   16 */ unsigned char EXT_create_context_es2_profile;
        /*   17 */ unsigned char EXT_create_context_es_profile;
        /*   18 */ unsigned char EXT_fbconfig_packed_float;
        /*   19 */ unsigned char EXT_framebuffer_sRGB;
        /*   20 */ unsigned char EXT_get_drawable_type;
        /*   21 */ unsigned char EXT_import_context;
        /*   22 */ unsigned char EXT_libglvnd;
        /*   23 */ unsigned char EXT_no_config_context;
        /*   24 */ unsigned char EXT_stereo_tree;
        /*   25 */ unsigned char EXT_swap_control;
        /*   26 */ unsigned char EXT_swap_control_tear;
        /*   27 */ unsigned char EXT_texture_from_pixmap;
        /*   28 */ unsigned char EXT_visual_info;
        /*   29 */ unsigned char EXT_visual_rating;
        /*   30 */ unsigned char INTEL_swap_event;
        /*   31 */ unsigned char MESA_agp_offset;
        /*   32 */ unsigned char MESA_copy_sub_buffer;
        /*   33 */ unsigned char MESA_pixmap_colormap;
        /*   34 */ unsigned char MESA_query_renderer;
        /*   35 */ unsigned char MESA_release_buffers;
        /*   36 */ unsigned char MESA_set_3dfx_mode;
        /*   37 */ unsigned char MESA_swap_control;
        /*   38 */ unsigned char NV_copy_buffer;
        /*   39 */ unsigned char NV_copy_image;
        /*   40 */ unsigned char NV_delay_before_swap;
        /*   41 */ unsigned char NV_float_buffer;
        /*   42 */ unsigned char NV_multigpu_context;
        /*   43 */ unsigned char NV_multisample_coverage;
        /*   44 */ unsigned char NV_present_video;
        /*   45 */ unsigned char NV_robustness_video_memory_purge;
        /*   46 */ unsigned char NV_swap_group;
        /*   47 */ unsigned char NV_video_capture;
        /*   48 */ unsigned char NV_video_out;
        /*   49 */ unsigned char OML_swap_method;
        /*   50 */ unsigned char OML_sync_control;
        /*   51 */ unsigned char SGIS_blended_overlay;
        /*   52 */ unsigned char SGIS_multisample;
        /*   53 */ unsigned char SGIS_shared_multisample;
        /*   54 */ unsigned char SGIX_fbconfig;
        /*   55 */ unsigned char SGIX_hyperpipe;
        /*   56 */ unsigned char SGIX_pbuffer;
        /*   57 */ unsigned char SGIX_swap_barrier;
        /*   58 */ unsigned char SGIX_swap_group;
        /*   59 */ unsigned char SGIX_video_resize;
        /*   60 */ unsigned char SGIX_visual_select_group;
        /*   61 */ unsigned char SGI_cushion;
        /*   62 */ unsigned char SGI_make_current_read;
        /*   63 */ unsigned char SGI_swap_control;
        /*   64 */ unsigned char SGI_video_sync;
        /*   65 */ unsigned char SUN_get_transparent_index;
        };
    };

    union {
        void *pfnArray[131];
        struct {
        /*    0 */ PFNGLXCHOOSEVISUALPROC ChooseVisual;
        /*    1 */ PFNGLXCREATECONTEXTPROC CreateContext;
        /*    2 */ PFNGLXDESTROYCONTEXTPROC DestroyContext;
        /*    3 */ PFNGLXMAKECURRENTPROC MakeCurrent;
        /*    4 */ PFNGLXCOPYCONTEXTPROC CopyContext;
        /*    5 */ PFNGLXSWAPBUFFERSPROC SwapBuffers;
        /*    6 */ PFNGLXCREATEGLXPIXMAPPROC CreateGLXPixmap;
        /*    7 */ PFNGLXDESTROYGLXPIXMAPPROC DestroyGLXPixmap;
        /*    8 */ PFNGLXQUERYEXTENSIONPROC QueryExtension;
        /*    9 */ PFNGLXQUERYVERSIONPROC QueryVersion;
        /*   10 */ PFNGLXISDIRECTPROC IsDirect;
        /*   11 */ PFNGLXGETCONFIGPROC GetConfig;
        /*   12 */ PFNGLXGETCURRENTCONTEXTPROC GetCurrentContext;
        /*   13 */ PFNGLXGETCURRENTDRAWABLEPROC GetCurrentDrawable;
        /*   14 */ PFNGLXWAITGLPROC WaitGL;
        /*   15 */ PFNGLXWAITXPROC WaitX;
        /*   16 */ PFNGLXUSEXFONTPROC UseXFont;
        /*   17 */ PFNGLXQUERYEXTENSIONSSTRINGPROC QueryExtensionsString;
        /*   18 */ PFNGLXQUERYSERVERSTRINGPROC QueryServerString;
        /*   19 */ PFNGLXGETCLIENTSTRINGPROC GetClientString;
        /*   20 */ PFNGLXGETCURRENTDISPLAYPROC GetCurrentDisplay;
        /*   21 */ PFNGLXGETFBCONFIGSPROC GetFBConfigs;
        /*   22 */ PFNGLXCHOOSEFBCONFIGPROC ChooseFBConfig;
        /*   23 */ PFNGLXGETFBCONFIGATTRIBPROC GetFBConfigAttrib;
        /*   24 */ PFNGLXGETVISUALFROMFBCONFIGPROC GetVisualFromFBConfig;
        /*   25 */ PFNGLXCREATEWINDOWPROC CreateWindow;
        /*   26 */ PFNGLXDESTROYWINDOWPROC DestroyWindow;
        /*   27 */ PFNGLXCREATEPIXMAPPROC CreatePixmap;
        /*   28 */ PFNGLXDESTROYPIXMAPPROC DestroyPixmap;
        /*   29 */ PFNGLXCREATEPBUFFERPROC CreatePbuffer;
        /*   30 */ PFNGLXDESTROYPBUFFERPROC DestroyPbuffer;
        /*   31 */ PFNGLXQUERYDRAWABLEPROC QueryDrawable;
        /*   32 */ PFNGLXCREATENEWCONTEXTPROC CreateNewContext;
        /*   33 */ PFNGLXMAKECONTEXTCURRENTPROC MakeContextCurrent;
        /*   34 */ PFNGLXGETCURRENTREADDRAWABLEPROC GetCurrentReadDrawable;
        /*   35 */ PFNGLXQUERYCONTEXTPROC QueryContext;
        /*   36 */ PFNGLXSELECTEVENTPROC SelectEvent;
        /*   37 */ PFNGLXGETSELECTEDEVENTPROC GetSelectedEvent;
        /*   38 */ PFNGLXGETPROCADDRESSPROC GetProcAddress;
        /*   39 */ PFNGLXGETGPUIDSAMDPROC GetGPUIDsAMD;
        /*   40 */ PFNGLXGETGPUINFOAMDPROC GetGPUInfoAMD;
        /*   41 */ PFNGLXGETCONTEXTGPUIDAMDPROC GetContextGPUIDAMD;
        /*   42 */ PFNGLXCREATEASSOCIATEDCONTEXTAMDPROC CreateAssociatedContextAMD;
        /*   43 */ PFNGLXCREATEASSOCIATEDCONTEXTATTRIBSAMDPROC CreateAssociatedContextAttribsAMD;
        /*   44 */ PFNGLXDELETEASSOCIATEDCONTEXTAMDPROC DeleteAssociatedContextAMD;
        /*   45 */ PFNGLXMAKEASSOCIATEDCONTEXTCURRENTAMDPROC MakeAssociatedContextCurrentAMD;
        /*   46 */ PFNGLXGETCURRENTASSOCIATEDCONTEXTAMDPROC GetCurrentAssociatedContextAMD;
        /*   47 */ PFNGLXBLITCONTEXTFRAMEBUFFERAMDPROC BlitContextFramebufferAMD;
        /*   48 */ PFNGLXCREATECONTEXTATTRIBSARBPROC CreateContextAttribsARB;
        /*   49 */ PFNGLXGETPROCADDRESSARBPROC GetProcAddressARB;
        /*   50 */ PFNGLXGETCURRENTDISPLAYEXTPROC GetCurrentDisplayEXT;
        /*   51 */ PFNGLXQUERYCONTEXTINFOEXTPROC QueryContextInfoEXT;
        /*   52 */ PFNGLXGETCONTEXTIDEXTPROC GetContextIDEXT;
        /*   53 */ PFNGLXIMPORTCONTEXTEXTPROC ImportContextEXT;
        /*   54 */ PFNGLXFREECONTEXTEXTPROC FreeContextEXT;
        /*   55 */ PFNGLXSWAPINTERVALEXTPROC SwapIntervalEXT;
        /*   56 */ PFNGLXBINDTEXIMAGEEXTPROC BindTexImageEXT;
        /*   57 */ PFNGLXRELEASETEXIMAGEEXTPROC ReleaseTexImageEXT;
        /*   58 */ PFNGLXGETAGPOFFSETMESAPROC GetAGPOffsetMESA;
        /*   59 */ PFNGLXCOPYSUBBUFFERMESAPROC CopySubBufferMESA;
        /*   60 */ PFNGLXCREATEGLXPIXMAPMESAPROC CreateGLXPixmapMESA;
        /*   61 */ PFNGLXQUERYCURRENTRENDERERINTEGERMESAPROC QueryCurrentRendererIntegerMESA;
        /*   62 */ PFNGLXQUERYCURRENTRENDERERSTRINGMESAPROC QueryCurrentRendererStringMESA;
        /*   63 */ PFNGLXQUERYRENDERERINTEGERMESAPROC QueryRendererIntegerMESA;
        /*   64 */ PFNGLXQUERYRENDERERSTRINGMESAPROC QueryRendererStringMESA;
        /*   65 */ PFNGLXRELEASEBUFFERSMESAPROC ReleaseBuffersMESA;
        /*   66 */ PFNGLXSET3DFXMODEMESAPROC Set3DfxModeMESA;
        /*   67 */ PFNGLXGETSWAPINTERVALMESAPROC GetSwapIntervalMESA;
        /*   68 */ PFNGLXSWAPINTERVALMESAPROC SwapIntervalMESA;
        /*   69 */ PFNGLXCOPYBUFFERSUBDATANVPROC CopyBufferSubDataNV;
        /*   70 */ PFNGLXNAMEDCOPYBUFFERSUBDATANVPROC NamedCopyBufferSubDataNV;
        /*   71 */ PFNGLXCOPYIMAGESUBDATANVPROC CopyImageSubDataNV;
        /*   72 */ PFNGLXDELAYBEFORESWAPNVPROC DelayBeforeSwapNV;
        /*   73 */ PFNGLXENUMERATEVIDEODEVICESNVPROC EnumerateVideoDevicesNV;
        /*   74 */ PFNGLXBINDVIDEODEVICENVPROC BindVideoDeviceNV;
        /*   75 */ PFNGLXJOINSWAPGROUPNVPROC JoinSwapGroupNV;
        /*   76 */ PFNGLXBINDSWAPBARRIERNVPROC BindSwapBarrierNV;
        /*   77 */ PFNGLXQUERYSWAPGROUPNVPROC QuerySwapGroupNV;
        /*   78 */ PFNGLXQUERYMAXSWAPGROUPSNVPROC QueryMaxSwapGroupsNV;
        /*   79 */ PFNGLXQUERYFRAMECOUNTNVPROC QueryFrameCountNV;
        /*   80 */ PFNGLXRESETFRAMECOUNTNVPROC ResetFrameCountNV;
        /*   81 */ PFNGLXBINDVIDEOCAPTUREDEVICENVPROC BindVideoCaptureDeviceNV;
        /*   82 */ PFNGLXENUMERATEVIDEOCAPTUREDEVICESNVPROC EnumerateVideoCaptureDevicesNV;
        /*   83 */ PFNGLXLOCKVIDEOCAPTUREDEVICENVPROC LockVideoCaptureDeviceNV;
        /*   84 */ PFNGLXQUERYVIDEOCAPTUREDEVICENVPROC QueryVideoCaptureDeviceNV;
        /*   85 */ PFNGLXRELEASEVIDEOCAPTUREDEVICENVPROC ReleaseVideoCaptureDeviceNV;
        /*   86 */ PFNGLXGETVIDEODEVICENVPROC GetVideoDeviceNV;
        /*   87 */ PFNGLXRELEASEVIDEODEVICENVPROC ReleaseVideoDeviceNV;
        /*   88 */ PFNGLXBINDVIDEOIMAGENVPROC BindVideoImageNV;
        /*   89 */ PFNGLXRELEASEVIDEOIMAGENVPROC ReleaseVideoImageNV;
        /*   90 */ PFNGLXSENDPBUFFERTOVIDEONVPROC SendPbufferToVideoNV;
        /*   91 */ PFNGLXGETVIDEOINFONVPROC GetVideoInfoNV;
        /*   92 */ PFNGLXGETSYNCVALUESOMLPROC GetSyncValuesOML;
        /*   93 */ PFNGLXGETMSCRATEOMLPROC GetMscRateOML;
        /*   94 */ PFNGLXSWAPBUFFERSMSCOMLPROC SwapBuffersMscOML;
        /*   95 */ PFNGLXWAITFORMSCOMLPROC WaitForMscOML;
        /*   96 */ PFNGLXWAITFORSBCOMLPROC WaitForSbcOML;
        /*   97 */ PFNGLXCUSHIONSGIPROC CushionSGI;
        /*   98 */ PFNGLXMAKECURRENTREADSGIPROC MakeCurrentReadSGI;
        /*   99 */ PFNGLXGETCURRENTREADDRAWABLESGIPROC GetCurrentReadDrawableSGI;
        /*  100 */ PFNGLXSWAPINTERVALSGIPROC SwapIntervalSGI;
        /*  101 */ PFNGLXGETVIDEOSYNCSGIPROC GetVideoSyncSGI;
        /*  102 */ PFNGLXWAITVIDEOSYNCSGIPROC WaitVideoSyncSGI;
        /*  103 */ PFNGLXGETFBCONFIGATTRIBSGIXPROC GetFBConfigAttribSGIX;
        /*  104 */ PFNGLXCHOOSEFBCONFIGSGIXPROC ChooseFBConfigSGIX;
        /*  105 */ PFNGLXCREATEGLXPIXMAPWITHCONFIGSGIXPROC CreateGLXPixmapWithConfigSGIX;
        /*  106 */ PFNGLXCREATECONTEXTWITHCONFIGSGIXPROC CreateContextWithConfigSGIX;
        /*  107 */ PFNGLXGETVISUALFROMFBCONFIGSGIXPROC GetVisualFromFBConfigSGIX;
        /*  108 */ PFNGLXGETFBCONFIGFROMVISUALSGIXPROC GetFBConfigFromVisualSGIX;
        /*  109 */ PFNGLXQUERYHYPERPIPENETWORKSGIXPROC QueryHyperpipeNetworkSGIX;
        /*  110 */ PFNGLXHYPERPIPECONFIGSGIXPROC HyperpipeConfigSGIX;
        /*  111 */ PFNGLXQUERYHYPERPIPECONFIGSGIXPROC QueryHyperpipeConfigSGIX;
        /*  112 */ PFNGLXDESTROYHYPERPIPECONFIGSGIXPROC DestroyHyperpipeConfigSGIX;
        /*  113 */ PFNGLXBINDHYPERPIPESGIXPROC BindHyperpipeSGIX;
        /*  114 */ PFNGLXQUERYHYPERPIPEBESTATTRIBSGIXPROC QueryHyperpipeBestAttribSGIX;
        /*  115 */ PFNGLXHYPERPIPEATTRIBSGIXPROC HyperpipeAttribSGIX;
        /*  116 */ PFNGLXQUERYHYPERPIPEATTRIBSGIXPROC QueryHyperpipeAttribSGIX;
        /*  117 */ PFNGLXCREATEGLXPBUFFERSGIXPROC CreateGLXPbufferSGIX;
        /*  118 */ PFNGLXDESTROYGLXPBUFFERSGIXPROC DestroyGLXPbufferSGIX;
        /*  119 */ PFNGLXQUERYGLXPBUFFERSGIXPROC QueryGLXPbufferSGIX;
        /*  120 */ PFNGLXSELECTEVENTSGIXPROC SelectEventSGIX;
        /*  121 */ PFNGLXGETSELECTEDEVENTSGIXPROC GetSelectedEventSGIX;
        /*  122 */ PFNGLXBINDSWAPBARRIERSGIXPROC BindSwapBarrierSGIX;
        /*  123 */ PFNGLXQUERYMAXSWAPBARRIERSSGIXPROC QueryMaxSwapBarriersSGIX;
        /*  124 */ PFNGLXJOINSWAPGROUPSGIXPROC JoinSwapGroupSGIX;
        /*  125 */ PFNGLXBINDCHANNELTOWINDOWSGIXPROC BindChannelToWindowSGIX;
        /*  126 */ PFNGLXCHANNELRECTSGIXPROC ChannelRectSGIX;
        /*  127 */ PFNGLXQUERYCHANNELRECTSGIXPROC QueryChannelRectSGIX;
        /*  128 */ PFNGLXQUERYCHANNELDELTASSGIXPROC QueryChannelDeltasSGIX;
        /*  129 */ PFNGLXCHANNELRECTSYNCSGIXPROC ChannelRectSyncSGIX;
        /*  130 */ PFNGLXGETTRANSPARENTINDEXSUNPROC GetTransparentIndexSUN;
        };
    };
    /* Built-in loader library handle.  Set by gloamLoaderLoad*Context when it
       opens the platform library.  Pre-populate before calling that function
       to supply your own handle (dlopen is then skipped); zero it before
       calling gloamLoaderUnload*Context to prevent it closing a handle you
       still own.  Present on all context types so user code can use a single
       field name regardless of API. */
    void *gloam_loader_handle;


} GloamGLXContext;

/* Global context instance — a value, not a pointer, so the compiler knows
   its address is fixed and does not re-load it on every access. */
extern GloamGLXContext gloam_glx_context;

/* ---- Feature presence macros --------------------------------------------
   Test whether a versioned feature was detected at load time. */
#define GLOAM_GLX_VERSION_1_0 (gloam_glx_context.VERSION_1_0)
