/*
 * Generated by gloam 0.3.0. DO NOT EDIT.
 *
 *   gloam --extensions=all,-GL_EXT_direct_state_access,-GL_EXT_separate_shader_objects,-GL_EXT_vertex_shader,-GL_SUNX_constant_data,-GL_SUN_convolution_border_modes,-GL_SUN_global_alpha,-GL_SUN_mesh_array,-GL_SUN_slice_accum,-GL_SUN_triangle_list,-GL_SUN_vertex,-GL_SGIX_async,-GL_SGIX_async_histogram,-GL_SGIX_async_pixel,-GL_SGIX_blend_alpha_minmax,-GL_SGIX_calligraphic_fragment,-GL_SGIX_clipmap,-GL_SGIX_convolution_accuracy,-GL_SGIX_depth_pass_instrument,-GL_SGIX_depth_texture,-GL_SGIX_flush_raster,-GL_SGIX_fog_offset,-GL_SGIX_fragment_lighting,-GL_SGIX_framezoom,-GL_SGIX_igloo_interface,-GL_SGIX_instruments,-GL_SGIX_interlace,-GL_SGIX_ir_instrument1,-GL_SGIX_list_priority,-GL_SGIX_pixel_texture,-GL_SGIX_pixel_tiles,-GL_SGIX_polynomial_ffd,-GL_SGIX_reference_plane,-GL_SGIX_resample,-GL_SGIX_scalebias_hint,-GL_SGIX_shadow,-GL_SGIX_shadow_ambient,-GL_SGIX_sprite,-GL_SGIX_subsample,-GL_SGIX_tag_sample_buffer,-GL_SGIX_texture_add_env,-GL_SGIX_texture_coordinate_clamp,-GL_SGIX_texture_lod_bias,-GL_SGIX_texture_multi_buffer,-GL_SGIX_texture_scale_bias,-GL_SGIX_vertex_preclip,-GL_SGIX_ycrcb,-GL_SGIX_ycrcb_subsample,-GL_SGIX_ycrcba,-GL_NV_half_float,-GL_OES_byte_coordinates,-GL_ANGLE_robust_client_memory,-GL_ANGLE_shader_pixel_local_storage, --predecessors --promoted --api=gl:core,gles2,vulkan,egl,glx,wgl --baseline=gl:core=3.3,gles2=3.0 --out-path D:\dev\darwinia\contrib\gloam --merge c --alias --loader
 *

#define WGL_BIND_TO_TEXTURE_RECTANGLE_DEPTH_NV 0x20A4
#define WGL_DEPTH_TEXTURE_FORMAT_NV 0x20A5
#define WGL_TEXTURE_DEPTH_COMPONENT_NV 0x20A6
#define WGL_DEPTH_COMPONENT_NV 0x20A7
#define WGL_TYPE_RGBA_UNSIGNED_FLOAT_EXT 0x20A8
#define WGL_FRAMEBUFFER_SRGB_CAPABLE_ARB 0x20A9
#define WGL_FRAMEBUFFER_SRGB_CAPABLE_EXT 0x20A9
#define WGL_CONTEXT_MULTIGPU_ATTRIB_NV 0x20AA
#define WGL_CONTEXT_MULTIGPU_ATTRIB_SINGLE_NV 0x20AB
#define WGL_CONTEXT_MULTIGPU_ATTRIB_AFR_NV 0x20AC
#define WGL_CONTEXT_MULTIGPU_ATTRIB_MULTICAST_NV 0x20AD
#define WGL_CONTEXT_MULTIGPU_ATTRIB_MULTI_DISPLAY_MULTICAST_NV 0x20AE
#define WGL_FLOAT_COMPONENTS_NV 0x20B0
#define WGL_BIND_TO_TEXTURE_RECTANGLE_FLOAT_R_NV 0x20B1
#define WGL_BIND_TO_TEXTURE_RECTANGLE_FLOAT_RG_NV 0x20B2
#define WGL_BIND_TO_TEXTURE_RECTANGLE_FLOAT_RGB_NV 0x20B3
#define WGL_BIND_TO_TEXTURE_RECTANGLE_FLOAT_RGBA_NV 0x20B4
#define WGL_TEXTURE_FLOAT_R_NV 0x20B5
#define WGL_TEXTURE_FLOAT_RG_NV 0x20B6
#define WGL_TEXTURE_FLOAT_RGB_NV 0x20B7
#define WGL_TEXTURE_FLOAT_RGBA_NV 0x20B8
#define WGL_COLOR_SAMPLES_NV 0x20B9
#define WGL_BIND_TO_VIDEO_RGB_NV 0x20C0
#define WGL_BIND_TO_VIDEO_RGBA_NV 0x20C1
#define WGL_BIND_TO_VIDEO_RGB_AND_DEPTH_NV 0x20C2
#define WGL_VIDEO_OUT_COLOR_NV 0x20C3
#define WGL_VIDEO_OUT_ALPHA_NV 0x20C4
#define WGL_VIDEO_OUT_DEPTH_NV 0x20C5
#define WGL_VIDEO_OUT_COLOR_AND_ALPHA_NV 0x20C6
#define WGL_VIDEO_OUT_COLOR_AND_DEPTH_NV 0x20C7
#define WGL_VIDEO_OUT_FRAME 0x20C8
#define WGL_VIDEO_OUT_FIELD_1 0x20C9
#define WGL_VIDEO_OUT_FIELD_2 0x20CA
#define WGL_VIDEO_OUT_STACKED_FIELDS_1_2 0x20CB
#define WGL_VIDEO_OUT_STACKED_FIELDS_2_1 0x20CC
#define WGL_UNIQUE_ID_NV 0x20CE
#define WGL_NUM_VIDEO_CAPTURE_SLOTS_NV 0x20CF
#define ERROR_INCOMPATIBLE_AFFINITY_MASKS_NV 0x20D0
#define ERROR_MISSING_AFFINITY_MASK_NV 0x20D1
#define WGL_NUM_VIDEO_SLOTS_NV 0x20F0
#define WGL_TYPE_RGBA_FLOAT_ARB 0x21A0
#define WGL_TYPE_RGBA_FLOAT_ATI 0x21A0
#define WGL_GPU_FASTEST_TARGET_GPUS_AMD 0x21A2
#define WGL_GPU_RAM_AMD 0x21A3
#define WGL_GPU_CLOCK_AMD 0x21A4
#define WGL_GPU_NUM_PIPES_AMD 0x21A5
#define WGL_TEXTURE_RECTANGLE_ATI 0x21A5 /* Duplicates unrelated WGL_GPU_NUM_PIPES_AMD */
#define WGL_GPU_NUM_SIMD_AMD 0x21A6
#define WGL_GPU_NUM_RB_AMD 0x21A7
#define WGL_GPU_NUM_SPI_AMD 0x21A8
#define WGL_COLORSPACE_EXT 0x309D
#define WGL_COLORSPACE_SRGB_EXT 0x3089
#define WGL_COLORSPACE_LINEAR_EXT 0x308A
#define WGL_CONTEXT_OPENGL_NO_ERROR_ARB 0x31B3
#define WGL_LOSE_CONTEXT_ON_RESET_ARB 0x8252
#define WGL_CONTEXT_RESET_NOTIFICATION_STRATEGY_ARB 0x8256
#define WGL_NO_RESET_NOTIFICATION_ARB 0x8261
#define WGL_CONTEXT_PROFILE_MASK_ARB 0x9126

/* ---- Types ----------------------------------------------------------------
   Emitted in topological dependency order.  Consecutive types sharing the
   same platform guard are coalesced into a single #ifdef/#endif block. */
DECLARE_HANDLE(HPBUFFERARB);

DECLARE_HANDLE(HPBUFFEREXT);

DECLARE_HANDLE(HVIDEOOUTPUTDEVICENV);

DECLARE_HANDLE(HPVIDEODEV);

DECLARE_HANDLE(HPGPUNV);

DECLARE_HANDLE(HGPUNV);

DECLARE_HANDLE(HVIDEOINPUTDEVICENV);

struct _GPU_DEVICE {
    DWORD  cb;
    CHAR   DeviceName[32];
    CHAR   DeviceString[128];
    DWORD  Flags;
    RECT   rcVirtualScreen;
};

typedef struct _GPU_DEVICE GPU_DEVICE;

typedef struct _GPU_DEVICE *PGPU_DEVICE;


/* ---- PFN typedefs -------------------------------------------------------- */
typedef int (APIENTRYP PFNWGLCHOOSEPIXELFORMATPROC)(HDC hDc, const PIXELFORMATDESCRIPTOR * pPfd);
typedef int (APIENTRYP PFNWGLDESCRIBEPIXELFORMATPROC)(HDC hdc, int ipfd, UINT cjpfd, PIXELFORMATDESCRIPTOR * ppfd);
typedef UINT (APIENTRYP PFNWGLGETENHMETAFILEPIXELFORMATPROC)(HENHMETAFILE hemf, UINT cbBuffer, PIXELFORMATDESCRIPTOR * ppfd);
typedef int (APIENTRYP PFNWGLGETPIXELFORMATPROC)(HDC hdc);
typedef BOOL (APIENTRYP PFNWGLSETPIXELFORMATPROC)(HDC hdc, int ipfd, const PIXELFORMATDESCRIPTOR * ppfd);
typedef BOOL (APIENTRYP PFNWGLSWAPBUFFERSPROC)(HDC hdc);
typedef BOOL (APIENTRYP PFNWGLCOPYCONTEXTPROC)(HGLRC hglrcSrc, HGLRC hglrcDst, UINT mask);
typedef HGLRC (APIENTRYP PFNWGLCREATECONTEXTPROC)(HDC hDc);
typedef HGLRC (APIENTRYP PFNWGLCREATELAYERCONTEXTPROC)(HDC hDc, int level);
typedef BOOL (APIENTRYP PFNWGLDELETECONTEXTPROC)(HGLRC oldContext);
typedef BOOL (APIENTRYP PFNWGLDESCRIBELAYERPLANEPROC)(HDC hDc, int pixelFormat, int layerPlane, UINT nBytes, LAYERPLANEDESCRIPTOR * plpd);
typedef HGLRC (APIENTRYP PFNWGLGETCURRENTCONTEXTPROC)(void);
typedef HDC (APIENTRYP PFNWGLGETCURRENTDCPROC)(void);
typedef int (APIENTRYP PFNWGLGETLAYERPALETTEENTRIESPROC)(HDC hdc, int iLayerPlane, int iStart, int cEntries, COLORREF * pcr);
typedef PROC (APIENTRYP PFNWGLGETPROCADDRESSPROC)(LPCSTR lpszProc);
typedef BOOL (APIENTRYP PFNWGLMAKECURRENTPROC)(HDC hDc, HGLRC newContext);
typedef BOOL (APIENTRYP PFNWGLREALIZELAYERPALETTEPROC)(HDC hdc, int iLayerPlane, BOOL bRealize);
typedef int (APIENTRYP PFNWGLSETLAYERPALETTEENTRIESPROC)(HDC hdc, int iLayerPlane, int iStart, int cEntries, const COLORREF * pcr);
typedef BOOL (APIENTRYP PFNWGLSHARELISTSPROC)(HGLRC hrcSrvShare, HGLRC hrcSrvSource);
typedef BOOL (APIENTRYP PFNWGLSWAPLAYERBUFFERSPROC)(HDC hdc, UINT fuFlags);
typedef BOOL (APIENTRYP PFNWGLUSEFONTBITMAPSPROC)(HDC hDC, DWORD first, DWORD count, DWORD listBase);
typedef BOOL (APIENTRYP PFNWGLUSEFONTBITMAPSAPROC)(HDC hDC, DWORD first, DWORD count, DWORD listBase);
typedef BOOL (APIENTRYP PFNWGLUSEFONTBITMAPSWPROC)(HDC hDC, DWORD first, DWORD count, DWORD listBase);
typedef BOOL (APIENTRYP PFNWGLUSEFONTOUTLINESPROC)(HDC hDC, DWORD first, DWORD count, DWORD listBase, FLOAT deviation, FLOAT extrusion, int format, LPGLYPHMETRICSFLOAT lpgmf);
typedef BOOL (APIENTRYP PFNWGLUSEFONTOUTLINESAPROC)(HDC hDC, DWORD first, DWORD count, DWORD listBase, FLOAT deviation, FLOAT extrusion, int format, LPGLYPHMETRICSFLOAT lpgmf);
typedef BOOL (APIENTRYP PFNWGLUSEFONTOUTLINESWPROC)(HDC hDC, DWORD first, DWORD count, DWORD listBase, FLOAT deviation, FLOAT extrusion, int format, LPGLYPHMETRICSFLOAT lpgmf);
typedef BOOL (APIENTRYP PFNWGLSETSTEREOEMITTERSTATE3DLPROC)(HDC hDC, UINT uState);
typedef VOID (APIENTRYP PFNWGLBLITCONTEXTFRAMEBUFFERAMDPROC)(HGLRC dstCtx, GLint srcX0, GLint srcY0, GLint srcX1, GLint srcY1, GLint dstX0, GLint dstY0, GLint dstX1, GLint dstY1, GLbitfield mask, GLenum filter);
typedef HGLRC (APIENTRYP PFNWGLCREATEASSOCIATEDCONTEXTAMDPROC)(UINT id);
typedef HGLRC (APIENTRYP PFNWGLCREATEASSOCIATEDCONTEXTATTRIBSAMDPROC)(UINT id, HGLRC hShareContext, const int * attribList);
typedef BOOL (APIENTRYP PFNWGLDELETEASSOCIATEDCONTEXTAMDPROC)(HGLRC hglrc);
typedef UINT (APIENTRYP PFNWGLGETCONTEXTGPUIDAMDPROC)(HGLRC hglrc);
typedef HGLRC (APIENTRYP PFNWGLGETCURRENTASSOCIATEDCONTEXTAMDPROC)(void);
typedef UINT (APIENTRYP PFNWGLGETGPUIDSAMDPROC)(UINT maxCount, UINT * ids);
typedef INT (APIENTRYP PFNWGLGETGPUINFOAMDPROC)(UINT id, INT property, GLenum dataType, UINT size, void * data);
typedef BOOL (APIENTRYP PFNWGLMAKEASSOCIATEDCONTEXTCURRENTAMDPROC)(HGLRC hglrc);
typedef HANDLE (APIENTRYP PFNWGLCREATEBUFFERREGIONARBPROC)(HDC hDC, int iLayerPlane, UINT uType);
typedef VOID (APIENTRYP PFNWGLDELETEBUFFERREGIONARBPROC)(HANDLE hRegion);
typedef BOOL (APIENTRYP PFNWGLRESTOREBUFFERREGIONARBPROC)(HANDLE hRegion, int x, int y, int width, int height, int xSrc, int ySrc);
typedef BOOL (APIENTRYP PFNWGLSAVEBUFFERREGIONARBPROC)(HANDLE hRegion, int x, int y, int width, int height);
typedef HGLRC (APIENTRYP PFNWGLCREATECONTEXTATTRIBSARBPROC)(HDC hDC, HGLRC hShareContext, const int * attribList);
typedef const char * (APIENTRYP PFNWGLGETEXTENSIONSSTRINGARBPROC)(HDC hdc);
typedef HDC (APIENTRYP PFNWGLGETCURRENTREADDCARBPROC)(void);
typedef BOOL (APIENTRYP PFNWGLMAKECONTEXTCURRENTARBPROC)(HDC hDrawDC, HDC hReadDC, HGLRC hglrc);
typedef HPBUFFERARB (APIENTRYP PFNWGLCREATEPBUFFERARBPROC)(HDC hDC, int iPixelFormat, int iWidth, int iHeight, const int * piAttribList);
typedef BOOL (APIENTRYP PFNWGLDESTROYPBUFFERARBPROC)(HPBUFFERARB hPbuffer);
typedef HDC (APIENTRYP PFNWGLGETPBUFFERDCARBPROC)(HPBUFFERARB hPbuffer);
typedef BOOL (APIENTRYP PFNWGLQUERYPBUFFERARBPROC)(HPBUFFERARB hPbuffer, int iAttribute, int * piValue);
typedef int (APIENTRYP PFNWGLRELEASEPBUFFERDCARBPROC)(HPBUFFERARB hPbuffer, HDC hDC);
typedef BOOL (APIENTRYP PFNWGLCHOOSEPIXELFORMATARBPROC)(HDC hdc, const int * piAttribIList, const FLOAT * pfAttribFList, UINT nMaxFormats, int * piFormats, UINT * nNumFormats);
typedef BOOL (APIENTRYP PFNWGLGETPIXELFORMATATTRIBFVARBPROC)(HDC hdc, int iPixelFormat, int iLayerPlane, UINT nAttributes, const int * piAttributes, FLOAT * pfValues);
typedef BOOL (APIENTRYP PFNWGLGETPIXELFORMATATTRIBIVARBPROC)(HDC hdc, int iPixelFormat, int iLayerPlane, UINT nAttributes, const int * piAttributes, int * piValues);
typedef BOOL (APIENTRYP PFNWGLBINDTEXIMAGEARBPROC)(HPBUFFERARB hPbuffer, int iBuffer);
typedef BOOL (APIENTRYP PFNWGLRELEASETEXIMAGEARBPROC)(HPBUFFERARB hPbuffer, int iBuffer);
typedef BOOL (APIENTRYP PFNWGLSETPBUFFERATTRIBARBPROC)(HPBUFFERARB hPbuffer, const int * piAttribList);
typedef GLboolean (APIENTRYP PFNWGLBINDDISPLAYCOLORTABLEEXTPROC)(GLushort id);
typedef GLboolean (APIENTRYP PFNWGLCREATEDISPLAYCOLORTABLEEXTPROC)(GLushort id);
typedef VOID (APIENTRYP PFNWGLDESTROYDISPLAYCOLORTABLEEXTPROC)(GLushort id);
typedef GLboolean (APIENTRYP PFNWGLLOADDISPLAYCOLORTABLEEXTPROC)(const GLushort * table, GLuint length);
typedef const char * (APIENTRYP PFNWGLGETEXTENSIONSSTRINGEXTPROC)(void);
typedef HDC (APIENTRYP PFNWGLGETCURRENTREADDCEXTPROC)(void);
typedef BOOL (APIENTRYP PFNWGLMAKECONTEXTCURRENTEXTPROC)(HDC hDrawDC, HDC hReadDC, HGLRC hglrc);
typedef HPBUFFEREXT (APIENTRYP PFNWGLCREATEPBUFFEREXTPROC)(HDC hDC, int iPixelFormat, int iWidth, int iHeight, const int * piAttribList);
typedef BOOL (APIENTRYP PFNWGLDESTROYPBUFFEREXTPROC)(HPBUFFEREXT hPbuffer);
typedef HDC (APIENTRYP PFNWGLGETPBUFFERDCEXTPROC)(HPBUFFEREXT hPbuffer);
typedef BOOL (APIENTRYP PFNWGLQUERYPBUFFEREXTPROC)(HPBUFFEREXT hPbuffer, int iAttribute, int * piValue);
typedef int (APIENTRYP PFNWGLRELEASEPBUFFERDCEXTPROC)(HPBUFFEREXT hPbuffer, HDC hDC);
typedef BOOL (APIENTRYP PFNWGLCHOOSEPIXELFORMATEXTPROC)(HDC hdc, const int * piAttribIList, const FLOAT * pfAttribFList, UINT nMaxFormats, int * piFormats, UINT * nNumFormats);
typedef BOOL (APIENTRYP PFNWGLGETPIXELFORMATATTRIBFVEXTPROC)(HDC hdc, int iPixelFormat, int iLayerPlane, UINT nAttributes, int * piAttributes, FLOAT * pfValues);
typedef BOOL (APIENTRYP PFNWGLGETPIXELFORMATATTRIBIVEXTPROC)(HDC hdc, int iPixelFormat, int iLayerPlane, UINT nAttributes, int * piAttributes, int * piValues);
typedef int (APIENTRYP PFNWGLGETSWAPINTERVALEXTPROC)(void);
typedef BOOL (APIENTRYP PFNWGLSWAPINTERVALEXTPROC)(int interval);
typedef BOOL (APIENTRYP PFNWGLGETDIGITALVIDEOPARAMETERSI3DPROC)(HDC hDC, int iAttribute, int * piValue);
typedef BOOL (APIENTRYP PFNWGLSETDIGITALVIDEOPARAMETERSI3DPROC)(HDC hDC, int iAttribute, const int * piValue);
typedef BOOL (APIENTRYP PFNWGLGETGAMMATABLEI3DPROC)(HDC hDC, int iEntries, USHORT * puRed, USHORT * puGreen, USHORT * puBlue);
typedef BOOL (APIENTRYP PFNWGLGETGAMMATABLEPARAMETERSI3DPROC)(HDC hDC, int iAttribute, int * piValue);
typedef BOOL (APIENTRYP PFNWGLSETGAMMATABLEI3DPROC)(HDC hDC, int iEntries, const USHORT * puRed, const USHORT * puGreen, const USHORT * puBlue);
typedef BOOL (APIENTRYP PFNWGLSETGAMMATABLEPARAMETERSI3DPROC)(HDC hDC, int iAttribute, const int * piValue);
typedef BOOL (APIENTRYP PFNWGLDISABLEGENLOCKI3DPROC)(HDC hDC);
typedef BOOL (APIENTRYP PFNWGLENABLEGENLOCKI3DPROC)(HDC hDC);
typedef BOOL (APIENTRYP PFNWGLGENLOCKSAMPLERATEI3DPROC)(HDC hDC, UINT uRate);
typedef BOOL (APIENTRYP PFNWGLGENLOCKSOURCEDELAYI3DPROC)(HDC hDC, UINT uDelay);
typedef BOOL (APIENTRYP PFNWGLGENLOCKSOURCEEDGEI3DPROC)(HDC hDC, UINT uEdge);
typedef BOOL (APIENTRYP PFNWGLGENLOCKSOURCEI3DPROC)(HDC hDC, UINT uSource);
typedef BOOL (APIENTRYP PFNWGLGETGENLOCKSAMPLERATEI3DPROC)(HDC hDC, UINT * uRate);
typedef BOOL (APIENTRYP PFNWGLGETGENLOCKSOURCEDELAYI3DPROC)(HDC hDC, UINT * uDelay);
typedef BOOL (APIENTRYP PFNWGLGETGENLOCKSOURCEEDGEI3DPROC)(HDC hDC, UINT * uEdge);
typedef BOOL (APIENTRYP PFNWGLGETGENLOCKSOURCEI3DPROC)(HDC hDC, UINT * uSource);
typedef BOOL (APIENTRYP PFNWGLISENABLEDGENLOCKI3DPROC)(HDC hDC, BOOL * pFlag);
typedef BOOL (APIENTRYP PFNWGLQUERYGENLOCKMAXSOURCEDELAYI3DPROC)(HDC hDC, UINT * uMaxLineDelay, UINT * uMaxPixelDelay);
typedef BOOL (APIENTRYP PFNWGLASSOCIATEIMAGEBUFFEREVENTSI3DPROC)(HDC hDC, const HANDLE * pEvent, const LPVOID * pAddress, const DWORD * pSize, UINT count);
typedef LPVOID (APIENTRYP PFNWGLCREATEIMAGEBUFFERI3DPROC)(HDC hDC, DWORD dwSize, UINT uFlags);
typedef BOOL (APIENTRYP PFNWGLDESTROYIMAGEBUFFERI3DPROC)(HDC hDC, LPVOID pAddress);
typedef BOOL (APIENTRYP PFNWGLRELEASEIMAGEBUFFEREVENTSI3DPROC)(HDC hDC, const LPVOID * pAddress, UINT count);
typedef BOOL (APIENTRYP PFNWGLDISABLEFRAMELOCKI3DPROC)(void);
typedef BOOL (APIENTRYP PFNWGLENABLEFRAMELOCKI3DPROC)(void);
typedef BOOL (APIENTRYP PFNWGLISENABLEDFRAMELOCKI3DPROC)(BOOL * pFlag);
typedef BOOL (APIENTRYP PFNWGLQUERYFRAMELOCKMASTERI3DPROC)(BOOL * pFlag);
typedef BOOL (APIENTRYP PFNWGLBEGINFRAMETRACKINGI3DPROC)(void);
typedef BOOL (APIENTRYP PFNWGLENDFRAMETRACKINGI3DPROC)(void);
typedef BOOL (APIENTRYP PFNWGLGETFRAMEUSAGEI3DPROC)(float * pUsage);
typedef BOOL (APIENTRYP PFNWGLQUERYFRAMETRACKINGI3DPROC)(DWORD * pFrameCount, DWORD * pMissedFrames, float * pLastMissedUsage);
typedef BOOL (APIENTRYP PFNWGLCOPYIMAGESUBDATANVPROC)(HGLRC hSrcRC, GLuint srcName, GLenum srcTarget, GLint srcLevel, GLint srcX, GLint srcY, GLint srcZ, HGLRC hDstRC, GLuint dstName, GLenum dstTarget, GLint dstLevel, GLint dstX, GLint dstY, GLint dstZ, GLsizei width, GLsizei height, GLsizei depth);
typedef BOOL (APIENTRYP PFNWGLDELAYBEFORESWAPNVPROC)(HDC hDC, GLfloat seconds);
typedef BOOL (APIENTRYP PFNWGLDXCLOSEDEVICENVPROC)(HANDLE hDevice);
typedef BOOL (APIENTRYP PFNWGLDXLOCKOBJECTSNVPROC)(HANDLE hDevice, GLint count, HANDLE * hObjects);
typedef BOOL (APIENTRYP PFNWGLDXOBJECTACCESSNVPROC)(HANDLE hObject, GLenum access);
typedef HANDLE (APIENTRYP PFNWGLDXOPENDEVICENVPROC)(void * dxDevice);
typedef HANDLE (APIENTRYP PFNWGLDXREGISTEROBJECTNVPROC)(HANDLE hDevice, void * dxObject, GLuint name, GLenum type, GLenum access);
typedef BOOL (APIENTRYP PFNWGLDXSETRESOURCESHAREHANDLENVPROC)(void * dxObject, HANDLE shareHandle);
typedef BOOL (APIENTRYP PFNWGLDXUNLOCKOBJECTSNVPROC)(HANDLE hDevice, GLint count, HANDLE * hObjects);
typedef BOOL (APIENTRYP PFNWGLDXUNREGISTEROBJECTNVPROC)(HANDLE hDevice, HANDLE hObject);
typedef HDC (APIENTRYP PFNWGLCREATEAFFINITYDCNVPROC)(const HGPUNV * phGpuList);
typedef BOOL (APIENTRYP PFNWGLDELETEDCNVPROC)(HDC hdc);
typedef BOOL (APIENTRYP PFNWGLENUMGPUDEVICESNVPROC)(HGPUNV hGpu, UINT iDeviceIndex, PGPU_DEVICE lpGpuDevice);
typedef BOOL (APIENTRYP PFNWGLENUMGPUSFROMAFFINITYDCNVPROC)(HDC hAffinityDC, UINT iGpuIndex, HGPUNV * hGpu);
typedef BOOL (APIENTRYP PFNWGLENUMGPUSNVPROC)(UINT iGpuIndex, HGPUNV * phGpu);
typedef BOOL (APIENTRYP PFNWGLBINDVIDEODEVICENVPROC)(HDC hDc, unsigned int uVideoSlot, HVIDEOOUTPUTDEVICENV hVideoDevice, const int * piAttribList);
typedef int (APIENTRYP PFNWGLENUMERATEVIDEODEVICESNVPROC)(HDC hDc, HVIDEOOUTPUTDEVICENV * phDeviceList);
typedef BOOL (APIENTRYP PFNWGLQUERYCURRENTCONTEXTNVPROC)(int iAttribute, int * piValue);
typedef BOOL (APIENTRYP PFNWGLBINDSWAPBARRIERNVPROC)(GLuint group, GLuint barrier);
typedef BOOL (APIENTRYP PFNWGLJOINSWAPGROUPNVPROC)(HDC hDC, GLuint group);
typedef BOOL (APIENTRYP PFNWGLQUERYFRAMECOUNTNVPROC)(HDC hDC, GLuint * count);
typedef BOOL (APIENTRYP PFNWGLQUERYMAXSWAPGROUPSNVPROC)(HDC hDC, GLuint * maxGroups, GLuint * maxBarriers);
typedef BOOL (APIENTRYP PFNWGLQUERYSWAPGROUPNVPROC)(HDC hDC, GLuint * group, GLuint * barrier);
typedef BOOL (APIENTRYP PFNWGLRESETFRAMECOUNTNVPROC)(HDC hDC);
typedef BOOL (APIENTRYP PFNWGLBINDVIDEOCAPTUREDEVICENVPROC)(UINT uVideoSlot, HVIDEOINPUTDEVICENV hDevice);
typedef UINT (APIENTRYP PFNWGLENUMERATEVIDEOCAPTUREDEVICESNVPROC)(HDC hDc, HVIDEOINPUTDEVICENV * phDeviceList);
typedef BOOL (APIENTRYP PFNWGLLOCKVIDEOCAPTUREDEVICENVPROC)(HDC hDc, HVIDEOINPUTDEVICENV hDevice);
typedef BOOL (APIENTRYP PFNWGLQUERYVIDEOCAPTUREDEVICENVPROC)(HDC hDc, HVIDEOINPUTDEVICENV hDevice, int iAttribute, int * piValue);
typedef BOOL (APIENTRYP PFNWGLRELEASEVIDEOCAPTUREDEVICENVPROC)(HDC hDc, HVIDEOINPUTDEVICENV hDevice);
typedef BOOL (APIENTRYP PFNWGLBINDVIDEOIMAGENVPROC)(HPVIDEODEV hVideoDevice, HPBUFFERARB hPbuffer, int iVideoBuffer);
typedef BOOL (APIENTRYP PFNWGLGETVIDEODEVICENVPROC)(HDC hDC, int numDevices, HPVIDEODEV * hVideoDevice);
typedef BOOL (APIENTRYP PFNWGLGETVIDEOINFONVPROC)(HPVIDEODEV hpVideoDevice, unsigned long * pulCounterOutputPbuffer, unsigned long * pulCounterOutputVideo);
typedef BOOL (APIENTRYP PFNWGLRELEASEVIDEODEVICENVPROC)(HPVIDEODEV hVideoDevice);
typedef BOOL (APIENTRYP PFNWGLRELEASEVIDEOIMAGENVPROC)(HPBUFFERARB hPbuffer, int iVideoBuffer);
typedef BOOL (APIENTRYP PFNWGLSENDPBUFFERTOVIDEONVPROC)(HPBUFFERARB hPbuffer, int iBufferType, unsigned long * pulCounterPbuffer, BOOL bBlock);
typedef void * (APIENTRYP PFNWGLALLOCATEMEMORYNVPROC)(GLsizei size, GLfloat readfreq, GLfloat writefreq, GLfloat priority);
typedef void (APIENTRYP PFNWGLFREEMEMORYNVPROC)(void * pointer);
typedef BOOL (APIENTRYP PFNWGLGETMSCRATEOMLPROC)(HDC hdc, INT32 * numerator, INT32 * denominator);
typedef BOOL (APIENTRYP PFNWGLGETSYNCVALUESOMLPROC)(HDC hdc, INT64 * ust, INT64 * msc, INT64 * sbc);
typedef INT64 (APIENTRYP PFNWGLSWAPBUFFERSMSCOMLPROC)(HDC hdc, INT64 target_msc, INT64 divisor, INT64 remainder);
typedef INT64 (APIENTRYP PFNWGLSWAPLAYERBUFFERSMSCOMLPROC)(HDC hdc, INT fuPlanes, INT64 target_msc, INT64 divisor, INT64 remainder);
typedef BOOL (APIENTRYP PFNWGLWAITFORMSCOMLPROC)(HDC hdc, INT64 target_msc, INT64 divisor, INT64 remainder, INT64 * ust, INT64 * msc, INT64 * sbc);
typedef BOOL (APIENTRYP PFNWGLWAITFORSBCOMLPROC)(HDC hdc, INT64 target_sbc, INT64 * ust, INT64 * msc, INT64 * sbc);


/* ---- Context struct ------------------------------------------------------
   Three anonymous unions give both indexed (array) and named (struct member)
   access to the same memory, at zero runtime cost.

   featArray / extArray: unsigned char flags, one per feature / extension.
   pfnArray: function pointer slots, one per command.

   Anonymous structs inside the unions are a C11 / GCC extension; they are
   universally supported on our target compilers. */
typedef struct GloamWGLContext {
    union {
        unsigned char featArray[1];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        };
    };

    union {
        unsigned char extArray[57];
        struct {
        /*    0 */ unsigned char _3DFX_multisample;
        /*    1 */ unsigned char _3DL_stereo_control;
        /*    2 */ unsigned char AMD_gpu_association;
        /*    3 */ unsigned char ARB_buffer_region;
        /*    4 */ unsigned char ARB_context_flush_control;
        /*    5 */ unsigned char ARB_create_context;
        /*    6 */ unsigned char ARB_create_context_no_error;
        /*    7 */ unsigned char ARB_create_context_profile;
        /*    8 */ unsigned char ARB_create_context_robustness;
        /*    9 */ unsigned char ARB_extensions_string;
        /*   10 */ unsigned char ARB_framebuffer_sRGB;
        /*   11 */ unsigned char ARB_make_current_read;
        /*   12 */ unsigned char ARB_multisample;
        /*   13 */ unsigned char ARB_pbuffer;
        /*   14 */ unsigned char ARB_pixel_format;
        /*   15 */ unsigned char ARB_pixel_format_float;
        /*   16 */ unsigned char ARB_render_texture;
        /*   17 */ unsigned char ARB_robustness_application_isolation;
        /*   18 */ unsigned char ARB_robustness_share_group_isolation;
        /*   19 */ unsigned char ATI_pixel_format_float;
        /*   20 */ unsigned char ATI_render_texture_rectangle;
        /*   21 */ unsigned char EXT_colorspace;
        /*   22 */ unsigned char EXT_create_context_es2_profile;
        /*   23 */ unsigned char EXT_create_context_es_profile;
        /*   24 */ unsigned char EXT_depth_float;
        /*   25 */ unsigned char EXT_display_color_table;
        /*   26 */ unsigned char EXT_extensions_string;
        /*   27 */ unsigned char EXT_framebuffer_sRGB;
        /*   28 */ unsigned char EXT_make_current_read;
        /*   29 */ unsigned char EXT_multisample;
        /*   30 */ unsigned char EXT_pbuffer;
        /*   31 */ unsigned char EXT_pixel_format;
        /*   32 */ unsigned char EXT_pixel_format_packed_float;
        /*   33 */ unsigned char EXT_swap_control;
        /*   34 */ unsigned char EXT_swap_control_tear;
        /*   35 */ unsigned char I3D_digital_video_control;
        /*   36 */ unsigned char I3D_gamma;
        /*   37 */ unsigned char I3D_genlock;
        /*   38 */ unsigned char I3D_image_buffer;
        /*   39 */ unsigned char I3D_swap_frame_lock;
        /*   40 */ unsigned char I3D_swap_frame_usage;
        /*   41 */ unsigned char NV_DX_interop;
        /*   42 */ unsigned char NV_DX_interop2;
        /*   43 */ unsigned char NV_copy_image;
        /*   44 */ unsigned char NV_delay_before_swap;
        /*   45 */ unsigned char NV_float_buffer;
        /*   46 */ unsigned char NV_gpu_affinity;
        /*   47 */ unsigned char NV_multigpu_context;
        /*   48 */ unsigned char NV_multisample_coverage;
        /*   49 */ unsigned char NV_present_video;
        /*   50 */ unsigned char NV_render_depth_texture;
        /*   51 */ unsigned char NV_render_texture_rectangle;
        /*   52 */ unsigned char NV_swap_group;
        /*   53 */ unsigned char NV_vertex_array_range;
        /*   54 */ unsigned char NV_video_capture;
        /*   55 */ unsigned char NV_video_output;
        /*   56 */ unsigned char OML_sync_control;
        };
    };

    union {
        void *pfnArray[145];
        struct {
        /*    0 */ PFNWGLCHOOSEPIXELFORMATPROC ChoosePixelFormat;
        /*    1 */ PFNWGLDESCRIBEPIXELFORMATPROC DescribePixelFormat;
        /*    2 */ PFNWGLGETENHMETAFILEPIXELFORMATPROC GetEnhMetaFilePixelFormat;
        /*    3 */ PFNWGLGETPIXELFORMATPROC GetPixelFormat;
        /*    4 */ PFNWGLSETPIXELFORMATPROC SetPixelFormat;
        /*    5 */ PFNWGLSWAPBUFFERSPROC SwapBuffers;
        /*    6 */ PFNWGLCOPYCONTEXTPROC CopyContext;
        /*    7 */ PFNWGLCREATECONTEXTPROC CreateContext;
        /*    8 */ PFNWGLCREATELAYERCONTEXTPROC CreateLayerContext;
        /*    9 */ PFNWGLDELETECONTEXTPROC DeleteContext;
        /*   10 */ PFNWGLDESCRIBELAYERPLANEPROC DescribeLayerPlane;
        /*   11 */ PFNWGLGETCURRENTCONTEXTPROC GetCurrentContext;
        /*   12 */ PFNWGLGETCURRENTDCPROC GetCurrentDC;
        /*   13 */ PFNWGLGETLAYERPALETTEENTRIESPROC GetLayerPaletteEntries;
        /*   14 */ PFNWGLGETPROCADDRESSPROC GetProcAddress;
        /*   15 */ PFNWGLMAKECURRENTPROC MakeCurrent;
        /*   16 */ PFNWGLREALIZELAYERPALETTEPROC RealizeLayerPalette;
        /*   17 */ PFNWGLSETLAYERPALETTEENTRIESPROC SetLayerPaletteEntries;
        /*   18 */ PFNWGLSHARELISTSPROC ShareLists;
        /*   19 */ PFNWGLSWAPLAYERBUFFERSPROC SwapLayerBuffers;
        /*   20 */ PFNWGLUSEFONTBITMAPSPROC UseFontBitmaps;
        /*   21 */ PFNWGLUSEFONTBITMAPSAPROC UseFontBitmapsA;
        /*   22 */ PFNWGLUSEFONTBITMAPSWPROC UseFontBitmapsW;
        /*   23 */ PFNWGLUSEFONTOUTLINESPROC UseFontOutlines;
        /*   24 */ PFNWGLUSEFONTOUTLINESAPROC UseFontOutlinesA;
        /*   25 */ PFNWGLUSEFONTOUTLINESWPROC UseFontOutlinesW;
        /*   26 */ PFNWGLSETSTEREOEMITTERSTATE3DLPROC SetStereoEmitterState3DL;
        /*   27 */ PFNWGLBLITCONTEXTFRAMEBUFFERAMDPROC BlitContextFramebufferAMD;
        /*   28 */ PFNWGLCREATEASSOCIATEDCONTEXTAMDPROC CreateAssociatedContextAMD;
        /*   29 */ PFNWGLCREATEASSOCIATEDCONTEXTATTRIBSAMDPROC CreateAssociatedContextAttribsAMD;
        /*   30 */ PFNWGLDELETEASSOCIATEDCONTEXTAMDPROC DeleteAssociatedContextAMD;
        /*   31 */ PFNWGLGETCONTEXTGPUIDAMDPROC GetContextGPUIDAMD;
        /*   32 */ PFNWGLGETCURRENTASSOCIATEDCONTEXTAMDPROC GetCurrentAssociatedContextAMD;
        /*   33 */ PFNWGLGETGPUIDSAMDPROC GetGPUIDsAMD;
        /*   34 */ PFNWGLGETGPUINFOAMDPROC GetGPUInfoAMD;
        /*   35 */ PFNWGLMAKEASSOCIATEDCONTEXTCURRENTAMDPROC MakeAssociatedContextCurrentAMD;
        /*   36 */ PFNWGLCREATEBUFFERREGIONARBPROC CreateBufferRegionARB;
        /*   37 */ PFNWGLDELETEBUFFERREGIONARBPROC DeleteBufferRegionARB;
        /*   38 */ PFNWGLRESTOREBUFFERREGIONARBPROC RestoreBufferRegionARB;
        /*   39 */ PFNWGLSAVEBUFFERREGIONARBPROC SaveBufferRegionARB;
        /*   40 */ PFNWGLCREATECONTEXTATTRIBSARBPROC CreateContextAttribsARB;
        /*   41 */ PFNWGLGETEXTENSIONSSTRINGARBPROC GetExtensionsStringARB;
        /*   42 */ PFNWGLGETCURRENTREADDCARBPROC GetCurrentReadDCARB;
        /*   43 */ PFNWGLMAKECONTEXTCURRENTARBPROC MakeContextCurrentARB;
        /*   44 */ PFNWGLCREATEPBUFFERARBPROC CreatePbufferARB;
        /*   45 */ PFNWGLDESTROYPBUFFERARBPROC DestroyPbufferARB;
        /*   46 */ PFNWGLGETPBUFFERDCARBPROC GetPbufferDCARB;
        /*   47 */ PFNWGLQUERYPBUFFERARBPROC QueryPbufferARB;
        /*   48 */ PFNWGLRELEASEPBUFFERDCARBPROC ReleasePbufferDCARB;
        /*   49 */ PFNWGLCHOOSEPIXELFORMATARBPROC ChoosePixelFormatARB;
        /*   50 */ PFNWGLGETPIXELFORMATATTRIBFVARBPROC GetPixelFormatAttribfvARB;
        /*   51 */ PFNWGLGETPIXELFORMATATTRIBIVARBPROC GetPixelFormatAttribivARB;
        /*   52 */ PFNWGLBINDTEXIMAGEARBPROC BindTexImageARB;
        /*   53 */ PFNWGLRELEASETEXIMAGEARBPROC ReleaseTexImageARB;
        /*   54 */ PFNWGLSETPBUFFERATTRIBARBPROC SetPbufferAttribARB;
        /*   55 */ PFNWGLBINDDISPLAYCOLORTABLEEXTPROC BindDisplayColorTableEXT;
        /*   56 */ PFNWGLCREATEDISPLAYCOLORTABLEEXTPROC CreateDisplayColorTableEXT;
        /*   57 */ PFNWGLDESTROYDISPLAYCOLORTABLEEXTPROC DestroyDisplayColorTableEXT;
        /*   58 */ PFNWGLLOADDISPLAYCOLORTABLEEXTPROC LoadDisplayColorTableEXT;
        /*   59 */ PFNWGLGETEXTENSIONSSTRINGEXTPROC GetExtensionsStringEXT;
        /*   60 */ PFNWGLGETCURRENTREADDCEXTPROC GetCurrentReadDCEXT;
        /*   61 */ PFNWGLMAKECONTEXTCURRENTEXTPROC MakeContextCurrentEXT;
        /*   62 */ PFNWGLCREATEPBUFFEREXTPROC CreatePbufferEXT;
        /*   63 */ PFNWGLDESTROYPBUFFEREXTPROC DestroyPbufferEXT;
        /*   64 */ PFNWGLGETPBUFFERDCEXTPROC GetPbufferDCEXT;
        /*   65 */ PFNWGLQUERYPBUFFEREXTPROC QueryPbufferEXT;
        /*   66 */ PFNWGLRELEASEPBUFFERDCEXTPROC ReleasePbufferDCEXT;
        /*   67 */ PFNWGLCHOOSEPIXELFORMATEXTPROC ChoosePixelFormatEXT;
        /*   68 */ PFNWGLGETPIXELFORMATATTRIBFVEXTPROC GetPixelFormatAttribfvEXT;
        /*   69 */ PFNWGLGETPIXELFORMATATTRIBIVEXTPROC GetPixelFormatAttribivEXT;
        /*   70 */ PFNWGLGETSWAPINTERVALEXTPROC GetSwapIntervalEXT;
        /*   71 */ PFNWGLSWAPINTERVALEXTPROC SwapIntervalEXT;
        /*   72 */ PFNWGLGETDIGITALVIDEOPARAMETERSI3DPROC GetDigitalVideoParametersI3D;
        /*   73 */ PFNWGLSETDIGITALVIDEOPARAMETERSI3DPROC SetDigitalVideoParametersI3D;
        /*   74 */ PFNWGLGETGAMMATABLEI3DPROC GetGammaTableI3D;
        /*   75 */ PFNWGLGETGAMMATABLEPARAMETERSI3DPROC GetGammaTableParametersI3D;
        /*   76 */ PFNWGLSETGAMMATABLEI3DPROC SetGammaTableI3D;
        /*   77 */ PFNWGLSETGAMMATABLEPARAMETERSI3DPROC SetGammaTableParametersI3D;
        /*   78 */ PFNWGLDISABLEGENLOCKI3DPROC DisableGenlockI3D;
        /*   79 */ PFNWGLENABLEGENLOCKI3DPROC EnableGenlockI3D;
        /*   80 */ PFNWGLGENLOCKSAMPLERATEI3DPROC GenlockSampleRateI3D;
        /*   81 */ PFNWGLGENLOCKSOURCEDELAYI3DPROC GenlockSourceDelayI3D;
        /*   82 */ PFNWGLGENLOCKSOURCEEDGEI3DPROC GenlockSourceEdgeI3D;
        /*   83 */ PFNWGLGENLOCKSOURCEI3DPROC GenlockSourceI3D;
        /*   84 */ PFNWGLGETGENLOCKSAMPLERATEI3DPROC GetGenlockSampleRateI3D;
        /*   85 */ PFNWGLGETGENLOCKSOURCEDELAYI3DPROC GetGenlockSourceDelayI3D;
        /*   86 */ PFNWGLGETGENLOCKSOURCEEDGEI3DPROC GetGenlockSourceEdgeI3D;
        /*   87 */ PFNWGLGETGENLOCKSOURCEI3DPROC GetGenlockSourceI3D;
        /*   88 */ PFNWGLISENABLEDGENLOCKI3DPROC IsEnabledGenlockI3D;
        /*   89 */ PFNWGLQUERYGENLOCKMAXSOURCEDELAYI3DPROC QueryGenlockMaxSourceDelayI3D;
        /*   90 */ PFNWGLASSOCIATEIMAGEBUFFEREVENTSI3DPROC AssociateImageBufferEventsI3D;
        /*   91 */ PFNWGLCREATEIMAGEBUFFERI3DPROC CreateImageBufferI3D;
        /*   92 */ PFNWGLDESTROYIMAGEBUFFERI3DPROC DestroyImageBufferI3D;
        /*   93 */ PFNWGLRELEASEIMAGEBUFFEREVENTSI3DPROC ReleaseImageBufferEventsI3D;
        /*   94 */ PFNWGLDISABLEFRAMELOCKI3DPROC DisableFrameLockI3D;
        /*   95 */ PFNWGLENABLEFRAMELOCKI3DPROC EnableFrameLockI3D;
        /*   96 */ PFNWGLISENABLEDFRAMELOCKI3DPROC IsEnabledFrameLockI3D;
        /*   97 */ PFNWGLQUERYFRAMELOCKMASTERI3DPROC QueryFrameLockMasterI3D;
        /*   98 */ PFNWGLBEGINFRAMETRACKINGI3DPROC BeginFrameTrackingI3D;
        /*   99 */ PFNWGLENDFRAMETRACKINGI3DPROC EndFrameTrackingI3D;
        /*  100 */ PFNWGLGETFRAMEUSAGEI3DPROC GetFrameUsageI3D;
        /*  101 */ PFNWGLQUERYFRAMETRACKINGI3DPROC QueryFrameTrackingI3D;
        /*  102 */ PFNWGLCOPYIMAGESUBDATANVPROC CopyImageSubDataNV;
        /*  103 */ PFNWGLDELAYBEFORESWAPNVPROC DelayBeforeSwapNV;
        /*  104 */ PFNWGLDXCLOSEDEVICENVPROC DXCloseDeviceNV;
        /*  105 */ PFNWGLDXLOCKOBJECTSNVPROC DXLockObjectsNV;
        /*  106 */ PFNWGLDXOBJECTACCESSNVPROC DXObjectAccessNV;
        /*  107 */ PFNWGLDXOPENDEVICENVPROC DXOpenDeviceNV;
        /*  108 */ PFNWGLDXREGISTEROBJECTNVPROC DXRegisterObjectNV;
        /*  109 */ PFNWGLDXSETRESOURCESHAREHANDLENVPROC DXSetResourceShareHandleNV;
        /*  110 */ PFNWGLDXUNLOCKOBJECTSNVPROC DXUnlockObjectsNV;
        /*  111 */ PFNWGLDXUNREGISTEROBJECTNVPROC DXUnregisterObjectNV;
        /*  112 */ PFNWGLCREATEAFFINITYDCNVPROC CreateAffinityDCNV;
        /*  113 */ PFNWGLDELETEDCNVPROC DeleteDCNV;
        /*  114 */ PFNWGLENUMGPUDEVICESNVPROC EnumGpuDevicesNV;
        /*  115 */ PFNWGLENUMGPUSFROMAFFINITYDCNVPROC EnumGpusFromAffinityDCNV;
        /*  116 */ PFNWGLENUMGPUSNVPROC EnumGpusNV;
        /*  117 */ PFNWGLBINDVIDEODEVICENVPROC BindVideoDeviceNV;
        /*  118 */ PFNWGLENUMERATEVIDEODEVICESNVPROC EnumerateVideoDevicesNV;
        /*  119 */ PFNWGLQUERYCURRENTCONTEXTNVPROC QueryCurrentContextNV;
        /*  120 */ PFNWGLBINDSWAPBARRIERNVPROC BindSwapBarrierNV;
        /*  121 */ PFNWGLJOINSWAPGROUPNVPROC JoinSwapGroupNV;
        /*  122 */ PFNWGLQUERYFRAMECOUNTNVPROC QueryFrameCountNV;
        /*  123 */ PFNWGLQUERYMAXSWAPGROUPSNVPROC QueryMaxSwapGroupsNV;
        /*  124 */ PFNWGLQUERYSWAPGROUPNVPROC QuerySwapGroupNV;
        /*  125 */ PFNWGLRESETFRAMECOUNTNVPROC ResetFrameCountNV;
        /*  126 */ PFNWGLBINDVIDEOCAPTUREDEVICENVPROC BindVideoCaptureDeviceNV;
        /*  127 */ PFNWGLENUMERATEVIDEOCAPTUREDEVICESNVPROC EnumerateVideoCaptureDevicesNV;
        /*  128 */ PFNWGLLOCKVIDEOCAPTUREDEVICENVPROC LockVideoCaptureDeviceNV;
        /*  129 */ PFNWGLQUERYVIDEOCAPTUREDEVICENVPROC QueryVideoCaptureDeviceNV;
        /*  130 */ PFNWGLRELEASEVIDEOCAPTUREDEVICENVPROC ReleaseVideoCaptureDeviceNV;
        /*  131 */ PFNWGLBINDVIDEOIMAGENVPROC BindVideoImageNV;
        /*  132 */ PFNWGLGETVIDEODEVICENVPROC GetVideoDeviceNV;
        /*  133 */ PFNWGLGETVIDEOINFONVPROC GetVideoInfoNV;
        /*  134 */ PFNWGLRELEASEVIDEODEVICENVPROC ReleaseVideoDeviceNV;
        /*  135 */ PFNWGLRELEASEVIDEOIMAGENVPROC ReleaseVideoImageNV;
        /*  136 */ PFNWGLSENDPBUFFERTOVIDEONVPROC SendPbufferToVideoNV;
        /*  137 */ PFNWGLALLOCATEMEMORYNVPROC AllocateMemoryNV;
        /*  138 */ PFNWGLFREEMEMORYNVPROC FreeMemoryNV;
        /*  139 */ PFNWGLGETMSCRATEOMLPROC GetMscRateOML;
        /*  140 */ PFNWGLGETSYNCVALUESOMLPROC GetSyncValuesOML;
        /*  141 */ PFNWGLSWAPBUFFERSMSCOMLPROC SwapBuffersMscOML;
        /*  142 */ PFNWGLSWAPLAYERBUFFERSMSCOMLPROC SwapLayerBuffersMscOML;
        /*  143 */ PFNWGLWAITFORMSCOMLPROC WaitForMscOML;
        /*  144 */ PFNWGLWAITFORSBCOMLPROC WaitForSbcOML;
        };
    };
    /* Built-in loader library handle.  Set by gloamLoaderLoad*Context when it
       opens the platform library.  Pre-populate before calling that function
       to supply your own handle (dlopen is then skipped); zero it before
       calling gloamLoaderUnload*Context to prevent it closing a handle you
       still own.  Present on all context types so user code can use a single
       field name regardless of API. */
    void *gloam_loader_handle;


} GloamWGLContext;

/* Global context instance — a value, not a pointer, so the compiler knows
   its address is fixed and does not re-load it on every access. */
extern GloamWGLContext gloam_wgl_context;

/* ---- Feature presence macros --------------------------------------------
   Test whether a versioned feature was detected at load time. */
#define GLOAM_WGL_VERSION_1_0 (gloam_wgl_context.VERSION_1_0)

